{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ************************************************************************************************************************
. 
. **Format time-series variables using the do file**
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKB.dta",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. 
. capture gen double ts_53_0_0 = date(s_53_0_0,"DMY")
{txt}
{com}. capture format ts_53_0_0 %td
{txt}
{com}. capture label variable ts_53_0_0 "Date of attending assessment centre"
{txt}
{com}. 
. capture gen double ts_53_0_0 = date(s_53_0_0,"DMY")
{txt}
{com}. capture format ts_53_0_0 %td
{txt}
{com}. capture label variable ts_53_0_0 "Date of attending assessment centre"
{txt}
{com}. 
. capture gen double ts_53_1_0 = date(s_53_1_0,"DMY")
{txt}
{com}. capture format ts_53_1_0 %td
{txt}
{com}. capture label variable ts_53_1_0 "Date of attending assessment centre"
{txt}
{com}. 
. capture gen double ts_53_2_0 = date(s_53_2_0,"DMY")
{txt}
{com}. capture format ts_53_2_0 %td
{txt}
{com}. capture label variable ts_53_2_0 "Date of attending assessment centre"
{txt}
{com}. 
. capture gen double ts_53_3_0 = date(s_53_3_0,"DMY")
{txt}
{com}. capture format ts_53_3_0 %td
{txt}
{com}. capture label variable ts_53_3_0 "Date of attending assessment centre"
{txt}
{com}. 
. capture gen double ts_40000_0_0 = date(s_40000_0_0,"DMY")
{txt}
{com}. capture format ts_40000_0_0 %td
{txt}
{com}. capture label variable ts_40000_0_0 "Date of death"
{txt}
{com}. 
. capture gen double ts_40000_1_0 = date(s_40000_1_0,"DMY")
{txt}
{com}. capture format ts_40000_1_0 %td
{txt}
{com}. capture label variable ts_40000_1_0 "Date of death"
{txt}
{com}. 
. 
. format %18.14f n_40007_0_0
{txt}
{com}. format %18.14f n_40007_1_0
{txt}
{com}. 
. capture gen double ts_42018_0_0 = date(s_42018_0_0,"DMY")
{txt}
{com}. capture format ts_42018_0_0 %td
{txt}
{com}. capture label variable ts_42018_0_0 "Date of all cause dementia report"
{txt}
{com}. 
. capture gen double ts_42020_0_0 = date(s_42020_0_0,"DMY")
{txt}
{com}. capture format ts_42020_0_0 %td
{txt}
{com}. capture label variable ts_42020_0_0 "Date of alzheimers disease report"
{txt}
{com}. 
. 
. **forval s1 = (0000 0002:0344) (0992 0994:1002) (1424 1426:1462) (1696 1698:1708) (1840 1842 2054 2070 2074 2098 2108 2110) {c -(}
. **gen double ts_13`s1'_0_0=date(s_13`s1'_0_0, "DMY")
. **{c )-}
. **capture format ts_13`s1'_0_0 %td
. **{c )-}
. 
. 
. 
. **0000 to 0344***
. gen double ts_130000_0_0 = date(s_130000_0_0,"DMY")
{txt}(502,363 missing values generated)

{com}. format ts_130000_0_0 %td
{txt}
{com}. capture drop s_130000_0_0
{txt}
{com}. label variable ts_130000_0_0 "Date A00 first reported (cholera)"
{txt}
{com}. gen double ts_130002_0_0 = date(s_130002_0_0,"DMY")
{txt}(502,228 missing values generated)

{com}. format ts_130002_0_0 %td
{txt}
{com}. capture drop s_130002_0_0
{txt}
{com}. label variable ts_130002_0_0 "Date A01 first reported (typhoid and paratyphoid fevers)"
{txt}
{com}. gen double ts_130004_0_0 = date(s_130004_0_0,"DMY")
{txt}(501,593 missing values generated)

{com}. format ts_130004_0_0 %td
{txt}
{com}. capture drop s_130004_0_0
{txt}
{com}. label variable ts_130004_0_0 "Date A02 first reported (other salmonella infections)"
{txt}
{com}. gen double ts_130006_0_0 = date(s_130006_0_0,"DMY")
{txt}(502,177 missing values generated)

{com}. format ts_130006_0_0 %td
{txt}
{com}. capture drop s_130006_0_0
{txt}
{com}. label variable ts_130006_0_0 "Date A03 first reported (shigellosis)"
{txt}
{com}. gen double ts_130008_0_0 = date(s_130008_0_0,"DMY")
{txt}(493,968 missing values generated)

{com}. format ts_130008_0_0 %td
{txt}
{com}. capture drop s_130008_0_0
{txt}
{com}. label variable ts_130008_0_0 "Date A04 first reported (other bacterial intestinal infections)"
{txt}
{com}. gen double ts_130010_0_0 = date(s_130010_0_0,"DMY")
{txt}(501,986 missing values generated)

{com}. format ts_130010_0_0 %td
{txt}
{com}. capture drop s_130010_0_0
{txt}
{com}. label variable ts_130010_0_0 "Date A05 first reported (other bacterial foodborne intoxications)"
{txt}
{com}. gen double ts_130012_0_0 = date(s_130012_0_0,"DMY")
{txt}(502,271 missing values generated)

{com}. format ts_130012_0_0 %td
{txt}
{com}. capture drop s_130012_0_0
{txt}
{com}. label variable ts_130012_0_0 "Date A06 first reported (amoebiasis)"
{txt}
{com}. gen double ts_130014_0_0 = date(s_130014_0_0,"DMY")
{txt}(501,881 missing values generated)

{com}. format ts_130014_0_0 %td
{txt}
{com}. capture drop s_130014_0_0
{txt}
{com}. label variable ts_130014_0_0 "Date A07 first reported (other protozoal intestinal diseases)"
{txt}
{com}. gen double ts_130016_0_0 = date(s_130016_0_0,"DMY")
{txt}(496,779 missing values generated)

{com}. format ts_130016_0_0 %td
{txt}
{com}. capture drop s_130016_0_0
{txt}
{com}. label variable ts_130016_0_0 "Date A08 first reported (viral and other specified intestinal infections)"
{txt}
{com}. gen double ts_130018_0_0 = date(s_130018_0_0,"DMY")
{txt}(477,843 missing values generated)

{com}. format ts_130018_0_0 %td
{txt}
{com}. capture drop s_130018_0_0
{txt}
{com}. label variable ts_130018_0_0 "Date A09 first reported (diarrhoea and gastro-enteritis of presumed infectious origin)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130020_0_0 = date(s_130020_0_0,"DMY")
{txt}(499,675 missing values generated)

{com}. format ts_130020_0_0 %td
{txt}
{com}. capture drop s_130020_0_0
{txt}
{com}. label variable ts_130020_0_0 "Date A15 first reported (respiratory tuberculosis, bacteriologically and histologically confirmed)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130022_0_0 = date(s_130022_0_0,"DMY")
{txt}(501,718 missing values generated)

{com}. format ts_130022_0_0 %td
{txt}
{com}. capture drop s_130022_0_0
{txt}
{com}. label variable ts_130022_0_0 "Date A16 first reported (respiratory tuberculosis, not confirmed bacteriologically or histologically)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130024_0_0 = date(s_130024_0_0,"DMY")
{txt}(502,367 missing values generated)

{com}. format ts_130024_0_0 %td
{txt}
{com}. capture drop s_130024_0_0
{txt}
{com}. label variable ts_130024_0_0 "Date A17 first reported (tuberculosis of nervous system)"
{txt}
{com}. gen double ts_130026_0_0 = date(s_130026_0_0,"DMY")
{txt}(502,193 missing values generated)

{com}. format ts_130026_0_0 %td
{txt}
{com}. capture drop s_130026_0_0
{txt}
{com}. label variable ts_130026_0_0 "Date A18 first reported (tuberculosis of other organs)"
{txt}
{com}. gen double ts_130028_0_0 = date(s_130028_0_0,"DMY")
{txt}(502,361 missing values generated)

{com}. format ts_130028_0_0 %td
{txt}
{com}. capture drop s_130028_0_0
{txt}
{com}. label variable ts_130028_0_0 "Date A19 first reported (miliary tuberculosis)"
{txt}
{com}. gen double ts_130030_0_0 = date(s_130030_0_0,"DMY")
{txt}(502,381 missing values generated)

{com}. format ts_130030_0_0 %td
{txt}
{com}. capture drop s_130030_0_0
{txt}
{com}. label variable ts_130030_0_0 "Date A20 first reported (plague)"
{txt}
{com}. gen double ts_130034_0_0 = date(s_130034_0_0,"DMY")
{txt}(502,387 missing values generated)

{com}. format ts_130034_0_0 %td
{txt}
{com}. capture drop s_130034_0_0
{txt}
{com}. label variable ts_130034_0_0 "Date A22 first reported (anthrax)"
{txt}
{com}. gen double ts_130036_0_0 = date(s_130036_0_0,"DMY")
{txt}(502,356 missing values generated)

{com}. format ts_130036_0_0 %td
{txt}
{com}. capture drop s_130036_0_0
{txt}
{com}. label variable ts_130036_0_0 "Date A23 first reported (brucellosis)"
{txt}
{com}. gen double ts_130038_0_0 = date(s_130038_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130038_0_0 %td
{txt}
{com}. capture drop s_130038_0_0
{txt}
{com}. label variable ts_130038_0_0 "Date A24 first reported (glanders and melioidosis)"
{txt}
{com}. gen double ts_130040_0_0 = date(s_130040_0_0,"DMY")
{txt}(502,386 missing values generated)

{com}. format ts_130040_0_0 %td
{txt}
{com}. capture drop s_130040_0_0
{txt}
{com}. label variable ts_130040_0_0 "Date A25 first reported (rat-bite fevers)"
{txt}
{com}. gen double ts_130042_0_0 = date(s_130042_0_0,"DMY")
{txt}(502,376 missing values generated)

{com}. format ts_130042_0_0 %td
{txt}
{com}. capture drop s_130042_0_0
{txt}
{com}. label variable ts_130042_0_0 "Date A26 first reported (erysipeloid)"
{txt}
{com}. gen double ts_130044_0_0 = date(s_130044_0_0,"DMY")
{txt}(502,354 missing values generated)

{com}. format ts_130044_0_0 %td
{txt}
{com}. capture drop s_130044_0_0
{txt}
{com}. label variable ts_130044_0_0 "Date A27 first reported (leptospirosis)"
{txt}
{com}. gen double ts_130046_0_0 = date(s_130046_0_0,"DMY")
{txt}(502,324 missing values generated)

{com}. format ts_130046_0_0 %td
{txt}
{com}. capture drop s_130046_0_0
{txt}
{com}. label variable ts_130046_0_0 "Date A28 first reported (other zoonotic bacterial diseases, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130048_0_0 = date(s_130048_0_0,"DMY")
{txt}(502,386 missing values generated)

{com}. format ts_130048_0_0 %td
{txt}
{com}. capture drop s_130048_0_0
{txt}
{com}. label variable ts_130048_0_0 "Date A30 first reported (leprosy [hansens disease])"
{txt}
{com}. gen double ts_130050_0_0 = date(s_130050_0_0,"DMY")
{txt}(502,229 missing values generated)

{com}. format ts_130050_0_0 %td
{txt}
{com}. capture drop s_130050_0_0
{txt}
{com}. label variable ts_130050_0_0 "Date A31 first reported (infection due to other mycobacteria)"
{txt}
{com}. gen double ts_130052_0_0 = date(s_130052_0_0,"DMY")
{txt}(502,362 missing values generated)

{com}. format ts_130052_0_0 %td
{txt}
{com}. capture drop s_130052_0_0
{txt}
{com}. label variable ts_130052_0_0 "Date A32 first reported (listeriosis)"
{txt}
{com}. gen double ts_130054_0_0 = date(s_130054_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130054_0_0 %td
{txt}
{com}. capture drop s_130054_0_0
{txt}
{com}. label variable ts_130054_0_0 "Date A33 first reported (tetanus neonatorum)"
{txt}
{com}. gen double ts_130058_0_0 = date(s_130058_0_0,"DMY")
{txt}(502,270 missing values generated)

{com}. format ts_130058_0_0 %td
{txt}
{com}. capture drop s_130058_0_0
{txt}
{com}. label variable ts_130058_0_0 "Date A35 first reported (other tetanus)"
{txt}
{com}. gen double ts_130060_0_0 = date(s_130060_0_0,"DMY")
{txt}(502,242 missing values generated)

{com}. format ts_130060_0_0 %td
{txt}
{com}. capture drop s_130060_0_0
{txt}
{com}. label variable ts_130060_0_0 "Date A36 first reported (diphtheria)"
{txt}
{com}. gen double ts_130062_0_0 = date(s_130062_0_0,"DMY")
{txt}(499,894 missing values generated)

{com}. format ts_130062_0_0 %td
{txt}
{com}. capture drop s_130062_0_0
{txt}
{com}. label variable ts_130062_0_0 "Date A37 first reported (whooping cough)"
{txt}
{com}. gen double ts_130064_0_0 = date(s_130064_0_0,"DMY")
{txt}(500,861 missing values generated)

{com}. format ts_130064_0_0 %td
{txt}
{com}. capture drop s_130064_0_0
{txt}
{com}. label variable ts_130064_0_0 "Date A38 first reported (scarlet fever)"
{txt}
{com}. gen double ts_130066_0_0 = date(s_130066_0_0,"DMY")
{txt}(502,272 missing values generated)

{com}. format ts_130066_0_0 %td
{txt}
{com}. capture drop s_130066_0_0
{txt}
{com}. label variable ts_130066_0_0 "Date A39 first reported (meningococcal infection)"
{txt}
{com}. gen double ts_130068_0_0 = date(s_130068_0_0,"DMY")
{txt}(501,574 missing values generated)

{com}. format ts_130068_0_0 %td
{txt}
{com}. capture drop s_130068_0_0
{txt}
{com}. label variable ts_130068_0_0 "Date A40 first reported (streptococcal septicaemia)"
{txt}
{com}. gen double ts_130070_0_0 = date(s_130070_0_0,"DMY")
{txt}(486,483 missing values generated)

{com}. format ts_130070_0_0 %td
{txt}
{com}. capture drop s_130070_0_0
{txt}
{com}. label variable ts_130070_0_0 "Date A41 first reported (other septicaemia)"
{txt}
{com}. gen double ts_130072_0_0 = date(s_130072_0_0,"DMY")
{txt}(502,170 missing values generated)

{com}. format ts_130072_0_0 %td
{txt}
{com}. capture drop s_130072_0_0
{txt}
{com}. label variable ts_130072_0_0 "Date A42 first reported (actinomycosis)"
{txt}
{com}. gen double ts_130074_0_0 = date(s_130074_0_0,"DMY")
{txt}(502,386 missing values generated)

{com}. format ts_130074_0_0 %td
{txt}
{com}. capture drop s_130074_0_0
{txt}
{com}. label variable ts_130074_0_0 "Date A43 first reported (nocardiosis)"
{txt}
{com}. gen double ts_130076_0_0 = date(s_130076_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130076_0_0 %td
{txt}
{com}. capture drop s_130076_0_0
{txt}
{com}. label variable ts_130076_0_0 "Date A44 first reported (bartonellosis)"
{txt}
{com}. gen double ts_130078_0_0 = date(s_130078_0_0,"DMY")
{txt}(502,061 missing values generated)

{com}. format ts_130078_0_0 %td
{txt}
{com}. capture drop s_130078_0_0
{txt}
{com}. label variable ts_130078_0_0 "Date A46 first reported (erysipelas)"
{txt}
{com}. gen double ts_130080_0_0 = date(s_130080_0_0,"DMY")
{txt}(502,185 missing values generated)

{com}. format ts_130080_0_0 %td
{txt}
{com}. capture drop s_130080_0_0
{txt}
{com}. label variable ts_130080_0_0 "Date A48 first reported (other bacterial diseases, not elsewhere classified)"
{txt}
{com}. gen double ts_130082_0_0 = date(s_130082_0_0,"DMY")
{txt}(499,504 missing values generated)

{com}. format ts_130082_0_0 %td
{txt}
{com}. capture drop s_130082_0_0
{txt}
{com}. label variable ts_130082_0_0 "Date A49 first reported (bacterial infection of unspecified site)"
{txt}
{com}. gen double ts_130084_0_0 = date(s_130084_0_0,"DMY")
{txt}(502,380 missing values generated)

{com}. format ts_130084_0_0 %td
{txt}
{com}. capture drop s_130084_0_0
{txt}
{com}. label variable ts_130084_0_0 "Date A50 first reported (congenital syphilis)"
{txt}
{com}. gen double ts_130086_0_0 = date(s_130086_0_0,"DMY")
{txt}(502,369 missing values generated)

{com}. format ts_130086_0_0 %td
{txt}
{com}. capture drop s_130086_0_0
{txt}
{com}. label variable ts_130086_0_0 "Date A51 first reported (early syphilis)"
{txt}
{com}. gen double ts_130088_0_0 = date(s_130088_0_0,"DMY")
{txt}(502,368 missing values generated)

{com}. format ts_130088_0_0 %td
{txt}
{com}. capture drop s_130088_0_0
{txt}
{com}. label variable ts_130088_0_0 "Date A52 first reported (late syphilis)"
{txt}
{com}. gen double ts_130090_0_0 = date(s_130090_0_0,"DMY")
{txt}(502,359 missing values generated)

{com}. format ts_130090_0_0 %td
{txt}
{com}. capture drop s_130090_0_0
{txt}
{com}. label variable ts_130090_0_0 "Date A53 first reported (other and unspecified syphilis)"
{txt}
{com}. gen double ts_130092_0_0 = date(s_130092_0_0,"DMY")
{txt}(502,107 missing values generated)

{com}. format ts_130092_0_0 %td
{txt}
{com}. capture drop s_130092_0_0
{txt}
{com}. label variable ts_130092_0_0 "Date A54 first reported (gonococcal infection)"
{txt}
{com}. gen double ts_130094_0_0 = date(s_130094_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130094_0_0 %td
{txt}
{com}. capture drop s_130094_0_0
{txt}
{com}. label variable ts_130094_0_0 "Date A55 first reported (chlamydial lymphogranuloma (venereum))"
{txt}
{com}. gen double ts_130096_0_0 = date(s_130096_0_0,"DMY")
{txt}(502,305 missing values generated)

{com}. format ts_130096_0_0 %td
{txt}
{com}. capture drop s_130096_0_0
{txt}
{com}. label variable ts_130096_0_0 "Date A56 first reported (other sexually transmitted chlamydial diseases)"
{txt}
{com}. gen double ts_130100_0_0 = date(s_130100_0_0,"DMY")
{txt}(502,387 missing values generated)

{com}. format ts_130100_0_0 %td
{txt}
{com}. capture drop s_130100_0_0
{txt}
{com}. label variable ts_130100_0_0 "Date A58 first reported (granuloma inguinale)"
{txt}
{com}. gen double ts_130102_0_0 = date(s_130102_0_0,"DMY")
{txt}(502,299 missing values generated)

{com}. format ts_130102_0_0 %td
{txt}
{com}. capture drop s_130102_0_0
{txt}
{com}. label variable ts_130102_0_0 "Date A59 first reported (trichomoniasis)"
{txt}
{com}. gen double ts_130104_0_0 = date(s_130104_0_0,"DMY")
{txt}(501,943 missing values generated)

{com}. format ts_130104_0_0 %td
{txt}
{com}. capture drop s_130104_0_0
{txt}
{com}. label variable ts_130104_0_0 "Date A60 first reported (anogenital herpesviral [herpes simplex] infections)"
{txt}
{com}. gen double ts_130106_0_0 = date(s_130106_0_0,"DMY")
{txt}(500,543 missing values generated)

{com}. format ts_130106_0_0 %td
{txt}
{com}. capture drop s_130106_0_0
{txt}
{com}. label variable ts_130106_0_0 "Date A63 first reported (other predominantly sexually transmitted diseases, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130108_0_0 = date(s_130108_0_0,"DMY")
{txt}(502,386 missing values generated)

{com}. format ts_130108_0_0 %td
{txt}
{com}. capture drop s_130108_0_0
{txt}
{com}. label variable ts_130108_0_0 "Date A64 first reported (unspecified sexually transmitted disease)"
{txt}
{com}. gen double ts_130112_0_0 = date(s_130112_0_0,"DMY")
{txt}(502,365 missing values generated)

{com}. format ts_130112_0_0 %td
{txt}
{com}. capture drop s_130112_0_0
{txt}
{com}. label variable ts_130112_0_0 "Date A66 first reported (yaws)"
{txt}
{com}. gen double ts_130114_0_0 = date(s_130114_0_0,"DMY")
{txt}(502,383 missing values generated)

{com}. format ts_130114_0_0 %td
{txt}
{com}. capture drop s_130114_0_0
{txt}
{com}. label variable ts_130114_0_0 "Date A67 first reported (pinta [carate])"
{txt}
{com}. gen double ts_130116_0_0 = date(s_130116_0_0,"DMY")
{txt}(502,387 missing values generated)

{com}. format ts_130116_0_0 %td
{txt}
{com}. capture drop s_130116_0_0
{txt}
{com}. label variable ts_130116_0_0 "Date A68 first reported (relapsing fevers)"
{txt}
{com}. gen double ts_130118_0_0 = date(s_130118_0_0,"DMY")
{txt}(502,069 missing values generated)

{com}. format ts_130118_0_0 %td
{txt}
{com}. capture drop s_130118_0_0
{txt}
{com}. label variable ts_130118_0_0 "Date A69 first reported (other spirochaetal infections)"
{txt}
{com}. gen double ts_130120_0_0 = date(s_130120_0_0,"DMY")
{txt}(502,357 missing values generated)

{com}. format ts_130120_0_0 %td
{txt}
{com}. capture drop s_130120_0_0
{txt}
{com}. label variable ts_130120_0_0 "Date A70 first reported (chlamydia psittaci infection)"
{txt}
{com}. gen double ts_130122_0_0 = date(s_130122_0_0,"DMY")
{txt}(502,354 missing values generated)

{com}. format ts_130122_0_0 %td
{txt}
{com}. capture drop s_130122_0_0
{txt}
{com}. label variable ts_130122_0_0 "Date A71 first reported (trachoma)"
{txt}
{com}. gen double ts_130124_0_0 = date(s_130124_0_0,"DMY")
{txt}(502,352 missing values generated)

{com}. format ts_130124_0_0 %td
{txt}
{com}. capture drop s_130124_0_0
{txt}
{com}. label variable ts_130124_0_0 "Date A74 first reported (other diseases caused by chlamydiae)"
{txt}
{com}. gen double ts_130126_0_0 = date(s_130126_0_0,"DMY")
{txt}(502,384 missing values generated)

{com}. format ts_130126_0_0 %td
{txt}
{com}. capture drop s_130126_0_0
{txt}
{com}. label variable ts_130126_0_0 "Date A75 first reported (typhus fever)"
{txt}
{com}. gen double ts_130128_0_0 = date(s_130128_0_0,"DMY")
{txt}(502,368 missing values generated)

{com}. format ts_130128_0_0 %td
{txt}
{com}. capture drop s_130128_0_0
{txt}
{com}. label variable ts_130128_0_0 "Date A77 first reported (spotted fever [tick-borne rickettsioses])"
{txt}
{com}. gen double ts_130130_0_0 = date(s_130130_0_0,"DMY")
{txt}(502,379 missing values generated)

{com}. format ts_130130_0_0 %td
{txt}
{com}. capture drop s_130130_0_0
{txt}
{com}. label variable ts_130130_0_0 "Date A78 first reported (q fever)"
{txt}
{com}. gen double ts_130132_0_0 = date(s_130132_0_0,"DMY")
{txt}(502,387 missing values generated)

{com}. format ts_130132_0_0 %td
{txt}
{com}. capture drop s_130132_0_0
{txt}
{com}. label variable ts_130132_0_0 "Date A79 first reported (other rickettsioses)"
{txt}
{com}. gen double ts_130134_0_0 = date(s_130134_0_0,"DMY")
{txt}(501,868 missing values generated)

{com}. format ts_130134_0_0 %td
{txt}
{com}. capture drop s_130134_0_0
{txt}
{com}. label variable ts_130134_0_0 "Date A80 first reported (acute poliomyelitis)"
{txt}
{com}. gen double ts_130136_0_0 = date(s_130136_0_0,"DMY")
{txt}(502,322 missing values generated)

{com}. format ts_130136_0_0 %td
{txt}
{com}. capture drop s_130136_0_0
{txt}
{com}. label variable ts_130136_0_0 "Date A81 first reported (atypical virus infections of central nervous system)"
{txt}
{com}. gen double ts_130138_0_0 = date(s_130138_0_0,"DMY")
{txt}(502,371 missing values generated)

{com}. format ts_130138_0_0 %td
{txt}
{com}. capture drop s_130138_0_0
{txt}
{com}. label variable ts_130138_0_0 "Date A82 first reported (rabies)"
{txt}
{com}. gen double ts_130140_0_0 = date(s_130140_0_0,"DMY")
{txt}(502,356 missing values generated)

{com}. format ts_130140_0_0 %td
{txt}
{com}. capture drop s_130140_0_0
{txt}
{com}. label variable ts_130140_0_0 "Date A83 first reported (mosquito-borne viral encephalitis)"
{txt}
{com}. gen double ts_130142_0_0 = date(s_130142_0_0,"DMY")
{txt}(502,381 missing values generated)

{com}. format ts_130142_0_0 %td
{txt}
{com}. capture drop s_130142_0_0
{txt}
{com}. label variable ts_130142_0_0 "Date A84 first reported (tick-borne viral encephalitis)"
{txt}
{com}. gen double ts_130144_0_0 = date(s_130144_0_0,"DMY")
{txt}(502,374 missing values generated)

{com}. format ts_130144_0_0 %td
{txt}
{com}. capture drop s_130144_0_0
{txt}
{com}. label variable ts_130144_0_0 "Date A85 first reported (other viral encephalitis, not elsewhere classified)"
{txt}
{com}. gen double ts_130146_0_0 = date(s_130146_0_0,"DMY")
{txt}(502,253 missing values generated)

{com}. format ts_130146_0_0 %td
{txt}
{com}. capture drop s_130146_0_0
{txt}
{com}. label variable ts_130146_0_0 "Date A86 first reported (unspecified viral encephalitis)"
{txt}
{com}. gen double ts_130148_0_0 = date(s_130148_0_0,"DMY")
{txt}(501,878 missing values generated)

{com}. format ts_130148_0_0 %td
{txt}
{com}. capture drop s_130148_0_0
{txt}
{com}. label variable ts_130148_0_0 "Date A87 first reported (viral meningitis)"
{txt}
{com}. gen double ts_130150_0_0 = date(s_130150_0_0,"DMY")
{txt}(502,362 missing values generated)

{com}. format ts_130150_0_0 %td
{txt}
{com}. capture drop s_130150_0_0
{txt}
{com}. label variable ts_130150_0_0 "Date A88 first reported (other viral infections of central nervous system, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130152_0_0 = date(s_130152_0_0,"DMY")
{txt}(502,351 missing values generated)

{com}. format ts_130152_0_0 %td
{txt}
{com}. capture drop s_130152_0_0
{txt}
{com}. label variable ts_130152_0_0 "Date A89 first reported (unspecified viral infection of central nervous system)"
{txt}
{com}. gen double ts_130154_0_0 = date(s_130154_0_0,"DMY")
{txt}(502,334 missing values generated)

{com}. format ts_130154_0_0 %td
{txt}
{com}. capture drop s_130154_0_0
{txt}
{com}. label variable ts_130154_0_0 "Date A90 first reported (dengue fever [classical dengue])"
{txt}
{com}. gen double ts_130156_0_0 = date(s_130156_0_0,"DMY")
{txt}(502,387 missing values generated)

{com}. format ts_130156_0_0 %td
{txt}
{com}. capture drop s_130156_0_0
{txt}
{com}. label variable ts_130156_0_0 "Date A91 first reported (dengue haemorrhagic fever)"
{txt}
{com}. gen double ts_130158_0_0 = date(s_130158_0_0,"DMY")
{txt}(502,375 missing values generated)

{com}. format ts_130158_0_0 %td
{txt}
{com}. capture drop s_130158_0_0
{txt}
{com}. label variable ts_130158_0_0 "Date A92 first reported (other mosquito-borne viral fevers)"
{txt}
{com}. gen double ts_130160_0_0 = date(s_130160_0_0,"DMY")
{txt}(502,380 missing values generated)

{com}. format ts_130160_0_0 %td
{txt}
{com}. capture drop s_130160_0_0
{txt}
{com}. label variable ts_130160_0_0 "Date A93 first reported (other arthropod-borne viral fevers, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130162_0_0 = date(s_130162_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130162_0_0 %td
{txt}
{com}. capture drop s_130162_0_0
{txt}
{com}. label variable ts_130162_0_0 "Date A94 first reported (unspecified arthropod-borne viral fever)"
{txt}
{com}. gen double ts_130164_0_0 = date(s_130164_0_0,"DMY")
{txt}(502,315 missing values generated)

{com}. format ts_130164_0_0 %td
{txt}
{com}. capture drop s_130164_0_0
{txt}
{com}. label variable ts_130164_0_0 "Date A95 first reported (yellow fever)"
{txt}
{com}. gen double ts_130168_0_0 = date(s_130168_0_0,"DMY")
{txt}(502,354 missing values generated)

{com}. format ts_130168_0_0 %td
{txt}
{com}. capture drop s_130168_0_0
{txt}
{com}. label variable ts_130168_0_0 "Date A97 first reported (dengue)"
{txt}
{com}. gen double ts_130170_0_0 = date(s_130170_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130170_0_0 %td
{txt}
{com}. capture drop s_130170_0_0
{txt}
{com}. label variable ts_130170_0_0 "Date A98 first reported (other viral haemorrhagic fevers, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130174_0_0 = date(s_130174_0_0,"DMY")
{txt}(497,469 missing values generated)

{com}. format ts_130174_0_0 %td
{txt}
{com}. capture drop s_130174_0_0
{txt}
{com}. label variable ts_130174_0_0 "Date B00 first reported (herpesviral [herpes simplex] infections)"
{txt}
{com}. gen double ts_130176_0_0 = date(s_130176_0_0,"DMY")
{txt}(487,101 missing values generated)

{com}. format ts_130176_0_0 %td
{txt}
{com}. capture drop s_130176_0_0
{txt}
{com}. label variable ts_130176_0_0 "Date B01 first reported (varicella [chickenpox])"
{txt}
{com}. gen double ts_130178_0_0 = date(s_130178_0_0,"DMY")
{txt}(484,452 missing values generated)

{com}. format ts_130178_0_0 %td
{txt}
{com}. capture drop s_130178_0_0
{txt}
{com}. label variable ts_130178_0_0 "Date B02 first reported (zoster [herpes zoster])"
{txt}
{com}. gen double ts_130180_0_0 = date(s_130180_0_0,"DMY")
{txt}(502,375 missing values generated)

{com}. format ts_130180_0_0 %td
{txt}
{com}. capture drop s_130180_0_0
{txt}
{com}. label variable ts_130180_0_0 "Date B03 first reported (smallpox)"
{txt}
{com}. gen double ts_130184_0_0 = date(s_130184_0_0,"DMY")
{txt}(491,535 missing values generated)

{com}. format ts_130184_0_0 %td
{txt}
{com}. capture drop s_130184_0_0
{txt}
{com}. label variable ts_130184_0_0 "Date B05 first reported (measles)"
{txt}
{com}. gen double ts_130186_0_0 = date(s_130186_0_0,"DMY")
{txt}(498,253 missing values generated)

{com}. format ts_130186_0_0 %td
{txt}
{com}. capture drop s_130186_0_0
{txt}
{com}. label variable ts_130186_0_0 "Date B06 first reported (rubella [german measles])"
{txt}
{com}. gen double ts_130188_0_0 = date(s_130188_0_0,"DMY")
{txt}(484,566 missing values generated)

{com}. format ts_130188_0_0 %td
{txt}
{com}. capture drop s_130188_0_0
{txt}
{com}. label variable ts_130188_0_0 "Date B07 first reported (viral warts)"
{txt}
{com}. gen double ts_130190_0_0 = date(s_130190_0_0,"DMY")
{txt}(501,341 missing values generated)

{com}. format ts_130190_0_0 %td
{txt}
{com}. capture drop s_130190_0_0
{txt}
{com}. label variable ts_130190_0_0 "Date B08 first reported (other viral infections characterised by skin and mucous membrane lesions, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130192_0_0 = date(s_130192_0_0,"DMY")
{txt}(502,359 missing values generated)

{com}. format ts_130192_0_0 %td
{txt}
{com}. capture drop s_130192_0_0
{txt}
{com}. label variable ts_130192_0_0 "Date B09 first reported (unspecified viral infection characterised by skin and mucous membrane lesions)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130194_0_0 = date(s_130194_0_0,"DMY")
{txt}(501,268 missing values generated)

{com}. format ts_130194_0_0 %td
{txt}
{com}. capture drop s_130194_0_0
{txt}
{com}. label variable ts_130194_0_0 "Date B15 first reported (acute hepatitis a)"
{txt}
{com}. gen double ts_130196_0_0 = date(s_130196_0_0,"DMY")
{txt}(501,973 missing values generated)

{com}. format ts_130196_0_0 %td
{txt}
{com}. capture drop s_130196_0_0
{txt}
{com}. label variable ts_130196_0_0 "Date B16 first reported (acute hepatitis b)"
{txt}
{com}. gen double ts_130198_0_0 = date(s_130198_0_0,"DMY")
{txt}(501,932 missing values generated)

{com}. format ts_130198_0_0 %td
{txt}
{com}. capture drop s_130198_0_0
{txt}
{com}. label variable ts_130198_0_0 "Date B17 first reported (other acute viral hepatitis)"
{txt}
{com}. gen double ts_130200_0_0 = date(s_130200_0_0,"DMY")
{txt}(501,511 missing values generated)

{com}. format ts_130200_0_0 %td
{txt}
{com}. capture drop s_130200_0_0
{txt}
{com}. label variable ts_130200_0_0 "Date B18 first reported (chronic viral hepatitis)"
{txt}
{com}. gen double ts_130202_0_0 = date(s_130202_0_0,"DMY")
{txt}(501,041 missing values generated)

{com}. format ts_130202_0_0 %td
{txt}
{com}. capture drop s_130202_0_0
{txt}
{com}. label variable ts_130202_0_0 "Date B19 first reported (unspecified viral hepatitis)"
{txt}
{com}. gen double ts_130204_0_0 = date(s_130204_0_0,"DMY")
{txt}(502,319 missing values generated)

{com}. format ts_130204_0_0 %td
{txt}
{com}. capture drop s_130204_0_0
{txt}
{com}. label variable ts_130204_0_0 "Date B20 first reported (human immunodeficiency virus [hiv] disease resulting in infectious and parasitic diseases)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130206_0_0 = date(s_130206_0_0,"DMY")
{txt}(502,373 missing values generated)

{com}. format ts_130206_0_0 %td
{txt}
{com}. capture drop s_130206_0_0
{txt}
{com}. label variable ts_130206_0_0 "Date B21 first reported (human immunodeficiency virus [hiv] disease resulting in malignant neoplasms)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130208_0_0 = date(s_130208_0_0,"DMY")
{txt}(502,377 missing values generated)

{com}. format ts_130208_0_0 %td
{txt}
{com}. capture drop s_130208_0_0
{txt}
{com}. label variable ts_130208_0_0 "Date B22 first reported (human immunodeficiency virus [hiv] disease resulting in other specified diseases)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130210_0_0 = date(s_130210_0_0,"DMY")
{txt}(502,349 missing values generated)

{com}. format ts_130210_0_0 %td
{txt}
{com}. capture drop s_130210_0_0
{txt}
{com}. label variable ts_130210_0_0 "Date B23 first reported (human immunodeficiency virus [hiv] disease resulting in other conditions)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130212_0_0 = date(s_130212_0_0,"DMY")
{txt}(501,871 missing values generated)

{com}. format ts_130212_0_0 %td
{txt}
{com}. capture drop s_130212_0_0
{txt}
{com}. label variable ts_130212_0_0 "Date B24 first reported (unspecified human immunodeficiency virus [hiv] disease)"
{txt}
{com}. gen double ts_130214_0_0 = date(s_130214_0_0,"DMY")
{txt}(502,089 missing values generated)

{com}. format ts_130214_0_0 %td
{txt}
{com}. capture drop s_130214_0_0
{txt}
{com}. label variable ts_130214_0_0 "Date B25 first reported (cytomegaloviral disease)"
{txt}
{com}. gen double ts_130216_0_0 = date(s_130216_0_0,"DMY")
{txt}(495,346 missing values generated)

{com}. format ts_130216_0_0 %td
{txt}
{com}. capture drop s_130216_0_0
{txt}
{com}. label variable ts_130216_0_0 "Date B26 first reported (mumps)"
{txt}
{com}. gen double ts_130218_0_0 = date(s_130218_0_0,"DMY")
{txt}(498,927 missing values generated)

{com}. format ts_130218_0_0 %td
{txt}
{com}. capture drop s_130218_0_0
{txt}
{com}. label variable ts_130218_0_0 "Date B27 first reported (infectious mononucleosis)"
{txt}
{com}. gen double ts_130220_0_0 = date(s_130220_0_0,"DMY")
{txt}(502,181 missing values generated)

{com}. format ts_130220_0_0 %td
{txt}
{com}. capture drop s_130220_0_0
{txt}
{com}. label variable ts_130220_0_0 "Date B30 first reported (viral conjunctivitis)"
{txt}
{com}. gen double ts_130222_0_0 = date(s_130222_0_0,"DMY")
{txt}(502,149 missing values generated)

{com}. format ts_130222_0_0 %td
{txt}
{com}. capture drop s_130222_0_0
{txt}
{com}. label variable ts_130222_0_0 "Date B33 first reported (other viral diseases, not elsewhere classified)"
{txt}
{com}. gen double ts_130224_0_0 = date(s_130224_0_0,"DMY")
{txt}(490,238 missing values generated)

{com}. format ts_130224_0_0 %td
{txt}
{com}. capture drop s_130224_0_0
{txt}
{com}. label variable ts_130224_0_0 "Date B34 first reported (viral infection of unspecified site)"
{txt}
{com}. gen double ts_130226_0_0 = date(s_130226_0_0,"DMY")
{txt}(469,319 missing values generated)

{com}. format ts_130226_0_0 %td
{txt}
{com}. capture drop s_130226_0_0
{txt}
{com}. label variable ts_130226_0_0 "Date B35 first reported (dermatophytosis)"
{txt}
{com}. gen double ts_130228_0_0 = date(s_130228_0_0,"DMY")
{txt}(496,518 missing values generated)

{com}. format ts_130228_0_0 %td
{txt}
{com}. capture drop s_130228_0_0
{txt}
{com}. label variable ts_130228_0_0 "Date B36 first reported (other superficial mycoses)"
{txt}
{com}. gen double ts_130230_0_0 = date(s_130230_0_0,"DMY")
{txt}(489,761 missing values generated)

{com}. format ts_130230_0_0 %td
{txt}
{com}. capture drop s_130230_0_0
{txt}
{com}. label variable ts_130230_0_0 "Date B37 first reported (candidiasis)"
{txt}
{com}. gen double ts_130232_0_0 = date(s_130232_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130232_0_0 %td
{txt}
{com}. capture drop s_130232_0_0
{txt}
{com}. label variable ts_130232_0_0 "Date B38 first reported (coccidioidomycosis)"
{txt}
{com}. gen double ts_130234_0_0 = date(s_130234_0_0,"DMY")
{txt}(502,380 missing values generated)

{com}. format ts_130234_0_0 %td
{txt}
{com}. capture drop s_130234_0_0
{txt}
{com}. label variable ts_130234_0_0 "Date B39 first reported (histoplasmosis)"
{txt}
{com}. gen double ts_130236_0_0 = date(s_130236_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130236_0_0 %td
{txt}
{com}. capture drop s_130236_0_0
{txt}
{com}. label variable ts_130236_0_0 "Date B40 first reported (blastomycosis)"
{txt}
{com}. gen double ts_130240_0_0 = date(s_130240_0_0,"DMY")
{txt}(502,387 missing values generated)

{com}. format ts_130240_0_0 %td
{txt}
{com}. capture drop s_130240_0_0
{txt}
{com}. label variable ts_130240_0_0 "Date B42 first reported (sporotrichosis)"
{txt}
{com}. gen double ts_130242_0_0 = date(s_130242_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130242_0_0 %td
{txt}
{com}. capture drop s_130242_0_0
{txt}
{com}. label variable ts_130242_0_0 "Date B43 first reported (chromomycosis and phaeomycotic abscess)"
{txt}
{com}. gen double ts_130244_0_0 = date(s_130244_0_0,"DMY")
{txt}(501,927 missing values generated)

{com}. format ts_130244_0_0 %td
{txt}
{com}. capture drop s_130244_0_0
{txt}
{com}. label variable ts_130244_0_0 "Date B44 first reported (aspergillosis)"
{txt}
{com}. gen double ts_130246_0_0 = date(s_130246_0_0,"DMY")
{txt}(502,381 missing values generated)

{com}. format ts_130246_0_0 %td
{txt}
{com}. capture drop s_130246_0_0
{txt}
{com}. label variable ts_130246_0_0 "Date B45 first reported (cryptococcosis)"
{txt}
{com}. gen double ts_130248_0_0 = date(s_130248_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130248_0_0 %td
{txt}
{com}. capture drop s_130248_0_0
{txt}
{com}. label variable ts_130248_0_0 "Date B46 first reported (zygomycosis)"
{txt}
{com}. gen double ts_130250_0_0 = date(s_130250_0_0,"DMY")
{txt}(502,364 missing values generated)

{com}. format ts_130250_0_0 %td
{txt}
{com}. capture drop s_130250_0_0
{txt}
{com}. label variable ts_130250_0_0 "Date B47 first reported (mycetoma)"
{txt}
{com}. gen double ts_130252_0_0 = date(s_130252_0_0,"DMY")
{txt}(502,359 missing values generated)

{com}. format ts_130252_0_0 %td
{txt}
{com}. capture drop s_130252_0_0
{txt}
{com}. label variable ts_130252_0_0 "Date B48 first reported (other mycoses, not elsewhere classified)"
{txt}
{com}. gen double ts_130254_0_0 = date(s_130254_0_0,"DMY")
{txt}(501,856 missing values generated)

{com}. format ts_130254_0_0 %td
{txt}
{com}. capture drop s_130254_0_0
{txt}
{com}. label variable ts_130254_0_0 "Date B49 first reported (unspecified mycosis)"
{txt}
{com}. gen double ts_130256_0_0 = date(s_130256_0_0,"DMY")
{txt}(502,195 missing values generated)

{com}. format ts_130256_0_0 %td
{txt}
{com}. capture drop s_130256_0_0
{txt}
{com}. label variable ts_130256_0_0 "Date B50 first reported (plasmodium falciparum malaria)"
{txt}
{com}. gen double ts_130258_0_0 = date(s_130258_0_0,"DMY")
{txt}(502,346 missing values generated)

{com}. format ts_130258_0_0 %td
{txt}
{com}. capture drop s_130258_0_0
{txt}
{com}. label variable ts_130258_0_0 "Date B51 first reported (plasmodium vivax malaria)"
{txt}
{com}. gen double ts_130260_0_0 = date(s_130260_0_0,"DMY")
{txt}(502,384 missing values generated)

{com}. format ts_130260_0_0 %td
{txt}
{com}. capture drop s_130260_0_0
{txt}
{com}. label variable ts_130260_0_0 "Date B52 first reported (plasmodium malariae malaria)"
{txt}
{com}. gen double ts_130262_0_0 = date(s_130262_0_0,"DMY")
{txt}(502,384 missing values generated)

{com}. format ts_130262_0_0 %td
{txt}
{com}. capture drop s_130262_0_0
{txt}
{com}. label variable ts_130262_0_0 "Date B53 first reported (other parasitologically confirmed malaria)"
{txt}
{com}. gen double ts_130264_0_0 = date(s_130264_0_0,"DMY")
{txt}(501,491 missing values generated)

{com}. format ts_130264_0_0 %td
{txt}
{com}. capture drop s_130264_0_0
{txt}
{com}. label variable ts_130264_0_0 "Date B54 first reported (unspecified malaria)"
{txt}
{com}. gen double ts_130266_0_0 = date(s_130266_0_0,"DMY")
{txt}(502,372 missing values generated)

{com}. format ts_130266_0_0 %td
{txt}
{com}. capture drop s_130266_0_0
{txt}
{com}. label variable ts_130266_0_0 "Date B55 first reported (leishmaniasis)"
{txt}
{com}. gen double ts_130270_0_0 = date(s_130270_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130270_0_0 %td
{txt}
{com}. capture drop s_130270_0_0
{txt}
{com}. label variable ts_130270_0_0 "Date B57 first reported (chagas disease)"
{txt}
{com}. gen double ts_130272_0_0 = date(s_130272_0_0,"DMY")
{txt}(502,326 missing values generated)

{com}. format ts_130272_0_0 %td
{txt}
{com}. capture drop s_130272_0_0
{txt}
{com}. label variable ts_130272_0_0 "Date B58 first reported (toxoplasmosis)"
{txt}
{com}. gen double ts_130274_0_0 = date(s_130274_0_0,"DMY")
{txt}(502,208 missing values generated)

{com}. format ts_130274_0_0 %td
{txt}
{com}. capture drop s_130274_0_0
{txt}
{com}. label variable ts_130274_0_0 "Date B59 first reported (pneumocystosis)"
{txt}
{com}. gen double ts_130276_0_0 = date(s_130276_0_0,"DMY")
{txt}(502,375 missing values generated)

{com}. format ts_130276_0_0 %td
{txt}
{com}. capture drop s_130276_0_0
{txt}
{com}. label variable ts_130276_0_0 "Date B60 first reported (other protozoal diseases, not elsewhere classified)"
{txt}
{com}. gen double ts_130280_0_0 = date(s_130280_0_0,"DMY")
{txt}(502,278 missing values generated)

{com}. format ts_130280_0_0 %td
{txt}
{com}. capture drop s_130280_0_0
{txt}
{com}. label variable ts_130280_0_0 "Date B65 first reported (schistosomiasis [bilharziasis])"
{txt}
{com}. gen double ts_130282_0_0 = date(s_130282_0_0,"DMY")
{txt}(502,382 missing values generated)

{com}. format ts_130282_0_0 %td
{txt}
{com}. capture drop s_130282_0_0
{txt}
{com}. label variable ts_130282_0_0 "Date B66 first reported (other fluke infections)"
{txt}
{com}. gen double ts_130284_0_0 = date(s_130284_0_0,"DMY")
{txt}(502,377 missing values generated)

{com}. format ts_130284_0_0 %td
{txt}
{com}. capture drop s_130284_0_0
{txt}
{com}. label variable ts_130284_0_0 "Date B67 first reported (echinococcosis)"
{txt}
{com}. gen double ts_130286_0_0 = date(s_130286_0_0,"DMY")
{txt}(502,377 missing values generated)

{com}. format ts_130286_0_0 %td
{txt}
{com}. capture drop s_130286_0_0
{txt}
{com}. label variable ts_130286_0_0 "Date B68 first reported (taeniasis)"
{txt}
{com}. gen double ts_130288_0_0 = date(s_130288_0_0,"DMY")
{txt}(502,383 missing values generated)

{com}. format ts_130288_0_0 %td
{txt}
{com}. capture drop s_130288_0_0
{txt}
{com}. label variable ts_130288_0_0 "Date B69 first reported (cysticercosis)"
{txt}
{com}. gen double ts_130292_0_0 = date(s_130292_0_0,"DMY")
{txt}(502,375 missing values generated)

{com}. format ts_130292_0_0 %td
{txt}
{com}. capture drop s_130292_0_0
{txt}
{com}. label variable ts_130292_0_0 "Date B71 first reported (other cestode infections)"
{txt}
{com}. gen double ts_130296_0_0 = date(s_130296_0_0,"DMY")
{txt}(502,372 missing values generated)

{com}. format ts_130296_0_0 %td
{txt}
{com}. capture drop s_130296_0_0
{txt}
{com}. label variable ts_130296_0_0 "Date B73 first reported (onchocerciasis)"
{txt}
{com}. gen double ts_130298_0_0 = date(s_130298_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130298_0_0 %td
{txt}
{com}. capture drop s_130298_0_0
{txt}
{com}. label variable ts_130298_0_0 "Date B74 first reported (filariasis)"
{txt}
{com}. gen double ts_130300_0_0 = date(s_130300_0_0,"DMY")
{txt}(502,388 missing values generated)

{com}. format ts_130300_0_0 %td
{txt}
{com}. capture drop s_130300_0_0
{txt}
{com}. label variable ts_130300_0_0 "Date B75 first reported (trichinellosis)"
{txt}
{com}. gen double ts_130302_0_0 = date(s_130302_0_0,"DMY")
{txt}(502,356 missing values generated)

{com}. format ts_130302_0_0 %td
{txt}
{com}. capture drop s_130302_0_0
{txt}
{com}. label variable ts_130302_0_0 "Date B76 first reported (hookworm diseases)"
{txt}
{com}. gen double ts_130304_0_0 = date(s_130304_0_0,"DMY")
{txt}(502,377 missing values generated)

{com}. format ts_130304_0_0 %td
{txt}
{com}. capture drop s_130304_0_0
{txt}
{com}. label variable ts_130304_0_0 "Date B77 first reported (ascariasis)"
{txt}
{com}. gen double ts_130306_0_0 = date(s_130306_0_0,"DMY")
{txt}(502,381 missing values generated)

{com}. format ts_130306_0_0 %td
{txt}
{com}. capture drop s_130306_0_0
{txt}
{com}. label variable ts_130306_0_0 "Date B78 first reported (strongyloidiasis)"
{txt}
{com}. gen double ts_130308_0_0 = date(s_130308_0_0,"DMY")
{txt}(502,384 missing values generated)

{com}. format ts_130308_0_0 %td
{txt}
{com}. capture drop s_130308_0_0
{txt}
{com}. label variable ts_130308_0_0 "Date B79 first reported (trichuriasis)"
{txt}
{com}. gen double ts_130310_0_0 = date(s_130310_0_0,"DMY")
{txt}(501,615 missing values generated)

{com}. format ts_130310_0_0 %td
{txt}
{com}. capture drop s_130310_0_0
{txt}
{com}. label variable ts_130310_0_0 "Date B80 first reported (enterobiasis)"
{txt}
{com}. gen double ts_130312_0_0 = date(s_130312_0_0,"DMY")
{txt}(502,372 missing values generated)

{com}. format ts_130312_0_0 %td
{txt}
{com}. capture drop s_130312_0_0
{txt}
{com}. label variable ts_130312_0_0 "Date B81 first reported (other intestinal helminthiases, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130314_0_0 = date(s_130314_0_0,"DMY")
{txt}(502,293 missing values generated)

{com}. format ts_130314_0_0 %td
{txt}
{com}. capture drop s_130314_0_0
{txt}
{com}. label variable ts_130314_0_0 "Date B82 first reported (unspecified intestinal parasitism)"
{txt}
{com}. gen double ts_130316_0_0 = date(s_130316_0_0,"DMY")
{txt}(502,304 missing values generated)

{com}. format ts_130316_0_0 %td
{txt}
{com}. capture drop s_130316_0_0
{txt}
{com}. label variable ts_130316_0_0 "Date B83 first reported (other helminthiases)"
{txt}
{com}. gen double ts_130318_0_0 = date(s_130318_0_0,"DMY")
{txt}(502,050 missing values generated)

{com}. format ts_130318_0_0 %td
{txt}
{com}. capture drop s_130318_0_0
{txt}
{com}. label variable ts_130318_0_0 "Date B85 first reported (pediculosis and phthiriasis)"
{txt}
{com}. gen double ts_130320_0_0 = date(s_130320_0_0,"DMY")
{txt}(499,931 missing values generated)

{com}. format ts_130320_0_0 %td
{txt}
{com}. capture drop s_130320_0_0
{txt}
{com}. label variable ts_130320_0_0 "Date B86 first reported (scabies)"
{txt}
{com}. gen double ts_130322_0_0 = date(s_130322_0_0,"DMY")
{txt}(502,380 missing values generated)

{com}. format ts_130322_0_0 %td
{txt}
{com}. capture drop s_130322_0_0
{txt}
{com}. label variable ts_130322_0_0 "Date B87 first reported (myiasis)"
{txt}
{com}. gen double ts_130324_0_0 = date(s_130324_0_0,"DMY")
{txt}(502,202 missing values generated)

{com}. format ts_130324_0_0 %td
{txt}
{com}. capture drop s_130324_0_0
{txt}
{com}. label variable ts_130324_0_0 "Date B88 first reported (other infestations)"
{txt}
{com}. gen double ts_130326_0_0 = date(s_130326_0_0,"DMY")
{txt}(502,385 missing values generated)

{com}. format ts_130326_0_0 %td
{txt}
{com}. capture drop s_130326_0_0
{txt}
{com}. label variable ts_130326_0_0 "Date B89 first reported (unspecified parasitic disease)"
{txt}
{com}. gen double ts_130328_0_0 = date(s_130328_0_0,"DMY")
{txt}(502,332 missing values generated)

{com}. format ts_130328_0_0 %td
{txt}
{com}. capture drop s_130328_0_0
{txt}
{com}. label variable ts_130328_0_0 "Date B90 first reported (sequelae of tuberculosis)"
{txt}
{com}. gen double ts_130330_0_0 = date(s_130330_0_0,"DMY")
{txt}(502,146 missing values generated)

{com}. format ts_130330_0_0 %td
{txt}
{com}. capture drop s_130330_0_0
{txt}
{com}. label variable ts_130330_0_0 "Date B91 first reported (sequelae of poliomyelitis)"
{txt}
{com}. gen double ts_130334_0_0 = date(s_130334_0_0,"DMY")
{txt}(502,221 missing values generated)

{com}. format ts_130334_0_0 %td
{txt}
{com}. capture drop s_130334_0_0
{txt}
{com}. label variable ts_130334_0_0 "Date B94 first reported (sequelae of other and unspecified infectious and parasitic diseases)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130336_0_0 = date(s_130336_0_0,"DMY")
{txt}(493,405 missing values generated)

{com}. format ts_130336_0_0 %td
{txt}
{com}. capture drop s_130336_0_0
{txt}
{com}. label variable ts_130336_0_0 "Date B95 first reported (streptococcus and staphylococcus as the cause of diseases classified to other chapters)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130338_0_0 = date(s_130338_0_0,"DMY")
{txt}(483,663 missing values generated)

{com}. format ts_130338_0_0 %td
{txt}
{com}. capture drop s_130338_0_0
{txt}
{com}. label variable ts_130338_0_0 "Date B96 first reported (other bacterial agents as the cause of diseases classified to other chapters)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130340_0_0 = date(s_130340_0_0,"DMY")
{txt}(498,615 missing values generated)

{com}. format ts_130340_0_0 %td
{txt}
{com}. capture drop s_130340_0_0
{txt}
{com}. label variable ts_130340_0_0 "Date B97 first reported (viral agents as the cause of diseases classified to other chapters)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130342_0_0 = date(s_130342_0_0,"DMY")
{txt}(497,654 missing values generated)

{com}. format ts_130342_0_0 %td
{txt}
{com}. capture drop s_130342_0_0
{txt}
{com}. label variable ts_130342_0_0 "Date B98 first reported (other specified infectious agents as the cause of diseases classified to other chapters)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130344_0_0 = date(s_130344_0_0,"DMY")
{txt}(501,259 missing values generated)

{com}. format ts_130344_0_0 %td
{txt}
{com}. capture drop s_130344_0_0
{txt}
{com}. label variable ts_130344_0_0 "Date B99 first reported (other and unspecified infectious diseases)"
{txt}
{com}. 
. ***992 to 1002**
. gen double ts_130992_0_0 = date(s_130992_0_0,"DMY")
{txt}(502,154 missing values generated)

{com}. format ts_130992_0_0 %td
{txt}
{com}. capture drop s_130992_0_0
{txt}
{com}. label variable ts_130992_0_0 "Date G00 first reported (bacterial meningitis, not elsewhere classified)"
{txt}
{com}. gen double ts_130994_0_0 = date(s_130994_0_0,"DMY")
{txt}(502,326 missing values generated)

{com}. format ts_130994_0_0 %td
{txt}
{com}. capture drop s_130994_0_0
{txt}
{com}. label variable ts_130994_0_0 "Date G01 first reported (meningitis in bacterial diseases classified elsewhere)"
{txt}
{com}. gen double ts_130996_0_0 = date(s_130996_0_0,"DMY")
{txt}(502,290 missing values generated)

{com}. format ts_130996_0_0 %td
{txt}
{com}. capture drop s_130996_0_0
{txt}
{com}. label variable ts_130996_0_0 "Date G02 first reported (meningitis in other infectious and parasitic diseases classified elsewhere)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_130998_0_0 = date(s_130998_0_0,"DMY")
{txt}(499,978 missing values generated)

{com}. format ts_130998_0_0 %td
{txt}
{com}. capture drop s_130998_0_0
{txt}
{com}. label variable ts_130998_0_0 "Date G03 first reported (meningitis due to other and unspecified causes)"
{txt}
{com}. gen double ts_131000_0_0 = date(s_131000_0_0,"DMY")
{txt}(501,526 missing values generated)

{com}. format ts_131000_0_0 %td
{txt}
{com}. capture drop s_131000_0_0
{txt}
{com}. label variable ts_131000_0_0 "Date G04 first reported (encephalitis, myelitis and encephalomyelitis)"
{txt}
{com}. gen double ts_131002_0_0 = date(s_131002_0_0,"DMY")
{txt}(502,214 missing values generated)

{com}. format ts_131002_0_0 %td
{txt}
{com}. capture drop s_131002_0_0
{txt}
{com}. label variable ts_131002_0_0 "Date G05 first reported (encephalitis, myelitis and encephalomyelitis in diseases classified elsewhere)"
{txt}note: label truncated to 80 characters

{com}. 
. **1424 to 1462***
. gen double ts_131424_0_0 = date(s_131424_0_0,"DMY")
{txt}(496,830 missing values generated)

{com}. format ts_131424_0_0 %td
{txt}
{com}. capture drop s_131424_0_0
{txt}
{com}. label variable ts_131424_0_0 "Date J00 first reported (acute nasopharyngitis [common cold])"
{txt}
{com}. gen double ts_131426_0_0 = date(s_131426_0_0,"DMY")
{txt}(477,769 missing values generated)

{com}. format ts_131426_0_0 %td
{txt}
{com}. capture drop s_131426_0_0
{txt}
{com}. label variable ts_131426_0_0 "Date J01 first reported (acute sinusitis)"
{txt}
{com}. gen double ts_131428_0_0 = date(s_131428_0_0,"DMY")
{txt}(478,158 missing values generated)

{com}. format ts_131428_0_0 %td
{txt}
{com}. capture drop s_131428_0_0
{txt}
{com}. label variable ts_131428_0_0 "Date J02 first reported (acute pharyngitis)"
{txt}
{com}. gen double ts_131430_0_0 = date(s_131430_0_0,"DMY")
{txt}(484,774 missing values generated)

{com}. format ts_131430_0_0 %td
{txt}
{com}. capture drop s_131430_0_0
{txt}
{com}. label variable ts_131430_0_0 "Date J03 first reported (acute tonsillitis)"
{txt}
{com}. gen double ts_131432_0_0 = date(s_131432_0_0,"DMY")
{txt}(497,755 missing values generated)

{com}. format ts_131432_0_0 %td
{txt}
{com}. capture drop s_131432_0_0
{txt}
{com}. label variable ts_131432_0_0 "Date J04 first reported (acute laryngitis and tracheitis)"
{txt}
{com}. gen double ts_131434_0_0 = date(s_131434_0_0,"DMY")
{txt}(502,206 missing values generated)

{com}. format ts_131434_0_0 %td
{txt}
{com}. capture drop s_131434_0_0
{txt}
{com}. label variable ts_131434_0_0 "Date J05 first reported (acute obstructive laryngitis [croup] and epiglottitis)"
{txt}
{com}. gen double ts_131436_0_0 = date(s_131436_0_0,"DMY")
{txt}(450,107 missing values generated)

{com}. format ts_131436_0_0 %td
{txt}
{com}. capture drop s_131436_0_0
{txt}
{com}. label variable ts_131436_0_0 "Date J06 first reported (acute upper respiratory infections of multiple and unspecified sites)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_131438_0_0 = date(s_131438_0_0,"DMY")
{txt}(502,362 missing values generated)

{com}. format ts_131438_0_0 %td
{txt}
{com}. capture drop s_131438_0_0
{txt}
{com}. label variable ts_131438_0_0 "Date J09 first reported (influenza due to certain identified influenza virus)"
{txt}
{com}. gen double ts_131440_0_0 = date(s_131440_0_0,"DMY")
{txt}(500,716 missing values generated)

{com}. format ts_131440_0_0 %td
{txt}
{com}. capture drop s_131440_0_0
{txt}
{com}. label variable ts_131440_0_0 "Date J10 first reported (influenza due to identified influenza virus)"
{txt}
{com}. gen double ts_131442_0_0 = date(s_131442_0_0,"DMY")
{txt}(491,345 missing values generated)

{com}. format ts_131442_0_0 %td
{txt}
{com}. capture drop s_131442_0_0
{txt}
{com}. label variable ts_131442_0_0 "Date J11 first reported (influenza, virus not identified)"
{txt}
{com}. gen double ts_131444_0_0 = date(s_131444_0_0,"DMY")
{txt}(499,612 missing values generated)

{com}. format ts_131444_0_0 %td
{txt}
{com}. capture drop s_131444_0_0
{txt}
{com}. label variable ts_131444_0_0 "Date J12 first reported (viral pneumonia, not elsewhere classified)"
{txt}
{com}. gen double ts_131446_0_0 = date(s_131446_0_0,"DMY")
{txt}(501,322 missing values generated)

{com}. format ts_131446_0_0 %td
{txt}
{com}. capture drop s_131446_0_0
{txt}
{com}. label variable ts_131446_0_0 "Date J13 first reported (pneumonia due to streptococcus pneumoniae)"
{txt}
{com}. gen double ts_131448_0_0 = date(s_131448_0_0,"DMY")
{txt}(502,140 missing values generated)

{com}. format ts_131448_0_0 %td
{txt}
{com}. capture drop s_131448_0_0
{txt}
{com}. label variable ts_131448_0_0 "Date J14 first reported (pneumonia due to haemophilus influenzae)"
{txt}
{com}. gen double ts_131450_0_0 = date(s_131450_0_0,"DMY")
{txt}(500,843 missing values generated)

{com}. format ts_131450_0_0 %td
{txt}
{com}. capture drop s_131450_0_0
{txt}
{com}. label variable ts_131450_0_0 "Date J15 first reported (bacterial pneumonia, not elsewhere classified)"
{txt}
{com}. gen double ts_131452_0_0 = date(s_131452_0_0,"DMY")
{txt}(502,294 missing values generated)

{com}. format ts_131452_0_0 %td
{txt}
{com}. capture drop s_131452_0_0
{txt}
{com}. label variable ts_131452_0_0 "Date J16 first reported (pneumonia due to other infectious organisms, not elsewhere classified)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_131454_0_0 = date(s_131454_0_0,"DMY")
{txt}(502,014 missing values generated)

{com}. format ts_131454_0_0 %td
{txt}
{com}. capture drop s_131454_0_0
{txt}
{com}. label variable ts_131454_0_0 "Date J17 first reported (pneumonia in diseases classified elsewhere)"
{txt}
{com}. gen double ts_131456_0_0 = date(s_131456_0_0,"DMY")
{txt}(466,160 missing values generated)

{com}. format ts_131456_0_0 %td
{txt}
{com}. capture drop s_131456_0_0
{txt}
{com}. label variable ts_131456_0_0 "Date J18 first reported (pneumonia, organism unspecified)"
{txt}
{com}. gen double ts_131458_0_0 = date(s_131458_0_0,"DMY")
{txt}(496,890 missing values generated)

{com}. format ts_131458_0_0 %td
{txt}
{com}. capture drop s_131458_0_0
{txt}
{com}. label variable ts_131458_0_0 "Date J20 first reported (acute bronchitis)"
{txt}
{com}. gen double ts_131460_0_0 = date(s_131460_0_0,"DMY")
{txt}(502,214 missing values generated)

{com}. format ts_131460_0_0 %td
{txt}
{com}. capture drop s_131460_0_0
{txt}
{com}. label variable ts_131460_0_0 "Date J21 first reported (acute bronchiolitis)"
{txt}
{com}. gen double ts_131462_0_0 = date(s_131462_0_0,"DMY")
{txt}(437,647 missing values generated)

{com}. format ts_131462_0_0 %td
{txt}
{com}. capture drop s_131462_0_0
{txt}
{com}. label variable ts_131462_0_0 "Date J22 first reported (unspecified acute lower respiratory infection)"
{txt}
{com}. 
. ****************1696 to 1708************
. gen double ts_131696_0_0 = date(s_131696_0_0,"DMY")
{txt}(502,379 missing values generated)

{com}. format ts_131696_0_0 %td
{txt}
{com}. capture drop s_131696_0_0
{txt}
{com}. label variable ts_131696_0_0 "Date L00 first reported (staphylococcal scalded skin syndrome)"
{txt}
{com}. gen double ts_131698_0_0 = date(s_131698_0_0,"DMY")
{txt}(500,894 missing values generated)

{com}. format ts_131698_0_0 %td
{txt}
{com}. capture drop s_131698_0_0
{txt}
{com}. label variable ts_131698_0_0 "Date L01 first reported (impetigo)"
{txt}
{com}. gen double ts_131700_0_0 = date(s_131700_0_0,"DMY")
{txt}(489,457 missing values generated)

{com}. format ts_131700_0_0 %td
{txt}
{com}. capture drop s_131700_0_0
{txt}
{com}. label variable ts_131700_0_0 "Date L02 first reported (cutaneous abscess, furuncle and carbuncle)"
{txt}
{com}. gen double ts_131702_0_0 = date(s_131702_0_0,"DMY")
{txt}(469,311 missing values generated)

{com}. format ts_131702_0_0 %td
{txt}
{com}. capture drop s_131702_0_0
{txt}
{com}. label variable ts_131702_0_0 "Date L03 first reported (cellulitis)"
{txt}
{com}. gen double ts_131704_0_0 = date(s_131704_0_0,"DMY")
{txt}(501,601 missing values generated)

{com}. format ts_131704_0_0 %td
{txt}
{com}. capture drop s_131704_0_0
{txt}
{com}. label variable ts_131704_0_0 "Date L04 first reported (acute lymphadenitis)"
{txt}
{com}. gen double ts_131706_0_0 = date(s_131706_0_0,"DMY")
{txt}(500,765 missing values generated)

{com}. format ts_131706_0_0 %td
{txt}
{com}. capture drop s_131706_0_0
{txt}
{com}. label variable ts_131706_0_0 "Date L05 first reported (pilonidal cyst)"
{txt}
{com}. gen double ts_131708_0_0 = date(s_131708_0_0,"DMY")
{txt}(486,698 missing values generated)

{com}. format ts_131708_0_0 %td
{txt}
{com}. capture drop s_131708_0_0
{txt}
{com}. label variable ts_131708_0_0 "Date L08 first reported (other local infections of skin and subcutaneous tissue)"
{txt}
{com}. 
. 
. **(1840 1842 2054 2070 2074 2098 2108 2110)**
. gen double ts_131840_0_0 = date(s_131840_0_0,"DMY")
{txt}(501,429 missing values generated)

{com}. format ts_131840_0_0 %td
{txt}
{com}. capture drop s_131840_0_0
{txt}
{com}. label variable ts_131840_0_0 "Date M00 first reported (pyogenic arthritis)"
{txt}
{com}. gen double ts_131842_0_0 = date(s_131842_0_0,"DMY")
{txt}(502,351 missing values generated)

{com}. format ts_131842_0_0 %td
{txt}
{com}. capture drop s_131842_0_0
{txt}
{com}. label variable ts_131842_0_0 "Date M01 first reported (direct infections of joint in infectious and parasitic diseases classified elsewhere)"
{txt}note: label truncated to 80 characters

{com}. gen double ts_132054_0_0 = date(s_132054_0_0,"DMY")
{txt}(483,669 missing values generated)

{com}. format ts_132054_0_0 %td
{txt}
{com}. capture drop s_132054_0_0
{txt}
{com}. label variable ts_132054_0_0 "Date N30 first reported (cystitis)"
{txt}
{com}. gen double ts_132070_0_0 = date(s_132070_0_0,"DMY")
{txt}(445,682 missing values generated)

{com}. format ts_132070_0_0 %td
{txt}
{com}. capture drop s_132070_0_0
{txt}
{com}. label variable ts_132070_0_0 "Date N39 first reported (other disorders of urinary system)"
{txt}
{com}. gen double ts_132074_0_0 = date(s_132074_0_0,"DMY")
{txt}(497,547 missing values generated)

{com}. format ts_132074_0_0 %td
{txt}
{com}. capture drop s_132074_0_0
{txt}
{com}. label variable ts_132074_0_0 "Date N41 first reported (inflammatory diseases of prostate)"
{txt}
{com}. gen double ts_132098_0_0 = date(s_132098_0_0,"DMY")
{txt}(500,342 missing values generated)

{com}. format ts_132098_0_0 %td
{txt}
{com}. capture drop s_132098_0_0
{txt}
{com}. label variable ts_132098_0_0 "Date N61 first reported (inflammatory disorders of breast)"
{txt}
{com}. gen double ts_132108_0_0 = date(s_132108_0_0,"DMY")
{txt}(501,823 missing values generated)

{com}. format ts_132108_0_0 %td
{txt}
{com}. capture drop s_132108_0_0
{txt}
{com}. label variable ts_132108_0_0 "Date N71 first reported (inflammatory disease of uterus, except cervix)"
{txt}
{com}. gen double ts_132110_0_0 = date(s_132110_0_0,"DMY")
{txt}(500,256 missing values generated)

{com}. format ts_132110_0_0 %td
{txt}
{com}. capture drop s_132110_0_0
{txt}
{com}. label variable ts_132110_0_0 "Date N72 first reported (inflammatory disease of cervix uteri)"
{txt}
{com}. 
. 
. 
. su ts_53_*_0 ts_40000_0_0 ts_40000_1_0 ts_42018_0_0 ts_42020_0_0 ts*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}ts_53_0_0 {c |}{res}    502,389    17919.51    313.8655      16873      18536
{txt}{space 3}ts_53_2_0 {c |}{res}     56,013     21374.8     727.307      19583      22839
{txt}ts_40000_0_0 {c |}{res}     37,897    20779.72    1271.291      16931      22596
{txt}ts_40000_1_0 {c |}{res}         60    19851.58    441.4507      18992      20443
{txt}ts_42018_0_0 {c |}{res}      7,896    21062.24    1685.022     -21914      22590
{txt}{hline 13}{c +}{hline 57}
ts_42020_0_0 {c |}{res}      3,290    21258.79     1019.77      16033      22590
{txt}{space 3}ts_53_0_0 {c |}{res}    502,389    17919.51    313.8655      16873      18536
{txt}{space 3}ts_53_2_0 {c |}{res}     56,013     21374.8     727.307      19583      22839
{txt}ts_40000_0_0 {c |}{res}     37,897    20779.72    1271.291      16931      22596
{txt}ts_40000_1_0 {c |}{res}         60    19851.58    441.4507      18992      20443
{txt}{hline 13}{c +}{hline 57}
ts_42018_0_0 {c |}{res}      7,896    21062.24    1685.022     -21914      22590
{txt}ts_42020_0_0 {c |}{res}      3,290    21258.79     1019.77      16033      22590
{txt}ts_130000_~0 {c |}{res}         26    12849.08    5461.934      -4748      20703
{txt}ts_130002_~0 {c |}{res}        161    5342.832    10432.35     -21152      21962
{txt}ts_130004_~0 {c |}{res}        796    13353.63    5294.813     -20758      22537
{txt}{hline 13}{c +}{hline 57}
ts_130006_~0 {c |}{res}        212    8801.066    7469.934     -20758      21892
{txt}ts_130008_~0 {c |}{res}      8,421     17856.8    2917.071     -21152      22555
{txt}ts_130010_~0 {c |}{res}        403     16358.3    3866.797      -1038      22534
{txt}ts_130012_~0 {c |}{res}        118    13660.95    5333.713      -2042      21739
{txt}ts_130014_~0 {c |}{res}        508    15202.52    4188.097      -1095      22415
{txt}{hline 13}{c +}{hline 57}
ts_130016_~0 {c |}{res}      5,610    18616.02    2269.641      -1399      22551
{txt}ts_130018_~0 {c |}{res}     24,546    19590.07    3075.803     -20758      22705
{txt}ts_130020_~0 {c |}{res}      2,714    2110.272    6535.957      -7854      22459
{txt}ts_130022_~0 {c |}{res}        671    8653.019    8834.815      -5844      22490
{txt}ts_130024_~0 {c |}{res}         22    17372.45    2826.663       9044      20912
{txt}{hline 13}{c +}{hline 57}
ts_130026_~0 {c |}{res}        196    13200.92    7508.427      -6209      22497
{txt}ts_130028_~0 {c |}{res}         28    15842.32    7950.982      -3991      22544
{txt}ts_130030_~0 {c |}{res}          8       16831    5321.303       7305      21726
{txt}ts_130034_~0 {c |}{res}          2       17622    2638.923      15756      19488
{txt}ts_130036_~0 {c |}{res}         33    6706.212    5714.926      -1095      21374
{txt}{hline 13}{c +}{hline 57}
ts_130038_~0 {c |}{res}          1       20383           .      20383      20383
{txt}ts_130040_~0 {c |}{res}          3       14134    4169.265      10611      18737
{txt}ts_130042_~0 {c |}{res}         13    15476.62    6319.617      -1979      21812
{txt}ts_130044_~0 {c |}{res}         35    17328.54    4432.275       6885      22022
{txt}ts_130046_~0 {c |}{res}         65    17613.69    5098.295      -2123      22474
{txt}{hline 13}{c +}{hline 57}
ts_130048_~0 {c |}{res}          3    13851.33     6166.05       7671      20003
{txt}ts_130050_~0 {c |}{res}        160    19441.19    2948.924       2919      22537
{txt}ts_130052_~0 {c |}{res}         27    20068.04    2346.194      10562      22370
{txt}ts_130054_~0 {c |}{res}          1        9132           .       9132       9132
{txt}ts_130058_~0 {c |}{res}        119    13333.87    2856.618       1313      21321
{txt}{hline 13}{c +}{hline 57}
ts_130060_~0 {c |}{res}        147    1968.415    9475.984      -7123      21916
{txt}ts_130062_~0 {c |}{res}      2,495    146.3772    6895.109     -20758      22097
{txt}ts_130064_~0 {c |}{res}      1,528        -446    4043.163     -20758      22097
{txt}ts_130066_~0 {c |}{res}        117    15564.94    6307.914     -20758      22259
{txt}ts_130068_~0 {c |}{res}        815    20087.51    2076.845       9813      22543
{txt}{hline 13}{c +}{hline 57}
ts_130070_~0 {c |}{res}     15,906    20301.27    2505.758      -6028      22572
{txt}ts_130072_~0 {c |}{res}        219    16648.46    3215.863       5500      22168
{txt}ts_130074_~0 {c |}{res}          3       14783    3998.261      12036      19370
{txt}ts_130076_~0 {c |}{res}          1       18010           .      18010      18010
{txt}ts_130078_~0 {c |}{res}        328    17157.56    2908.296       6009      22510
{txt}{hline 13}{c +}{hline 57}
ts_130080_~0 {c |}{res}        204    17492.54    3053.231       8316      22553
{txt}ts_130082_~0 {c |}{res}      2,885    19288.17    3017.541       2922      22547
{txt}ts_130084_~0 {c |}{res}          9    7427.778    11984.24     -21152      19663
{txt}ts_130086_~0 {c |}{res}         20    14429.75    5653.087       2637      20264
{txt}ts_130088_~0 {c |}{res}         21    16216.62    2226.648      10374      20198
{txt}{hline 13}{c +}{hline 57}
ts_130090_~0 {c |}{res}         30     13347.7    5545.541       1461      21456
{txt}ts_130092_~0 {c |}{res}        282     7739.39    4296.662      -3805      19303
{txt}ts_130094_~0 {c |}{res}          4     15565.5    5162.411       8397      20678
{txt}ts_130096_~0 {c |}{res}         84     13453.9     3115.74       7671      19099
{txt}ts_130100_~0 {c |}{res}          2     14342.5    108.1873      14266      14419
{txt}{hline 13}{c +}{hline 57}
ts_130102_~0 {c |}{res}         90    10577.42    4206.233          0      20689
{txt}ts_130104_~0 {c |}{res}        446    13850.41    4079.353       4749      20877
{txt}ts_130106_~0 {c |}{res}      1,846    12085.29    4442.444     -21152      22070
{txt}ts_130108_~0 {c |}{res}          3       17430    1704.116      15531      18826
{txt}ts_130112_~0 {c |}{res}         24    15935.54    4486.111       1096      22446
{txt}{hline 13}{c +}{hline 57}
ts_130114_~0 {c |}{res}          6       18261    1416.144      16196      20244
{txt}ts_130116_~0 {c |}{res}          2       16288    2126.977      14784      17792
{txt}ts_130118_~0 {c |}{res}        320    17611.69    3336.851      -4201      22536
{txt}ts_130120_~0 {c |}{res}         32    14534.47    3387.214       9132      20909
{txt}ts_130122_~0 {c |}{res}         35    13137.37    2342.509       7671      20419
{txt}{hline 13}{c +}{hline 57}
ts_130124_~0 {c |}{res}         37     12778.7    4010.795       4930      21528
{txt}ts_130126_~0 {c |}{res}          5     18178.4    2278.855      16039      21353
{txt}ts_130128_~0 {c |}{res}         21    17561.95    2673.903      12009      21930
{txt}ts_130130_~0 {c |}{res}         10     13930.1    6272.564      -1826      20768
{txt}ts_130132_~0 {c |}{res}          2     16474.5     2018.79      15047      17902
{txt}{hline 13}{c +}{hline 57}
ts_130134_~0 {c |}{res}        521   -1189.593    5309.439     -21152      22205
{txt}ts_130136_~0 {c |}{res}         67    19974.57     2016.85      12593      22429
{txt}ts_130138_~0 {c |}{res}         18    19830.39    846.3665      17918      20527
{txt}ts_130140_~0 {c |}{res}         33    15140.12    3343.895       5479      20740
{txt}ts_130142_~0 {c |}{res}          8     16162.5     5058.59       4383      20700
{txt}{hline 13}{c +}{hline 57}
ts_130144_~0 {c |}{res}         15    16486.33    4660.807       9072      22031
{txt}ts_130146_~0 {c |}{res}        136    18831.75    4166.122      -1997      22475
{txt}ts_130148_~0 {c |}{res}        511    11622.75    6606.547     -20758      22376
{txt}ts_130150_~0 {c |}{res}         27    11138.15    7317.876      -1826      22473
{txt}ts_130152_~0 {c |}{res}         38    14575.97    4606.202       1827      21883
{txt}{hline 13}{c +}{hline 57}
ts_130154_~0 {c |}{res}         55    13779.76     5858.25       1643      21264
{txt}ts_130156_~0 {c |}{res}          2     18125.5    2884.289      16086      20165
{txt}ts_130158_~0 {c |}{res}         14    17664.86     3309.49       9497      20396
{txt}ts_130160_~0 {c |}{res}          9    16509.22    2365.157      11323      19105
{txt}ts_130162_~0 {c |}{res}          4    19026.75     1347.21      17056      20101
{txt}{hline 13}{c +}{hline 57}
ts_130164_~0 {c |}{res}         74     11358.3    6465.175      -4901      21559
{txt}ts_130168_~0 {c |}{res}         35    15982.86    4265.399       3288      21833
{txt}ts_130170_~0 {c |}{res}          1       16673           .      16673      16673
{txt}ts_130174_~0 {c |}{res}      4,920    15460.88    4473.023      -5662      22533
{txt}ts_130176_~0 {c |}{res}     15,288    2677.409    5655.865     -21152      22519
{txt}{hline 13}{c +}{hline 57}
ts_130178_~0 {c |}{res}     17,937    17109.45    3611.372      -5113      22736
{txt}ts_130180_~0 {c |}{res}         14    6290.714    5810.231      -2191      19786
{txt}ts_130184_~0 {c |}{res}     10,854    16.06403    3053.927     -21152      22468
{txt}ts_130186_~0 {c |}{res}      4,136    1769.418    4060.956     -21152      20933
{txt}ts_130188_~0 {c |}{res}     17,823    16264.97    3568.961     -21152      22547
{txt}{hline 13}{c +}{hline 57}
ts_130190_~0 {c |}{res}      1,048    14754.16      4745.2     -20758      22333
{txt}ts_130192_~0 {c |}{res}         30    16276.57    3826.683      11844      22134
{txt}ts_130194_~0 {c |}{res}      1,121    7873.337    6206.755     -21152      22510
{txt}ts_130196_~0 {c |}{res}        416    12946.83    5540.795      -4201      22531
{txt}ts_130198_~0 {c |}{res}        457    16266.97    4655.573      -2556      22526
{txt}{hline 13}{c +}{hline 57}
ts_130200_~0 {c |}{res}        878    18380.69    2631.508       4018      22536
{txt}ts_130202_~0 {c |}{res}      1,348    7963.729     5829.59      -5235      22524
{txt}ts_130204_~0 {c |}{res}         70    16651.21    1704.535      13595      22204
{txt}ts_130206_~0 {c |}{res}         16     16245.5    1562.363      13611      19791
{txt}ts_130208_~0 {c |}{res}         12    15929.58    1982.502      13718      19875
{txt}{hline 13}{c +}{hline 57}
ts_130210_~0 {c |}{res}         40    16342.35    1424.799      12054      19010
{txt}ts_130212_~0 {c |}{res}        518    14408.97    2932.859      -1645      22311
{txt}ts_130214_~0 {c |}{res}        300    19040.48    2559.826       7305      22526
{txt}ts_130216_~0 {c |}{res}      7,043    1413.529    4225.474     -20758      22320
{txt}ts_130218_~0 {c |}{res}      3,462    7276.918    5029.277      -7245      22389
{txt}{hline 13}{c +}{hline 57}
ts_130220_~0 {c |}{res}        208    17286.09    2692.207       4808      22424
{txt}ts_130222_~0 {c |}{res}        240    14848.08    4085.247       1378      22489
{txt}ts_130224_~0 {c |}{res}     12,151    17462.52    2974.883     -21152      22550
{txt}ts_130226_~0 {c |}{res}     33,070    16830.97    2593.945     -21152      22530
{txt}ts_130228_~0 {c |}{res}      5,871    17321.78    2877.517     -21152      22525
{txt}{hline 13}{c +}{hline 57}
ts_130230_~0 {c |}{res}     12,628    18377.16    3115.908     -21152      22553
{txt}ts_130232_~0 {c |}{res}          4     21062.5     1274.08      19172      21948
{txt}ts_130234_~0 {c |}{res}          9    16631.11    3754.989       8432      20701
{txt}ts_130236_~0 {c |}{res}          1       13850           .      13850      13850
{txt}ts_130240_~0 {c |}{res}          2       20181    258.8011      19998      20364
{txt}{hline 13}{c +}{hline 57}
ts_130242_~0 {c |}{res}          4    19533.75     2323.46      17136      22124
{txt}ts_130244_~0 {c |}{res}        462    19189.15    2972.487       1096      22574
{txt}ts_130246_~0 {c |}{res}          8     18570.5    1541.125      16904      20987
{txt}ts_130248_~0 {c |}{res}          4    19151.25    1881.594      17940      21951
{txt}ts_130250_~0 {c |}{res}         25    19452.12    2557.618      12616      22412
{txt}{hline 13}{c +}{hline 57}
ts_130252_~0 {c |}{res}         30     16432.3    4207.192       4383      22013
{txt}ts_130254_~0 {c |}{res}        533    19612.53     1796.48       3772      22544
{txt}ts_130256_~0 {c |}{res}        194    16874.08    3434.463       2727      22476
{txt}ts_130258_~0 {c |}{res}         43    13114.65    4431.881       5701      22268
{txt}ts_130260_~0 {c |}{res}          5     16989.8    1957.594      14776      19627
{txt}{hline 13}{c +}{hline 57}
ts_130262_~0 {c |}{res}          5     16840.6    4139.638      11415      21783
{txt}ts_130264_~0 {c |}{res}        898    8022.427    6153.918     -20758      21877
{txt}ts_130266_~0 {c |}{res}         17       17681    3166.557      12054      21895
{txt}ts_130270_~0 {c |}{res}          1       14082           .      14082      14082
{txt}ts_130272_~0 {c |}{res}         63     14939.4    5426.265      -2556      22337
{txt}{hline 13}{c +}{hline 57}
ts_130274_~0 {c |}{res}        181    20442.26    1581.571      13956      22526
{txt}ts_130276_~0 {c |}{res}         14    19202.71    2842.077      13402      22293
{txt}ts_130280_~0 {c |}{res}        111    12229.77    7162.976      -2191      21366
{txt}ts_130282_~0 {c |}{res}          7    17429.29    3990.509      11688      22481
{txt}ts_130284_~0 {c |}{res}         12    17352.92    3341.036       8766      21905
{txt}{hline 13}{c +}{hline 57}
ts_130286_~0 {c |}{res}         12    15596.08    3569.119      10227      21950
{txt}ts_130288_~0 {c |}{res}          6    17178.17    2921.331      12827      20117
{txt}ts_130292_~0 {c |}{res}         14    12198.14    8164.817      -1857      21385
{txt}ts_130296_~0 {c |}{res}         17    14079.29    4778.605       1827      18723
{txt}ts_130298_~0 {c |}{res}          4    14434.75    4247.736       8401      18051
{txt}{hline 13}{c +}{hline 57}
ts_130300_~0 {c |}{res}          1       15342           .      15342      15342
{txt}ts_130302_~0 {c |}{res}         33    15339.27    3771.745       6210      20776
{txt}ts_130304_~0 {c |}{res}         12    15342.25    4376.471       8766      22164
{txt}ts_130306_~0 {c |}{res}          8    14896.38    5377.315       5325      21577
{txt}ts_130308_~0 {c |}{res}          5     14602.4    8841.365       2776      21818
{txt}{hline 13}{c +}{hline 57}
ts_130310_~0 {c |}{res}        774    15585.93     4141.21      -3914      22524
{txt}ts_130312_~0 {c |}{res}         17    14071.59    5076.572        366      20789
{txt}ts_130314_~0 {c |}{res}         96    18178.82    2765.595       2703      22141
{txt}ts_130316_~0 {c |}{res}         85     14195.8    3566.988        266      22187
{txt}ts_130318_~0 {c |}{res}        339    15372.17    2988.162       2201      22424
{txt}{hline 13}{c +}{hline 57}
ts_130320_~0 {c |}{res}      2,458    15273.77        3881      -3723      22467
{txt}ts_130322_~0 {c |}{res}          9    18514.67    2917.672      12784      22165
{txt}ts_130324_~0 {c |}{res}        187    13834.48     2955.71       4383      22383
{txt}ts_130326_~0 {c |}{res}          4     18350.5    2149.242      15522      20551
{txt}ts_130328_~0 {c |}{res}         57    18699.25    3192.744       6575      22538
{txt}{hline 13}{c +}{hline 57}
ts_130330_~0 {c |}{res}        243    18170.37    2914.441       2954      22529
{txt}ts_130334_~0 {c |}{res}        168    20007.37    2675.186        731      22544
{txt}ts_130336_~0 {c |}{res}      8,984    19225.73     2413.04       -730      22543
{txt}ts_130338_~0 {c |}{res}     18,726    19168.62     2402.01       4749      22551
{txt}ts_130340_~0 {c |}{res}      3,774    21136.26    2221.616       3052      22551
{txt}{hline 13}{c +}{hline 57}
ts_130342_~0 {c |}{res}      4,735    18843.38    3159.624      -5174      22553
{txt}ts_130344_~0 {c |}{res}      1,130    18570.56    3729.375      -2820      22539
{txt}ts_130992_~0 {c |}{res}        235    16308.69     6961.94     -20758      22482
{txt}ts_130994_~0 {c |}{res}         63    17835.87    2716.986      11073      22370
{txt}ts_130996_~0 {c |}{res}         99    13691.95    7058.694      -4383      22519
{txt}{hline 13}{c +}{hline 57}
ts_130998_~0 {c |}{res}      2,411    6006.123    7453.914     -20758      22456
{txt}ts_131000_~0 {c |}{res}        863    14210.24    7347.264     -20758      22525
{txt}ts_131002_~0 {c |}{res}        175    16323.09    6362.802      -6819      22459
{txt}ts_131424_~0 {c |}{res}      5,559    16475.85    3032.362      -3077      22553
{txt}ts_131426_~0 {c |}{res}     24,620    15972.73    2831.513     -21152      22540
{txt}{hline 13}{c +}{hline 57}
ts_131428_~0 {c |}{res}     24,231    15828.59     3026.75     -20758      22529
{txt}ts_131430_~0 {c |}{res}     17,615    9254.735    7866.173     -21152      22552
{txt}ts_131432_~0 {c |}{res}      4,634     16133.7     2897.06      -3329      22534
{txt}ts_131434_~0 {c |}{res}        183    17643.36    3909.301        366      22533
{txt}ts_131436_~0 {c |}{res}     52,282    16917.46    2808.208     -21152      22548
{txt}{hline 13}{c +}{hline 57}
ts_131438_~0 {c |}{res}         27    20422.37    981.0178      18187      21957
{txt}ts_131440_~0 {c |}{res}      1,673    20691.44    1303.099      13748      22445
{txt}ts_131442_~0 {c |}{res}     11,044    15964.78    3010.285     -21152      21999
{txt}ts_131444_~0 {c |}{res}      2,777    21686.34    2547.393      -6209      22555
{txt}ts_131446_~0 {c |}{res}      1,067    15961.53    6218.533      -6209      22540
{txt}{hline 13}{c +}{hline 57}
ts_131448_~0 {c |}{res}        249    19838.97    1983.645      13893      22484
{txt}ts_131450_~0 {c |}{res}      1,546    18760.28     4013.87     -20758      22552
{txt}ts_131452_~0 {c |}{res}         95    15951.59    6256.423      -2191      22536
{txt}ts_131454_~0 {c |}{res}        375    19726.81    2078.551       9497      22552
{txt}ts_131456_~0 {c |}{res}     36,229    16816.77    7469.012     -21152      22564
{txt}{hline 13}{c +}{hline 57}
ts_131458_~0 {c |}{res}      5,499    16076.41    3707.387     -21152      22535
{txt}ts_131460_~0 {c |}{res}        175    16514.13    8849.084     -21152      22463
{txt}ts_131462_~0 {c |}{res}     64,742    17763.53    2623.018     -20758      22566
{txt}ts_131696_~0 {c |}{res}         10     13564.8    7339.589      -2497      20464
{txt}ts_131698_~0 {c |}{res}      1,495    16465.54    3693.316     -20758      22527
{txt}{hline 13}{c +}{hline 57}
ts_131700_~0 {c |}{res}     12,932    17198.56    3344.826     -21152      22550
{txt}ts_131702_~0 {c |}{res}     33,078    18097.59    2804.482     -21152      22553
{txt}ts_131704_~0 {c |}{res}        788    13707.79    5604.209     -20758      22518
{txt}ts_131706_~0 {c |}{res}      1,624    14065.62    5215.394     -20758      22543
{txt}ts_131708_~0 {c |}{res}     15,691     17672.2    2719.665     -20758      22543
{txt}{hline 13}{c +}{hline 57}
ts_131840_~0 {c |}{res}        960    18579.13    3502.762      -3653      22543
{txt}ts_131842_~0 {c |}{res}         38    15875.24    3999.741       3368      21120
{txt}ts_132054_~0 {c |}{res}     18,720    16668.49    3615.794     -21152      22551
{txt}ts_132070_~0 {c |}{res}     56,707     17392.3    3831.761     -21152      22736
{txt}ts_132074_~0 {c |}{res}      4,842    17666.63    3423.071      -1461      22551
{txt}{hline 13}{c +}{hline 57}
ts_132098_~0 {c |}{res}      2,047    14986.36    4072.939      -1461      22546
{txt}ts_132108_~0 {c |}{res}        566    16265.08    3316.153       1568      22519
{txt}ts_132110_~0 {c |}{res}      2,133    14820.45    3892.013      -3651      22518
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin.dta", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin.dta{rm}
saved
{p_end}

{com}. 
. 
. **************************DEMOGRAPHICS, SES: Fix this section in all papers*********************************************
. cd "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA"
{res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA
{txt}
{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. 
. keep n_eid n_31_0_0 n_21022_0_0  n_34_0_0 n_52_0_0 n_6138_0_0 n_189_0_0 ts_53_0_0 ts_40000_0_0 ts_40000_1_0 n_21000_0_0 n_709_0_0 n_738_0_0 n_1239_0_0 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. **Exogenous variables: age (@@fix baseline age), gender, household size**
. 
. 
. *Sex*
. capture drop sex
{txt}
{com}. gen sex=n_31_0_0 
{txt}
{com}. recode sex 0=2 1=1
{txt}(273312 changes made to {bf:sex})

{com}. 
. 
. *Age*
. capture drop Age
{txt}
{com}. gen Age=n_21022_0_0 
{txt}(3 missing values generated)

{com}. 
. *Years of Birth*
. capture drop birthyear
{txt}
{com}. gen birthyear=n_34_0_0 
{txt}(3 missing values generated)

{com}. 
. *Month of Birth*
. capture drop birthmonth
{txt}
{com}. gen birthmonth=n_52_0_0 
{txt}(3 missing values generated)

{com}. 
. *Date of birth*
. capture drop birthdate
{txt}
{com}. gen birthdate=mdy(birthmonth,14,birthyear)
{txt}(3 missing values generated)

{com}. 
. *Baseline Cohort Start Date*
. capture drop startdate
{txt}
{com}. gen startdate=ts_53_0_0 
{txt}
{com}. format startdate %d
{txt}
{com}. 
. *Baseline age**
. capture drop baselineage
{txt}
{com}. gen baselineage=(startdate-birthdate)/365.25
{txt}(3 missing values generated)

{com}. 
. 
. 
. 
. **Household size**
. label var n_709_0_0     "Number in household"
{txt}
{com}. 
. capture drop householdsize
{txt}
{com}. gen householdsize=n_709_0_0
{txt}(2,261 missing values generated)

{com}. label var householdsize "Number of household members"
{txt}
{com}. 
. **-1    Do not know
. **-3    Prefer not to answer
. 
. recode householdsize (-1=. ) (-3=.)
{txt}(2288 changes made to {bf:householdsize})

{com}. 
. *Ethnicity*
. capture drop ethnicity
{txt}
{com}. 
. gen ethnicity = 1 if inlist(n_21000_0_0,1,1001,1002,1003) 
{txt}(29,798 missing values generated)

{com}. replace ethnicity = 2 if inlist(n_21000_0_0,3,3001,3002,3003,3004)
{txt}(9,879 real changes made)

{com}. replace ethnicity = 3 if inlist(n_21000_0_0,5)
{txt}(1,573 real changes made)

{com}. replace ethnicity = 4 if inlist(n_21000_0_0,4,4001,4002,4003)
{txt}(8,058 real changes made)

{com}. replace ethnicity = 5 if inlist(n_21000_0_0,2,6,2001,2002,2003,2004)
{txt}(7,510 real changes made)

{com}. replace ethnicity = 6 if ethnicity ==.
{txt}(2,778 real changes made)

{com}. 
. label var ethnicity "ethnic group"
{txt}
{com}. label define ethnicityL 1 "white" 2 "south asian" 3 "east asian" 4 "black" 5 "other/mixed" 6 "unknown"
{txt}
{com}. label values ethnicity ethnicityL
{txt}
{com}. 
. capture drop ethnicity2
{txt}
{com}. gen ethnicity2=.
{txt}(502,389 missing values generated)

{com}. replace ethnicity2=ethnicity
{txt}(502,389 real changes made)

{com}. recode ethnicity2 (1=0) (4=1) (2=2) (3=3) (5=3) (6=3) 
{txt}(490937 changes made to {bf:ethnicity2})

{com}. 
. label var ethnicity2 "ethnic grouping 2"
{txt}
{com}. label define ethnicityL2 0 "white" 1 "black" 2 "south asian" 3 "other" 
{txt}
{com}. label values ethnicity2 ethnicityL2
{txt}
{com}. 
. capture drop RACE_ETHN=ethnicity2
{txt}
{com}. 
. capture drop NonWhite
{txt}
{com}. gen NonWhite=.
{txt}(502,389 missing values generated)

{com}. replace NonWhite=ethnicity2
{txt}(502,389 real changes made)

{com}. recode NonWhite (0=0) (1=1) (2=1) (3=1)
{txt}(21740 changes made to {bf:NonWhite})

{com}. 
. label var NonWhite "ethnic grouping 3"
{txt}
{com}. label define ethnicityL3 0 "white" 1 "Non-White"  
{txt}
{com}. label values NonWhite ethnicityL3
{txt}
{com}. 
. 
. ******************DATES*******************************************
. 
. *Years of Birth*
. capture drop birthyear
{txt}
{com}. gen  birthyear=n_34_0_0 
{txt}(3 missing values generated)

{com}. 
. *Month of Birth*
. capture drop birthmonth
{txt}
{com}. gen  birthmonth=n_52_0_0 
{txt}(3 missing values generated)

{com}. 
. *Death Date*
. capture drop deathdate
{txt}
{com}. gen deathdate = ts_40000_0_0 
{txt}(464,492 missing values generated)

{com}. replace deathdate =  ts_40000_1_0 if deathdate ==.
{txt}(0 real changes made)

{com}. format deathdate %d
{txt}
{com}. label var deathdate "date of death"
{txt}
{com}. 
. *Baseline Cohort Start Date*
. capture drop startdate
{txt}
{com}. gen startdate=ts_53_0_0 
{txt}
{com}. 
. ********************************SES******************************
. 
. *Education, qualification*
. capture rename n_6138_0_0 education
{txt}
{com}. recode education -7=. -3=. 7=. 
{txt}(90748 changes made to {bf:education})

{com}. label define educationL 0 "none" 1 "College/University" 2 "A/AS Levels/Equivalent" 3 "O Levels/GCSEs/Equivalent" 4 "CSEs/Equivalent" 5 "NVQ/HND/HNC/Equivalent" 6 "Other professional qual" 7 "Unknown"
{txt}
{com}. label values education educationL
{txt}
{com}. 
. capture drop educationbr
{txt}
{com}. gen educationbr=.
{txt}(502,389 missing values generated)

{com}. replace educationbr=0 if (education==0 | education==4 | education==5 | education==6)
{txt}(85,407 real changes made)

{com}. replace educationbr=1 if (education==2 | education==3)
{txt}(160,476 real changes made)

{com}. replace educationbr=2 if education==1
{txt}(161,116 real changes made)

{com}. 
. *Deprivation*
. capture rename n_189_0_0 townsend
{txt}
{com}. 
. 
. **Household income before tax**
. label var n_738_0_0     "Average total household income before tax"
{txt}
{com}. 
. **1     Less than 18,000
. **2     18,000 to 30,999
. **3     31,000 to 51,999
. **4     52,000 to 100,000
. **5     Greater than 100,000
. **-1    Do not know
. **-3    Prefer not to answer
. 
. 
. 
. capture drop householdincome
{txt}
{com}. gen householdincome=n_738_0_0   
{txt}(6,014 missing values generated)

{com}. label var householdincome "Average total household income before tax"
{txt}
{com}. 
. recode householdincome (-1=.) (-3=.)
{txt}(71128 changes made to {bf:householdincome})

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 2: GENERATE SES VARIABLE//
. 
. 
. **SES: educationbr, householdincome, townsend
. 
. capture drop zeducationbr 
{txt}
{com}. egen zeducationbr=std(educationbr)
{txt}(95,390 missing values generated)

{com}. 
. capture drop zhouseholdincome 
{txt}
{com}. egen zhouseholdincome=std(householdincome)
{txt}(77,142 missing values generated)

{com}. 
. capture drop ztownsend
{txt}
{com}. egen ztownsend=std(townsend)
{txt}(626 missing values generated)

{com}. 
. capture drop ztownsendinv
{txt}
{com}. gen ztownsendinv=ztownsend*-1
{txt}(626 missing values generated)

{com}. 
. capture drop rowmissSES
{txt}
{com}. egen rowmissSES=rowmiss(zeducationbr zhouseholdincome ztownsendinv)
{txt}
{com}. 
. tab rowmissSES

 {txt}rowmissSES {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    359,785       71.61       71.61
{txt}          1 {c |}{res}    112,081       22.31       93.92
{txt}          2 {c |}{res}     30,492        6.07       99.99
{txt}          3 {c |}{res}         31        0.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop SES
{txt}
{com}. egen SES=rowmean(zeducationbr zhouseholdincome ztownsendinv) if rowmissSES<=1
{txt}(30,523 missing values generated)

{com}. 
. 
. save, replace  
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 3: GENERATE LIFESTYLE VARIABLES: SMOKING, ALCOHOL, AND PA//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_1239_0_0 n_3456_0_0 n_22507_0_0  n_1279_0_0 n_1269_0_0 n_20162_0_0 n_1558_0_0 n_100022_0_0 n_981_0_0 ///
> n_971_0_0 n_894_0_0 n_884_0_0 n_914_0_0 n_904_0_0 n_21022_0_0
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. capture drop Age
{txt}
{com}. gen Age=n_21022_0_0 
{txt}(3 missing values generated)

{com}. 
. 
. *Current Smoking Status*
. capture drop smoking
{txt}
{com}. gen smoking = 0 if  n_1239_0_0 == 0 | n_1239_0_0 == -3
{txt}(53,855 missing values generated)

{com}. replace smoking = 1 if n_22507_0_0 != . 
{txt}(43,998 real changes made)

{com}. replace smoking = 2 if n_1239_0_0 == 1 | n_1239_0_0 == 2
{txt}(52,962 real changes made)

{com}. label var smoking "current smoking status"
{txt}
{com}. label define smokingL 0 "never smoker" 1 "ex-smoker" 2 "current smoker"
{txt}
{com}. label values smoking smokingL
{txt}
{com}. recode smoking .=0
{txt}(871 changes made to {bf:smoking})

{com}. 
. *Cigarettes Per Day*
. capture drop cigperday
{txt}
{com}. gen cigperday = n_3456_0_0 if smoking == 2    //missing values exist - consider imputation
{txt}(465,918 missing values generated)

{com}. replace cigperday = 0 if smoking == 0 | smoking == 1
{txt}(449,427 real changes made)

{com}. replace cigperday = . if cigperday < 0
{txt}(329 real changes made, 329 to missing)

{com}. label var cigperday "if smoking, number of cig per day"
{txt}
{com}. 
. *Aged Stopped Smoking Cigarettes*
. capture drop stopsmoke agestop
{txt}
{com}. gen stopsmoke = Age - n_22507_0_0 
{txt}(458,391 missing values generated)

{com}. label var stopsmoke "intermediate var: baseline age - age stopped smoking"
{txt}
{com}. gen agestop = 1 if stopsmoke < 5
{txt}(496,122 missing values generated)

{com}. replace agestop = 2 if stopsmoke >= 5 & stopsmoke <= 10
{txt}(5,261 real changes made)

{com}. replace agestop = 3 if stopsmoke > 10 & stopsmoke !=.
{txt}(32,470 real changes made)

{com}. label var agestop "how long ago did you quit smoking in years"
{txt}
{com}. label define stopL 1 "< 5 years" 2 " between 5-10 years" 3 "> 10 years"
{txt}
{com}. label values agestop stopL  
{txt}
{com}. 
. *Combine Current Smoking with Ex-smoking duration for protective effects*
. capture drop smokingstatus
{txt}
{com}. gen smokingstatus = 0 if smoking == 2
{txt}(449,427 missing values generated)

{com}. replace smokingstatus = agestop if smokingstatus ==.
{txt}(40,261 real changes made)

{com}. replace smokingstatus = 4 if smoking == 0
{txt}(409,166 real changes made)

{com}. label var smokingstatus "complete smoking status"
{txt}
{com}. label define statusL 0 "current smoker" 1 "ex-smoker < 5 years" 2 "ex-smoker between 5-10 years" 3 "ex-smoker > 10 years" 4 "never smoker"
{txt}
{com}. label values smokingstatus statusL
{txt}
{com}. recode smokingstatus .=4
{txt}(0 changes made to {bf:smokingstatus})

{com}. 
. *Environmental tobacco smoke*
. capture drop etsmoke
{txt}
{com}. replace n_1279_0_0 = . if n_1279_0_0 < 0
{txt}(41,102 real changes made, 41,102 to missing)

{com}. replace n_1269_0_0  = . if n_1269_0_0 < 0
{txt}(11,522 real changes made, 11,522 to missing)

{com}. order n_1279_0_0, after(n_1269_0_0)
{txt}
{com}. egen ets = rowtotal(n_1269_0_0-n_1279_0_0)
{txt}
{com}. gen etsmoke = ets
{txt}
{com}. label var etsmoke "environmental tobacco exposures (hours per week)"
{txt}
{com}. 
. **Pack-years of smoking**
. capture drop packyearssmoke
{txt}
{com}. gen packyearssmoke=n_20162_0_0
{txt}(351,477 missing values generated)

{com}. replace packyearssmoke=0 if smoking==0
{txt}(408,503 real changes made)

{com}. 
. 
. 
. **Use smokingstatus, etsmoke and packyearssmoke as measured variables for SMOKING LATENT VARIABLE OR AVERAGE Z-SCORE*****
. 
. 
. capture drop zsmokingstatus zetsmoke zpackyearssmoke
{txt}
{com}. egen zsmokingstatus=std(smokingstatus)
{txt}
{com}. egen zetsmoke=std(etsmoke)
{txt}
{com}. egen zpackyearssmoke=std(packyearssmoke)
{txt}(25,180 missing values generated)

{com}. 
. 
. capture drop rowmissSMOKE
{txt}
{com}. egen rowmissSMOKE=rowmiss(zsmokingstatus zetsmoke zpackyearssmoke)
{txt}
{com}. 
. tab rowmissSMOKE

{txt}rowmissSMOK {c |}
          E {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    477,209       94.99       94.99
{txt}          1 {c |}{res}     25,180        5.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. egen SMOKE=rmean(zsmokingstatus zetsmoke zpackyearssmoke) if rowmissSMOKE<=1
{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. ************************************ALCOHOL: fixed code 6 to missing***************************************************
. *https://biobank.ctsu.ox.ac.uk/crystal/label.cgi?id=100098
. 
. *Usual Alcohol intake*
. 
. capture drop alcohol
{txt}
{com}. gen alcohol = 0 if  n_1558_0_0 == 6
{txt}(461,763 missing values generated)

{com}. replace alcohol = 1 if  n_1558_0_0 == 5
{txt}(57,993 real changes made)

{com}. replace alcohol = 2 if  n_1558_0_0 == 4
{txt}(55,838 real changes made)

{com}. replace alcohol = 3 if  n_1558_0_0 == 3
{txt}(129,263 real changes made)

{com}. replace alcohol = 4 if  n_1558_0_0 == 2
{txt}(115,417 real changes made)

{com}. replace alcohol = 5 if  n_1558_0_0 == 1
{txt}(101,750 real changes made)

{com}. replace alcohol = . if  n_1558_0_0 == -3
{txt}(0 real changes made)

{com}. replace alcohol = . if  n_1558_0_0 ==.
{txt}(0 real changes made)

{com}. label var alcohol "alcohol intake frequency"
{txt}
{com}. label define alcoholL 0 "never" 1 "special occasions only" 2 "1-3 times per month" 3 "1-3 times per week" 4 "3-4 times per week" 5 "daily or almost daily" 
{txt}
{com}. label values alcohol alcoholL
{txt}
{com}. 
. 
. 
. **use alcohol ALCOHOL LATENT VARIABLE OR AVERAGE Z-SCORE***
. 
. egen zalcohol=std(alcohol)
{txt}(1,502 missing values generated)

{com}. 
. capture drop ALCOHOL
{txt}
{com}. gen ALCOHOL=zalcohol
{txt}(1,502 missing values generated)

{com}. 
. *************************************PHYSICAL ACTIVITY**********************************************************************
. 
. ***https://biobank.ctsu.ox.ac.uk/crystal/search.cgi?wot=0&srch=physical+activity&sta0=on&sta1=on&sta2=on&sta3=on&str0=on&str3=on&fit0=on&fit10=on&fit20=on&fit30=on&fvt11=on&fvt21=on&fvt22=on&fvt31=on&fvt41=on&fvt51=on&fvt61=on&fvt101=on
. 
. 
. *Physical activity - use the IPAQ scoring guidelines*
. 
. *Walking MET-min/week - use median time of each category*
. capture drop walkperday
{txt}
{com}. gen walkperday = 7.5 if n_981_0_0 == 1
{txt}(495,749 missing values generated)

{com}. replace walkperday = 22.5 if n_981_0_0 == 2
{txt}(76,043 real changes made)

{com}. replace walkperday = 45 if n_981_0_0 == 3
{txt}(127,098 real changes made)

{com}. replace walkperday = 75 if n_981_0_0 == 4
{txt}(62,073 real changes made)

{com}. replace walkperday = 105 if n_981_0_0 == 5
{txt}(31,131 real changes made)

{com}. replace walkperday = 150 if n_981_0_0 == 6
{txt}(22,785 real changes made)

{com}. replace walkperday = 210 if n_981_0_0 == 7
{txt}(23,276 real changes made)

{com}. label var walkperday "walking minutes per day"
{txt}
{com}. 
. *Frequency of Walking (no days per week) - use median time of each category*
. capture drop walkperweek
{txt}
{com}. gen walkperweek = 0.25 if n_971_0_0 == 1
{txt}(475,832 missing values generated)

{com}. replace walkperweek = 0.625 if n_971_0_0 == 2
{txt}(100,399 real changes made)

{com}. replace walkperweek = 1 if n_971_0_0 == 3
{txt}(61,291 real changes made)

{com}. replace walkperweek = 2.5 if n_971_0_0 == 4
{txt}(79,212 real changes made)

{com}. replace walkperweek = 4.5 if n_971_0_0 == 5
{txt}(39,108 real changes made)

{com}. replace walkperweek = 7 if n_971_0_0 == 6
{txt}(42,607 real changes made)

{com}. label var walkperweek "walking days per week"
{txt}
{com}. 
. *Calculate walking MET-min/week*
. capture drop walkMETmin
{txt}
{com}. gen walkMETmin = 3.3 * walkperday * walkperweek
{txt}(154,328 missing values generated)

{com}. label var walkMETmin "MET-min per week walking"
{txt}
{com}. 
. *Moderate exercise MET-min/week*
. capture drop modperday
{txt}
{com}. gen modperday = n_894_0_0 if n_894_0_0 >= 0
{txt}(134,061 missing values generated)

{com}. label var modperday "moderate exercise minutes per day"
{txt}
{com}. 
. *Frequency of moderate exercise (no days per week)*
. capture drop modperweek
{txt}
{com}. gen modperweek =  n_884_0_0 if  n_884_0_0 >= 0
{txt}(27,266 missing values generated)

{com}. label var modperweek "moderate exercise days per week"
{txt}
{com}. 
. *Calculate moderate exercise MET-min/week*
. capture drop modMETmin
{txt}
{com}. gen modMETmin = 4.0 * modperday * modperweek
{txt}(134,061 missing values generated)

{com}. label var modMETmin "MET-min per week moderate exercise"
{txt}
{com}. 
. *Vigorous exercise MET-min/week*
. capture drop vigperday
{txt}
{com}. gen vigperday = n_914_0_0 if n_914_0_0 >= 0
{txt}(232,978 missing values generated)

{com}. label var vigperday "vigorous exercise minutes per day"
{txt}
{com}. 
. *Frequency of vigorous exercise (no days per week)*
. capture drop vigperweek
{txt}
{com}. gen vigperweek = n_904_0_0 if n_904_0_0 >= 0
{txt}(27,575 missing values generated)

{com}. label var vigperweek "vigorous exercise days per week"
{txt}
{com}. 
. *Calculate vigorous exercise MET-min/week*
. capture drop vigMETmin
{txt}
{com}. gen vigMETmin = 8.0 * vigperday * vigperweek
{txt}(232,978 missing values generated)

{com}. label var vigMETmin "MET-min per week vigorous exercise"
{txt}
{com}. 
. ****Calculate TOTAL MET-min per week*******
. capture drop METmin
{txt}
{com}. order modMETmin, before(vigMETmin)
{txt}
{com}. order walkMETmin, before(modMETmin)
{txt}
{com}. egen METmin = rowtotal(walkMETmin modMETmin vigMETmin)
{txt}
{com}. label var METmin "MET-min per week total exercise" // missing values exist - consider imputation
{txt}
{com}. 
. ////USE METmin as the PA measure, z-scored////
> 
. capture drop PA
{txt}
{com}. egen PA=std(METmin)
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 4: GENERATE LIFESTYLE VARIABLES: DIET//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_1289_0_0 n_1299_0_0 n_1309_0_0 n_1319_0_0 n_1329_0_0 n_1339_0_0 n_1349_0_0 n_1359_0_0 n_1369_0_0 n_1379_0_0 n_1389_0_0 n_6144_0_0 ///
> n_6144_0_1 n_6144_0_2 n_6144_0_3 n_10855_0_0 n_1408_0_0 n_1418_0_0 n_2654_0_0 n_1428_0_0 n_1438_0_0 n_1448_0_0 n_1458_0_0 n_1468_0_0 ///
> n_1478_0_0 n_1478_0_0 n_1548_0_0  n_6144_0_0
{txt}
{com}. 
. **(ALL ITEMS UNDER THE DIET CATEGORY)
. **URL: https://biobank.ndph.ox.ac.uk/showcase/label.cgi?id=100052
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. **https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.115.018585#d3e341
. 
. 
. **********Recoding as missing data fields and -10 as 0.50***********************
. **-10:<1 --> to 0.5 throughout
. **-3: prefer not to answer
. **-1: do not know
. 
. capture drop n_1289_0_0r n_1299_0_0r n_1309_0_0r n_1319_0_0r n_1329_0_0r n_1339_0_0r n_1349_0_0r n_1359_0_0r n_1369_0_0r n_1379_0_0r n_1389_0_0r 
{txt}
{com}. capture drop n_6144_0_0r n_6144_0_1r n_6144_0_2r n_6144_0_3r n_10855_0_0r n_1408_0_0r n_1418_0_0r n_2654_0_0r n_1438_0_0r n_1448_0_0r n_1458_0_0r 
{txt}
{com}. capture drop n_1468_0_0r n_1478_0_0r n_1478_0_0r
{txt}
{com}. 
. 
. foreach x of varlist n_1289_0_0 n_1299_0_0 n_1309_0_0 n_1319_0_0 n_1329_0_0 n_1339_0_0 n_1349_0_0 n_1359_0_0 n_1369_0_0 n_1379_0_0 n_1389_0_0 n_6144_0_0 n_6144_0_1 n_6144_0_2 n_6144_0_3 n_10855_0_0 n_1408_0_0 n_1418_0_0 n_2654_0_0 n_1428_0_0 n_1438_0_0 n_1448_0_0 n_1458_0_0 n_1468_0_0 n_1478_0_0  {c -(}
{txt}  2{com}.         gen `x'r=`x'
{txt}  3{com}. {c )-}
{txt}(895 missing values generated)
(895 missing values generated)
(895 missing values generated)
(896 missing values generated)
(896 missing values generated)
(896 missing values generated)
(897 missing values generated)
(897 missing values generated)
(897 missing values generated)
(897 missing values generated)
(899 missing values generated)
(4,669 missing values generated)
(488,536 missing values generated)
(498,236 missing values generated)
(501,960 missing values generated)
(498,619 missing values generated)
(12,878 missing values generated)
(982 missing values generated)
(242,625 missing values generated)
(4,669 missing values generated)
(4,669 missing values generated)
(21,121 missing values generated)
(1,016 missing values generated)
(87,273 missing values generated)
(899 missing values generated)

{com}. 
. foreach y of varlist n_1289_0_0r n_1299_0_0r n_1309_0_0r n_1319_0_0r n_1329_0_0r n_1339_0_0r n_1349_0_0r n_1359_0_0r n_1369_0_0r n_1379_0_0r n_1389_0_0r n_6144_0_0r n_6144_0_1r n_6144_0_2r n_6144_0_3r n_10855_0_0r n_1408_0_0r n_1418_0_0r n_1428_0_0r n_2654_0_0r n_1438_0_0r n_1448_0_0r n_1458_0_0r n_1468_0_0r n_1478_0_0r n_1478_0_0r {c -(}
{txt}  2{com}. replace `y'=. if `y'==-3 | `y'==-1 | `y'==-5
{txt}  3{com}. {c )-}
{txt}(6,696 real changes made, 6,696 to missing)
(6,952 real changes made, 6,952 to missing)
(2,346 real changes made, 2,346 to missing)
(6,061 real changes made, 6,061 to missing)
(3,185 real changes made, 3,185 to missing)
(2,828 real changes made, 2,828 to missing)
(1,334 real changes made, 1,334 to missing)
(1,177 real changes made, 1,177 to missing)
(2,428 real changes made, 2,428 to missing)
(3,591 real changes made, 3,591 to missing)
(3,397 real changes made, 3,397 to missing)
(1,769 real changes made, 1,769 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made, 6 to missing)
(1,574 real changes made, 1,574 to missing)
(545 real changes made, 545 to missing)
(1,135 real changes made, 1,135 to missing)
(1,375 real changes made, 1,375 to missing)
(6,120 real changes made, 6,120 to missing)
(1,536 real changes made, 1,536 to missing)
(2,070 real changes made, 2,070 to missing)
(3,171 real changes made, 3,171 to missing)
(228 real changes made, 228 to missing)
(0 real changes made)

{com}. 
. 
. 
. foreach y of varlist n_1289_0_0r n_1299_0_0r n_1309_0_0r n_1319_0_0r n_1329_0_0r n_1339_0_0r n_1349_0_0r n_1359_0_0r n_1369_0_0r n_1379_0_0r n_1389_0_0r  n_6144_0_0r n_6144_0_1r n_6144_0_2r n_6144_0_3r n_10855_0_0r n_1408_0_0r n_1418_0_0r n_2654_0_0r n_1438_0_0r n_1448_0_0r n_1458_0_0r n_1468_0_0r n_1478_0_0r n_1478_0_0r {c -(}
{txt}  2{com}. replace `y'=0.5 if `y'==-10 
{txt}  3{com}. {c )-}
{txt}(10,018 real changes made)
(23,438 real changes made)
(15,876 real changes made)
(39,122 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5,717 real changes made)
(0 real changes made)
(22,286 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. /////////////////////FRUITS COMPONENT //////////////////////
> 
. 
. **Servings per day for all fruits**
. 
. **1 piece of dried fruit (e.g. apricot)~=2.5 TBSP, 1 TBSP= 0.063 cups;  cup of dried fruit (1 serving) is 3 pieces of dried fruit.
. 
. **1 medium sized fruit is one serving.
. 
. capture drop allfruits
{txt}
{com}. gen allfruits=.
{txt}(502,389 missing values generated)

{com}. replace allfruits=(n_1309_0_0r+(n_1319_0_0r/3))
{txt}(494,332 real changes made)

{com}. 
. **>=3 servings per day**
. 
. 
. capture drop allfruits_component1
{txt}
{com}. gen allfruits_component1=.
{txt}(502,389 missing values generated)

{com}. replace allfruits_component1=1 if allfruits>=3 & allfruits~=.
{txt}(191,995 real changes made)

{com}. replace allfruits_component1=0 if allfruits_component1~=1 & allfruits~=.
{txt}(302,337 real changes made)

{com}. 
. 
. 
. //////////////////////VEGETABLES COMPONENT/////////////////////
> 
. **Servings per day for all vegetables**
. 
. **1 cup of raw leafy vegetables is 16 TBSP.  cup of cooked or non-leafy raw vegetables is 8 TBSP. 
. 
. **1 serving of raw leafy/non-leafy vegetables is ~=12 TBSP; 1 serving of cooked vegetables is ~=8 TBSP
. 
. 
. capture drop allvegs
{txt}
{com}. gen allvegs=.
{txt}(502,389 missing values generated)

{com}. replace allvegs=((n_1289_0_0r/8))+((n_1299_0_0r/12))
{txt}(491,439 real changes made)

{com}. 
. **>=3 servings per day**
. 
. capture drop allvegs_component2
{txt}
{com}. gen allvegs_component2=.
{txt}(502,389 missing values generated)

{com}. replace allvegs_component2=1 if allvegs>=3 & allvegs~=.
{txt}(1,006 real changes made)

{com}. replace allvegs_component2=0 if allvegs_component2~=1 & allvegs~=.
{txt}(490,433 real changes made)

{com}. 
. //////////////WHOLE GRAINS///////////////////////////////////
> 
. **Bread intake, slices/week: n_1438_0_0r
. **Type of bread: n_1448_0_0r    
. 
. **1 White
. **2     Brown
. **3     Wholemeal or wholegrain
. **4     Other type of bread
. 
. 
. **Cereal intake, bowls/week: n_1458_0_0r
. 
. 
. **Cereal type:n_1448_0_0r
. 
. **1     Bran cereal (e.g. All Bran, Branflakes)
. **2     Biscuit cereal (e.g. Weetabix)
. **3     Oat cereal (e.g. Ready Brek, porridge)
. **4     Muesli
. **5     Other (e.g. Cornflakes, Frosties)
. 
. capture drop wholegrain_bread
{txt}
{com}. gen wholegrain_bread=.
{txt}(502,389 missing values generated)

{com}. replace wholegrain_bread=n_1438_0_0r if n_1448_0_0r==3
{txt}(269,438 real changes made)

{com}. replace wholegrain_bread=0 if n_1448_0_0r~=3 & n_1438_0_0r~=.
{txt}(222,162 real changes made)

{com}. 
. capture drop wholegrain_bread_day
{txt}
{com}. gen wholegrain_bread_day=.
{txt}(502,389 missing values generated)

{com}. replace wholegrain_bread_day=wholegrain_bread/7 
{txt}(491,600 real changes made)

{com}. 
. capture drop wholegrain_cereal
{txt}
{com}. gen wholegrain_cereal=.
{txt}(502,389 missing values generated)

{com}. replace wholegrain_cereal=n_1458_0_0r if n_1448_0_0r==1 | n_1448_0_0r==2 | n_1448_0_0r==3 | n_1448_0_0r==4
{txt}(477,967 real changes made)

{com}. replace wholegrain_cereal=0 if n_1448_0_0r~=3 & n_1458_0_0r~=.
{txt}(195,871 real changes made)

{com}. 
. capture drop wholegrain_cereal_day
{txt}
{com}. gen wholegrain_cereal_day=.
{txt}(502,389 missing values generated)

{com}. replace wholegrain_cereal_day=wholegrain_cereal/7 
{txt}(499,303 real changes made)

{com}. 
. 
. capture drop wholegrain
{txt}
{com}. gen wholegrain=(wholegrain_bread_day+wholegrain_cereal_day)
{txt}(12,038 missing values generated)

{com}. 
. capture drop wholegrain_component3
{txt}
{com}. gen wholegrain_component3=.
{txt}(502,389 missing values generated)

{com}. replace wholegrain_component3=1 if wholegrain>=3 & wholegrain~=.
{txt}(79,636 real changes made)

{com}. replace wholegrain_component3=0 if wholegrain_component3~=1 & wholegrain~=.
{txt}(410,715 real changes made)

{com}. 
. //////////////FISH/SHELLFISH////////////////////////////////
> 
. **non-oily fish, times/week: n_1329_0_0r
. **oily fish, times/week: n_1339_0_0r
. 
. 
. **0     Never
. **1     Less than once a week
. **2     Once a week
. **3     2-4 times a week
. **4     5-6 times a week
. **5     Once or more daily
. 
. 
. capture drop fish
{txt}
{com}. gen fish=n_1329_0_0r+n_1339_0_0r
{txt}(5,750 missing values generated)

{com}. 
. capture drop fish_component4
{txt}
{com}. gen fish_component4=.
{txt}(502,389 missing values generated)

{com}. replace fish_component4=1 if fish>=3 & fish~=.
{txt}(367,768 real changes made)

{com}. replace fish_component4=0 if fish_component4~=1 & fish~=.
{txt}(128,871 real changes made)

{com}. 
. //////////////DAIRY PRODUCTS///////////////////////////////
> 
. 
. **Never eat eggs, dairy, weat, sugar: n_6144_0_0r
. **1     Eggs or foods containing eggs
. **2     Dairy products
. **3     Wheat products
. **4     Sugar or foods/drinks containing sugar
. **5     I eat all of the above
. 
. **Cheese intake: n_1408_0_0r**
. **0     Never
. **1     Less than once a week
. **2     Once a week
. **3     2-4 times a week
. **4     5-6 times a week
. **5     Once or more daily
. 
. **Milk type used: n_1418_0_0r
. **1     Full cream
. **2     Semi-skimmed
. **3     Skimmed
. **4     Soya
. **5     Other type of milk
. **6     Never/rarely have milk
. 
. 
. capture drop dairy_component5
{txt}
{com}. gen dairy_component5=.
{txt}(502,389 missing values generated)

{com}. replace dairy_component5=1 if n_6144_0_0r~=2 & n_1408_0_0r==5 & n_1418_0_0r~=6 |n_6144_0_1r~=2 & n_1408_0_0r==5 & n_1418_0_0r~=6 |n_6144_0_2r~=2 & n_1408_0_0r==5 & n_1418_0_0r~=6 | n_6144_0_3r~=2 & n_1408_0_0r==5 & n_1418_0_0r~=6
{txt}(16,893 real changes made)

{com}. replace dairy_component5=0 if dairy_component5~=1 & n_6144_0_0r~=. & n_1408_0_0r~=. & n_1418_0_0r~=.
{txt}(465,750 real changes made)

{com}. 
. /////////////VEGETABLE OILS//////////////////////////////
> 
. **Other types of non-butter spreads: n_2654_0_0r**
. 
. **4     Soft (tub) margarine
. **5     Hard (block) margarine
. **6     Olive oil based spread (eg: Bertolli)
. **7     Polyunsaturated/sunflower oil based spread (eg: Flora)
. **2     Flora Pro-Active or Benecol
. **8     Other low or reduced fat spread
. **9     Other type of spread/margarine
. 
. 
. capture drop vegoil_component6
{txt}
{com}. gen vegoil_component6=.
{txt}(502,389 missing values generated)

{com}. replace vegoil_component6=1 if n_2654_0_0r==6 | n_2654_0_0r==7 
{txt}(149,795 real changes made)

{com}. replace vegoil_component6=0 if vegoil_component6~=1 
{txt}(352,594 real changes made)

{com}. 
. 
. ////////////REFINED GRAINS, STARCHES, ADDED SUGARS///////
> 
. **Bread intake, slices/week: n_1438_0_0r
. **Type of bread: n_1448_0_0r    
. 
. **1 White
. **2     Brown
. **3     wholemeal or wholegrain
. **4     Other type of bread
. 
. 
. **Cereal intake, bowls/week: n_1458_0_0r
. 
. 
. **Cereal type:n_1448_0_0r
. 
. **1     Bran cereal (e.g. All Bran, Branflakes)
. **2     Biscuit cereal (e.g. Weetabix)
. **3     Oat cereal (e.g. Ready Brek, porridge)
. **4     Muesli
. **5     Other (e.g. Cornflakes, Frosties)
. 
. capture drop nonwholegrain_bread
{txt}
{com}. gen nonwholegrain_bread=.
{txt}(502,389 missing values generated)

{com}. replace nonwholegrain_bread=n_1438_0_0r if n_1448_0_0r~=3 & n_1448_0_0r~=.
{txt}(204,541 real changes made)

{com}. replace nonwholegrain_bread=0 if n_1448_0_0r==3 & n_1438_0_0r~=.
{txt}(269,438 real changes made)

{com}. 
. capture drop nonwholegrain_bread_day
{txt}
{com}. gen nonwholegrain_bread_day=.
{txt}(502,389 missing values generated)

{com}. replace nonwholegrain_bread_day=nonwholegrain_bread/7 
{txt}(473,979 real changes made)

{com}. 
. capture drop nonwholegrain_cereal
{txt}
{com}. gen nonwholegrain_cereal=.
{txt}(502,389 missing values generated)

{com}. replace nonwholegrain_cereal=n_1458_0_0r if n_1448_0_0r==5 
{txt}(0 real changes made)

{com}. replace nonwholegrain_cereal=0 if n_1448_0_0r~=5 & n_1458_0_0r~=.
{txt}(499,303 real changes made)

{com}. 
. capture drop nonwholegrain_cereal_day
{txt}
{com}. gen nonwholegrain_cereal_day=.
{txt}(502,389 missing values generated)

{com}. replace nonwholegrain_cereal_day=nonwholegrain_cereal/7 
{txt}(499,303 real changes made)

{com}. 
. 
. capture drop nonwholegrain
{txt}
{com}. gen nonwholegrain=nonwholegrain_bread_day+nonwholegrain_cereal_day
{txt}(29,580 missing values generated)

{com}. 
. capture drop nonwholegrain_component7
{txt}
{com}. gen nonwholegrain_component7=.
{txt}(502,389 missing values generated)

{com}. replace nonwholegrain_component7=1 if nonwholegrain<1.5 & nonwholegrain~=.
{txt}(369,473 real changes made)

{com}. replace nonwholegrain_component7=0 if nonwholegrain_component7~=1 & nonwholegrain~=.
{txt}(103,336 real changes made)

{com}. 
. 
. 
. ////////////PROCESSED MEATS/////////////////////////////
> 
. 
. 
. **0     Never
. **1     Less than once a week
. **2     Once a week
. **3     2-4 times a week
. **4     5-6 times a week
. **5     Once or more daily
. 
. capture drop processed_meat
{txt}
{com}. gen processed_meat=n_1349_0_0r
{txt}(2,231 missing values generated)

{com}. 
. capture drop processed_meat_component8
{txt}
{com}. gen processed_meat_component8=.
{txt}(502,389 missing values generated)

{com}. replace processed_meat_component8=1 if processed_meat==0 | processed_meat==1 | processed_meat==2
{txt}(345,090 real changes made)

{com}. replace processed_meat_component8=0 if processed_meat==3 | processed_meat==4 | processed_meat==5
{txt}(155,068 real changes made)

{com}. 
. 
. 
. ///////////UNPROCESSED RED MEATS/////////////////////////////
> 
. **Poultry: n_1359_0_0r: White meat
. **Lamb/mutton: n_1379_0_0r: Red meat
. **Beef:n_1369_0_0r: Red meat
. **Pork:n_1389_0_0r: Red meat
. 
. 
. **0     Never
. **1     Less than once a week
. **2     Once a week
. **3     2-4 times a week
. **4     5-6 times a week
. **5     Once or more daily
. 
. capture drop unprocessed_meats
{txt}
{com}. gen unprocessed_meats=(n_1369_0_0r+n_1379_0_0r+n_1389_0_0r)
{txt}(7,000 missing values generated)

{com}. 
. 
. capture drop unprocessed_meats_component9
{txt}
{com}. gen unprocessed_meats_component9=.
{txt}(502,389 missing values generated)

{com}. replace unprocessed_meats_component9=1 if unprocessed_meats<3 & unprocessed_meats~=.
{txt}(91,413 real changes made)

{com}. replace unprocessed_meats_component9=0 if unprocessed_meats_component9~=1 & unprocessed_meats~=.
{txt}(403,976 real changes made)

{com}. 
. 
. ////////////INDUSTRIAL TRANS FAT////////////////////////////
> 
. **Type of spread: n_1428_0_0r
. 
. **1     Butter/spreadable butter
. **3     Other type of spread/margarine
. **0     Never/rarely use spread
. **2     Flora Pro-Active/Benecol
. 
. **Non-butter spread type details: n_2654_0_0r
. 
. **4     Soft (tub) margarine
. **5     Hard (block) margarine
. **6     Olive oil based spread (eg: Bertolli)
. **7     Polyunsaturated/sunflower oil based spread (eg: Flora)
. **2     Flora Pro-Active or Benecol
. **8     Other low or reduced fat spread
. **9     Other type of spread/margarine
. 
. capture drop transfat_component10
{txt}
{com}. gen transfat_component10=.
{txt}(502,389 missing values generated)

{com}. replace transfat_component10=1 if n_1428_0_0r==0
{txt}(53,937 real changes made)

{com}. replace transfat_component10=0 if transfat_component10~=1 & n_1428_0_0r~=.
{txt}(442,648 real changes made)

{com}. 
. 
. ////////////SUGAR SWEETENDED BEVERAGES/////////////////////
> 
. **Never eat eggs, dairy, wheat, sugar: n_6144_0_0r
. **1     Eggs or foods containing eggs
. **2     Dairy products
. **3     Wheat products
. **4     Sugar or foods/drinks containing sugar
. **5     I eat all of the above
. 
. capture drop sugar_bev_component11
{txt}
{com}. gen sugar_bev_component11=.
{txt}(502,389 missing values generated)

{com}. replace sugar_bev_component11=0 if n_6144_0_0r==4 & n_6144_0_0r~=. | n_6144_0_0r==4 & n_6144_0_1r~=. | n_6144_0_0r==4 & n_6144_0_2r~=. | n_6144_0_0r==4 & n_6144_0_3r~=.
{txt}(82,968 real changes made)

{com}. replace sugar_bev_component11=1 if sugar_bev_component11~=0 & n_6144_0_0r~=.
{txt}(412,983 real changes made)

{com}. 
. 
. ////////////SODIUM////////////////////////////////////////
> 
. **Salt added to food: n_1478_0_0r
. **1     Never/rarely
. **2     Sometimes
. **3     Usually
. **4     Always
. 
. 
. capture drop sodium_component12
{txt}
{com}. gen sodium_component12=.
{txt}(502,389 missing values generated)

{com}. replace sodium_component12=1 if n_1478_0_0r==1 | n_1478_0_0r==2
{txt}(418,458 real changes made)

{com}. replace sodium_component12=0 if sodium_component12~=1 & n_1478_0_0r~=.
{txt}(82,804 real changes made)

{com}. 
. //////////HDI_TOTALSCORE//////////////////
> 
. capture drop rowmissHDI
{txt}
{com}. egen rowmissHDI=rowmiss(allfruits_component1 allvegs_component2 wholegrain_component3 fish_component4 dairy_component5 vegoil_component6 nonwholegrain_component7 processed_meat_component8 unprocessed_meats_component9 transfat_component10 sugar_bev_component11 sodium_component12)
{txt}
{com}. 
. tab rowmissHDI

 {txt}rowmissHDI {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    444,245       88.43       88.43
{txt}          1 {c |}{res}     38,523        7.67       96.09
{txt}          2 {c |}{res}      9,545        1.90       97.99
{txt}          3 {c |}{res}      2,730        0.54       98.54
{txt}          4 {c |}{res}      1,422        0.28       98.82
{txt}          5 {c |}{res}      4,101        0.82       99.64
{txt}          6 {c |}{res}        420        0.08       99.72
{txt}          7 {c |}{res}        203        0.04       99.76
{txt}          8 {c |}{res}         95        0.02       99.78
{txt}          9 {c |}{res}         57        0.01       99.79
{txt}         10 {c |}{res}         17        0.00       99.79
{txt}         11 {c |}{res}      1,031        0.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. 
. capture drop HDI_TOTALSCORE
{txt}
{com}. egen HDI_TOTALSCORE=rowmean(allfruits_component1 allvegs_component2 wholegrain_component3 fish_component4 dairy_component5 vegoil_component6 nonwholegrain_component7 processed_meat_component8 unprocessed_meats_component9 transfat_component10 sugar_bev_component11 sodium_component12) if rowmissHDI<=6
{txt}(1,403 missing values generated)

{com}. 
. replace HDI_TOTALSCORE=HDI_TOTALSCORE*12 
{txt}(500,745 real changes made)

{com}. 
. ////////////////////
> 
. ///////////////////RECODING FOR VARIATION IN DIET///////////////
> 
. 
. **Coding        Meaning
. **1     Never/rarely
. **2     Sometimes
. **3     Often
. **-1    Do not know
. **-3    Prefer not to answer
. 
. capture drop DIET_VARIATION
{txt}
{com}. gen DIET_VARIATION=.
{txt}(502,389 missing values generated)

{com}. replace DIET_VARIATION=1 if n_1548_0_0==1
{txt}(170,396 real changes made)

{com}. replace DIET_VARIATION=2 if n_1548_0_0==2
{txt}(284,895 real changes made)

{com}. replace DIET_VARIATION=3 if n_1548_0_0==3
{txt}(39,907 real changes made)

{com}. replace DIET_VARIATION=. if n_1548_0_0==-1
{txt}(0 real changes made)

{com}. replace DIET_VARIATION=. if n_1548_0_0==-3
{txt}(0 real changes made)

{com}. 
. 
. ////////////DIET z-score///////////////
> 
. capture drop zHDI_TOTALSCORE
{txt}
{com}. egen zHDI_TOTALSCORE=std(HDI_TOTALSCORE)
{txt}(1,403 missing values generated)

{com}. 
. capture drop zDIET_VARIATION
{txt}
{com}. egen zDIET_VARIATION=std(DIET_VARIATION)
{txt}(7,191 missing values generated)

{com}. 
. 
. capture drop DIET
{txt}
{com}. gen DIET=zHDI_TOTALSCORE
{txt}(1,403 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 5: GENERATE LIFESTYLE VARIABLES: NUTR//
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_30890_0_0 n_30070_0_0
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\NUTR_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\NUTR_UKB.dta{rm}
saved
{p_end}

{com}. 
. label var n_30890_0_0 "Vitamin D"
{txt}
{com}. label var n_30070_0_0 "Red blood cell (erythrocyte) distribution width"
{txt}
{com}. 
. 
. pwcorr n_30890_0_0 n_30070_0_0, sig

             {txt}{c |} n_3089~0 n_3007~0
{hline 13}{c +}{hline 18}
 n_30890_0_0 {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
 n_30070_0_0 {c |} {res} -0.0455   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}

{com}. 
. capture drop vitamind
{txt}
{com}. gen vitamind= n_30890_0_0 
{txt}(54,143 missing values generated)

{com}. 
. 
. capture drop rdw
{txt}
{com}. gen rdw=n_30070_0_0 
{txt}(24,329 missing values generated)

{com}. 
. capture drop zvitamind
{txt}
{com}. egen zvitamind=std(vitamind)
{txt}(54,143 missing values generated)

{com}. 
. capture drop zrdw
{txt}
{com}. egen zrdw=std(rdw)
{txt}(24,329 missing values generated)

{com}. 
. capture drop zrdwinv
{txt}
{com}. gen zrdwinv=zrdw*-1
{txt}(24,329 missing values generated)

{com}. 
. capture drop rowmissNUTR
{txt}
{com}. egen rowmissNUTR=rowmiss(zvitamind zrdwinv)
{txt}
{com}. 
. tab rowmissNUTR

{txt}rowmissNUTR {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    436,793       86.94       86.94
{txt}          1 {c |}{res}     52,720       10.49       97.44
{txt}          2 {c |}{res}     12,876        2.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop NUTR
{txt}
{com}. egen NUTR=rmean(zvitamind zrdwinv) if rowmissNUTR<=1
{txt}(12,876 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\NUTR_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 6: GENERATE LIFESTYLE VARIABLES: SS//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_1031_0_0 n_6160_0_* n_2110_0_0
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //////////SOCIAL SUPPORT VARIABLE 1/////
> 
. **Frequency of friend/family visits**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=1031
. 
. **WP11 How often do you visit friends or family
. **or have them visit you?
. **SELECT one of 9 from
. **1 : Almost daily
. **2 : 2-4 times a week
. **3 : About once a week
. **4 : About once a month
. **5 : Once every few months
. **6 : Never or almost never
. **7 : No friends/family
. **outside household
. **-1 : Do not know
. **-3 : Prefer not to answer
. **Goto WP12 If this varies, please give an average of
. **how often you visit or have had visits in
. **the last year. Include meeting with
. **friends or family in environments
. **outside of the home such as in the park,
. **at a sports field, at a restaurant or pub.
. 
. capture drop SS_friendsfamily
{txt}
{com}. gen SS_friendsfamily=.
{txt}(502,389 missing values generated)

{com}. replace SS_friendsfamily=n_1031_0_0
{txt}(497,735 real changes made)

{com}. replace SS_friendsfamily=. if n_1031_0_0==-1
{txt}(1,715 real changes made, 1,715 to missing)

{com}. replace SS_friendsfamily=. if n_1031_0_0==-3
{txt}(1,563 real changes made, 1,563 to missing)

{com}. recode SS_friendsfamily (1=7) (2=6) (3=5) (4=4) (5=3) (6=2) (7=1)
{txt}(427982 changes made to {bf:SS_friendsfamily})

{com}. 
. 
. ///SOCIAL SUPPORT VARIABLE 2/////
> **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=6160
. 
. **WP12 Which of the following do you attend once
. **a week or more often?
. **(You can select more than one)
. **TOGGLE of 7 choices
. **1 : Sports club or gym
. **2 : Pub or social club
. **3 : Religious group
. **4 : Adult education class
. **5 : Other group activity
. **-7 : None of the above
. **-3 : Prefer not to answer
. **Require 1
. **choices
. **-7 : is exclusive
. **-3 : is exclusive
. **Goto WP12A If this varies, please think about
. **activities in the last year.
. 
. 
. capture drop SS_leisuresocial1
{txt}
{com}. gen SS_leisuresocial1=.
{txt}(502,389 missing values generated)

{com}. replace SS_leisuresocial1=1 if n_6160_0_0~=. & n_6160_0_0~=-7 & n_6160_0_0~=-3
{txt}(347,464 real changes made)

{com}. replace SS_leisuresocial1=0 if SS_leisuresocial1~=1 & n_6160_0_0~=-7 & n_6160_0_0~=-3
{txt}(884 real changes made)

{com}. 
. 
. capture drop SS_leisuresocial2
{txt}
{com}. gen SS_leisuresocial2=.
{txt}(502,389 missing values generated)

{com}. replace SS_leisuresocial2=1 if n_6160_0_1~=. & n_6160_0_1~=-7 & n_6160_0_1~=-3
{txt}(128,849 real changes made)

{com}. replace SS_leisuresocial2=0 if SS_leisuresocial2~=1 & n_6160_0_1~=-7 & n_6160_0_1~=-3
{txt}(373,540 real changes made)

{com}. 
. 
. capture drop SS_leisuresocial3
{txt}
{com}. gen SS_leisuresocial3=.
{txt}(502,389 missing values generated)

{com}. replace SS_leisuresocial3=1 if n_6160_0_2~=. & n_6160_0_2~=-7 & n_6160_0_2~=-3
{txt}(24,425 real changes made)

{com}. replace SS_leisuresocial3=0 if SS_leisuresocial3~=1 & n_6160_0_2~=-7 & n_6160_0_2~=-3
{txt}(477,964 real changes made)

{com}. 
. 
. capture drop SS_leisuresocial4
{txt}
{com}. gen SS_leisuresocial4=.
{txt}(502,389 missing values generated)

{com}. replace SS_leisuresocial4=1 if n_6160_0_3~=. & n_6160_0_3~=-7 & n_6160_0_3~=-3
{txt}(2,359 real changes made)

{com}. replace SS_leisuresocial4=0 if SS_leisuresocial4~=1 & n_6160_0_3~=-7 & n_6160_0_3~=-3
{txt}(500,030 real changes made)

{com}. 
. 
. capture drop SS_leisuresocial5
{txt}
{com}. gen SS_leisuresocial5=.
{txt}(502,389 missing values generated)

{com}. replace SS_leisuresocial5=1 if n_6160_0_4~=. & n_6160_0_4~=-7 & n_6160_0_4~=-3
{txt}(128 real changes made)

{com}. replace SS_leisuresocial5=0 if SS_leisuresocial5~=1 & n_6160_0_4~=-7 & n_6160_0_4~=-3
{txt}(502,261 real changes made)

{com}. 
. capture drop rowmissSS1
{txt}
{com}. egen rowmissSS1=rowmiss(SS_leisuresocial1 SS_leisuresocial2 SS_leisuresocial3 SS_leisuresocial4 SS_leisuresocial5)
{txt}
{com}. 
. tab rowmissSS1

 {txt}rowmissSS1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    348,348       69.34       69.34
{txt}          1 {c |}{res}    154,041       30.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop SS_leisuresocial
{txt}
{com}. egen SS_leisuresocial=rmean(SS_leisuresocial1 SS_leisuresocial2 SS_leisuresocial3 SS_leisuresocial4 SS_leisuresocial5) if rowmissSS1<=5
{txt}
{com}. 
. replace SS_leisuresocial=SS_leisuresocial*5
{txt}(347,464 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. **SOCIAL SUPPORT VARIABLE 3**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=2110
. 
. **E1 How often are you able to confide in
. **someone close to you?
. **SELECT one of 8 from
. **5 : Almost daily
. **4 : 2-4 times a week
. **3 : About once a week
. **2 : About once a month
. **1 : Once every few months
. **0 : Never or almost never
. **-1 : Do not know
. **-3 : Prefer not to answer
. 
. 
. capture drop SS_abilityconfide
{txt}
{com}. gen SS_abilityconfide=.
{txt}(502,389 missing values generated)

{com}. replace SS_abilityconfide=n_2110_0_0
{txt}(501,475 real changes made)

{com}. replace SS_abilityconfide=. if n_2110_0_0==-1 | n_2110_0_0==-3
{txt}(17,959 real changes made, 17,959 to missing)

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB.dta{rm}
saved
{p_end}

{com}. 
. capture drop zSS_friendsfamily
{txt}
{com}. egen zSS_friendsfamily=std(SS_friendsfamily)
{txt}(7,932 missing values generated)

{com}. 
. capture drop zSS_leisuresocial
{txt}
{com}. egen zSS_leisuresocial=std(SS_leisuresocial)
{txt}
{com}. 
. capture drop zSS_abilityconfide
{txt}
{com}. egen zSS_abilityconfide=std(SS_abilityconfide)
{txt}(18,873 missing values generated)

{com}. 
. 
. capture drop rowmissSS
{txt}
{com}. egen rowmissSS=rowmiss(zSS_friendsfamily zSS_leisuresocial zSS_abilityconfide)
{txt}
{com}. 
. tab rowmissSS

  {txt}rowmissSS {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    477,633       95.07       95.07
{txt}          1 {c |}{res}     22,707        4.52       99.59
{txt}          2 {c |}{res}      2,049        0.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. 
. 
. capture drop SS
{txt}
{com}. egen SS=rmean(zSS_friendsfamily zSS_leisuresocial zSS_abilityconfide) if rowmissSS<=1
{txt}(2,049 missing values generated)

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB.dta{rm}
saved
{p_end}

{com}. 
. //STEP 7: GENERATE HEALTH VARIABLES//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_135_0_0 n_134_0_0 n_2178_0_0 n_21001_0_0 n_21001_0_0 n_48_0_0 n_49_0_0 n_30600_0_0 n_30710_0_0 n_30690_0_0 n_30760_0_0 n_30750_0_0 n_102_0_0 n_4080_0_0 n_4079_0_0 n_31_0_0 n_2443_0_0 n_1160_0_0
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB.dta{rm}
saved
{p_end}

{com}. 
. capture drop sex
{txt}
{com}. gen sex=n_31_0_0 
{txt}
{com}. recode sex 0=2 1=1
{txt}(273312 changes made to {bf:sex})

{com}. 
. 
. ********************CO-MORBIDITY INDEX**********
. 
. **NUMBER OF SELF-REPORTED NON-CANCER ILLNESSES:***
. 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=135
. 
. capture drop comorbid_noncancer
{txt}
{com}. gen comorbid_noncancer=.
{txt}(502,389 missing values generated)

{com}. replace comorbid_noncancer=n_135_0_0
{txt}(501,526 real changes made)

{com}. 
. 
. ***NUMBER OF SELF-REPORTED CANCERS*****
. 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=134
. 
. capture drop comorbid_cancer
{txt}
{com}. gen comorbid_cancer=.
{txt}(502,389 missing values generated)

{com}. replace comorbid_cancer=n_134_0_0
{txt}(501,526 real changes made)

{com}. 
. **NUMBER OF CO-MORBIDITIES**
. 
. capture drop comorbid
{txt}
{com}. gen comorbid=comorbid_noncancer+comorbid_cancer
{txt}(863 missing values generated)

{com}. 
. 
. ***********SELF-RATED HEALTH***************
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=2178
. 
. capture drop srh
{txt}
{com}. gen srh=n_2178_0_0
{txt}(920 missing values generated)

{com}. 
. capture drop srhbr
{txt}
{com}. gen srhbr=.
{txt}(502,389 missing values generated)

{com}. replace srhbr=srh if srh~=-1 & srh~=-3
{txt}(498,901 real changes made)

{com}. 
. 
. 
. ***********BODY MASS INDEX****************
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=23104
. 
. capture drop bmi
{txt}
{com}. gen bmi=n_21001_0_0 
{txt}(3,107 missing values generated)

{com}. label var bmi "body mass index kg/m^2" //missing values exist - consider imputation
{txt}
{com}. 
. 
. 
. 
. ***********ALLOSTATIC LOAD****************
. 
. ***WAIST TO HIP RATIO***
. **https://biobank.ctsu.ox.ac.uk/crystal/search.cgi?wot=0&srch=waist+circumference&sta0=on&sta1=on&sta2=on&sta3=on&str0=on&str3=on&fit0=on&fit10=on&fit20=on&fit30=on&fvt11=on&fvt21=on&fvt22=on&fvt31=on&fvt41=on&fvt51=on&fvt61=on&fvt101=on&yfirst=2000&ylast=2021
. 
. su n_48_0_0 n_49_0_0, det

                     {txt}Waist circumference
{hline 61}
      Percentiles      Smallest
 1%    {res}       64             20
{txt} 5%    {res}       70             20
{txt}10%    {res}       73             20       {txt}Obs         {res}    500,226
{txt}25%    {res}       80             32       {txt}Sum of wgt. {res}    500,226

{txt}50%    {res}       90                      {txt}Mean          {res} 90.31136
                        {txt}Largest       Std. dev.     {res} 13.48567
{txt}75%    {res}       99            175
{txt}90%    {res}      108            176       {txt}Variance      {res} 181.8632
{txt}95%    {res}      113            182       {txt}Skewness      {res} .4305904
{txt}99%    {res}      126            197       {txt}Kurtosis      {res} 3.333879

                      {txt}Hip circumference
{hline 61}
      Percentiles      Smallest
 1%    {res}       86             30
{txt} 5%    {res}       91             30
{txt}10%    {res}       93             30       {txt}Obs         {res}    500,167
{txt}25%    {res}       97             30       {txt}Sum of wgt. {res}    500,167

{txt}50%    {res}      102                      {txt}Mean          {res} 103.4017
                        {txt}Largest       Std. dev.     {res} 9.249127
{txt}75%    {res}      108            179
{txt}90%    {res}      115            183       {txt}Variance      {res} 85.54634
{txt}95%    {res}      120            186       {txt}Skewness      {res} 1.106731
{txt}99%    {res}      133            195       {txt}Kurtosis      {res} 6.114941
{txt}
{com}. 
. capture drop waist
{txt}
{com}. gen waist=n_48_0_0
{txt}(2,163 missing values generated)

{com}. label var waist "waist circumference cm" //missing values exist - consider imputation
{txt}
{com}. 
. capture drop hip
{txt}
{com}. gen hip=n_49_0_0
{txt}(2,222 missing values generated)

{com}. label var hip "hip circumference cm" //missing values exist - consider imputation
{txt}
{com}. 
. capture drop waisthipratio
{txt}
{com}. gen waisthipratio=waist/hip
{txt}(2,268 missing values generated)

{com}. label var waisthipratio "waist-hip ratio" //missing values exist - consider imputation
{txt}
{com}. 
. capture drop whr_high
{txt}
{com}. gen whr_high=.
{txt}(502,389 missing values generated)

{com}. replace whr_high=1 if waisthipratio>0.90 & waisthipratio~=. & sex==1 | waisthipratio>0.85 & waisthipratio~=. & sex==2
{txt}(246,494 real changes made)

{com}. replace whr_high=0 if whr_high~=1 & waisthipratio~=. 
{txt}(253,627 real changes made)

{com}. 
. label var whr_high "elevated, sex-specific waist-hip ratio: 0.90 for men, 0.85 for women"
{txt}
{com}. 
. tab whr_high 

  {txt}elevated, {c |}
sex-specifi {c |}
c waist-hip {c |}
ratio: 0.90 {c |}
   for men, {c |}
   0.85 for {c |}
      women {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    253,627       50.71       50.71
{txt}          1 {c |}{res}    246,494       49.29      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    500,121      100.00
{txt}
{com}. 
. **LOW SERUM ALBUMIN, <38 g/L**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30600**
. 
. su n_30600_0_0, det

                           {txt}Albumin
{hline 61}
      Percentiles      Smallest
 1%    {res}    39.01          17.38
{txt} 5%    {res}    40.98          18.87
{txt}10%    {res}    41.93          20.65       {txt}Obs         {res}    429,978
{txt}25%    {res}    43.49          20.67       {txt}Sum of wgt. {res}    429,978

{txt}50%    {res}     45.2                      {txt}Mean          {res} 45.21004
                        {txt}Largest       Std. dev.     {res}  2.62908
{txt}75%    {res}    46.92          59.07
{txt}90%    {res}    48.53           59.2       {txt}Variance      {res} 6.912061
{txt}95%    {res}    49.52          59.46       {txt}Skewness      {res}-.0358171
{txt}99%    {res}    51.51           59.8       {txt}Kurtosis      {res} 3.712564
{txt}
{com}. 
. capture drop albumin_low
{txt}
{com}. gen albumin_low=.
{txt}(502,389 missing values generated)

{com}. replace albumin_low=1 if n_30600_0_0<38 & n_30600_0_0~=.
{txt}(1,967 real changes made)

{com}. replace albumin_low=0 if albumin_low~=1 & n_30600_0_0~=. 
{txt}(428,011 real changes made)

{com}. label var albumin_low "low serum albumin, <38 g/l"
{txt}
{com}. 
. tab albumin_low

  {txt}low serum {c |}
   albumin, {c |}
    <38 g/l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    428,011       99.54       99.54
{txt}          1 {c |}{res}      1,967        0.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    429,978      100.00
{txt}
{com}. 
. **HIGH CRP, >=3 mg/dL**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30710
. 
. su n_30710_0_0,det

                     {txt}C-reactive protein
{hline 61}
      Percentiles      Smallest
 1%    {res}      .16            .08
{txt} 5%    {res}      .26            .08
{txt}10%    {res}      .36            .08       {txt}Obs         {res}    468,460
{txt}25%    {res}      .66            .08       {txt}Sum of wgt. {res}    468,460

{txt}50%    {res}     1.33                      {txt}Mean          {res} 2.598718
                        {txt}Largest       Std. dev.     {res} 4.360806
{txt}75%    {res}     2.76          79.44
{txt}90%    {res}     5.54          79.49       {txt}Variance      {res} 19.01663
{txt}95%    {res}     8.86          79.95       {txt}Skewness      {res}  6.28943
{txt}99%    {res}    21.22          79.96       {txt}Kurtosis      {res} 64.39774
{txt}
{com}. 
. capture drop crp_high
{txt}
{com}. gen crp_high=. 
{txt}(502,389 missing values generated)

{com}. replace crp_high=1 if n_30710_0_0>=3 & n_30710_0_0~=.
{txt}(106,720 real changes made)

{com}. replace crp_high=0 if crp_high~=1 & n_30710_0_0~=. 
{txt}(361,740 real changes made)

{com}. label var crp_high "elevated C-reactive protein, >=3 g/l"
{txt}
{com}. 
. tab crp_high

   {txt}elevated {c |}
 C-reactive {c |}
   protein, {c |}
    >=3 g/l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    361,740       77.22       77.22
{txt}          1 {c |}{res}    106,720       22.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    468,460      100.00
{txt}
{com}. 
. 
. **ELEVATED TC, >=240 mg/dL: divide by 38.67 to get mmol/L: >=6.21 mmol/L
. 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30690,det
. **https://www.omnicalculator.com/health/cholesterol-units
. 
. su n_30690_0_0, det

                         {txt}Cholesterol
{hline 61}
      Percentiles      Smallest
 1%    {res}    3.223           .601
{txt} 5%    {res}    3.888          1.432
{txt}10%    {res}    4.263          1.498       {txt}Obs         {res}    469,481
{txt}25%    {res}    4.906          1.551       {txt}Sum of wgt. {res}    469,481

{txt}50%    {res}     5.65                      {txt}Mean          {res} 5.692449
                        {txt}Largest       Std. dev.     {res} 1.144948
{txt}75%    {res}    6.424          13.53
{txt}90%    {res}    7.165         13.615       {txt}Variance      {res} 1.310906
{txt}95%    {res}     7.64         13.719       {txt}Skewness      {res} .2856572
{txt}99%    {res}    8.606          15.46       {txt}Kurtosis      {res} 3.338082
{txt}
{com}. 
. capture drop tc_high
{txt}
{com}. gen tc_high=.
{txt}(502,389 missing values generated)

{com}. replace tc_high=1 if n_30690_0_0>=6.21 & n_30690_0_0~=. 
{txt}(146,340 real changes made)

{com}. replace tc_high=0 if tc_high~=1 & n_30690_0_0~=. 
{txt}(323,141 real changes made)

{com}. label var tc_high "elevated total cholesterol, >=6.21 mmol/L"
{txt}
{com}. 
. 
. tab tc_high

   {txt}elevated {c |}
      total {c |}
cholesterol {c |}
   , >=6.21 {c |}
     mmol/L {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    323,141       68.83       68.83
{txt}          1 {c |}{res}    146,340       31.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    469,481      100.00
{txt}
{com}. 
. **LOW HDL-C, <40 mg/dL: divide by 38.67 to get mmol/L: <1.034 mmol/L**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30760
. **https://www.omnicalculator.com/health/cholesterol-units
. 
. su n_30760_0_0, det

                       {txt}HDL cholesterol
{hline 61}
      Percentiles      Smallest
 1%    {res}     .775           .219
{txt} 5%    {res}     .917           .226
{txt}10%    {res}    1.003           .228       {txt}Obs         {res}    429,774
{txt}25%    {res}     1.17           .252       {txt}Sum of wgt. {res}    429,774

{txt}50%    {res}    1.398                      {txt}Mean          {res} 1.448002
                        {txt}Largest       Std. dev.     {res} .3823061
{txt}75%    {res}    1.674          4.107
{txt}90%    {res}     1.96          4.129       {txt}Variance      {res}  .146158
{txt}95%    {res}    2.147          4.186       {txt}Skewness      {res} .7756026
{txt}99%    {res}    2.539          4.401       {txt}Kurtosis      {res} 3.958405
{txt}
{com}. 
. 
. capture drop hdl_low
{txt}
{com}. gen hdl_low=.
{txt}(502,389 missing values generated)

{com}. replace hdl_low=1 if n_30760_0_0<1.034 & n_30760_0_0~=.
{txt}(52,644 real changes made)

{com}. replace hdl_low=0 if hdl_low~=1 & n_30760_0_0~=.
{txt}(377,130 real changes made)

{com}. label var hdl_low "low HDL-C, <1.034 mmol/L"
{txt}
{com}. 
. tab hdl_low

 {txt}low HDL-C, {c |}
     <1.034 {c |}
     mmol/L {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    377,130       87.75       87.75
{txt}          1 {c |}{res}     52,644       12.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    429,774      100.00
{txt}
{com}. 
. 
. 
. **Glycated hemoglobin, % change to mmol/mol:  cutoff in % is 6.4% --> 46 mmol/mol
. **https://www.hba1cnet.com/hba1c-calculator/
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30750
. 
. su n_30750_0_0,det

                {txt}Glycated haemoglobin (HbA1c)
{hline 61}
      Percentiles      Smallest
 1%    {res}       26             15
{txt} 5%    {res}     29.1           15.3
{txt}10%    {res}     30.5           15.3       {txt}Obs         {res}    466,394
{txt}25%    {res}     32.8           15.3       {txt}Sum of wgt. {res}    466,394

{txt}50%    {res}     35.2                      {txt}Mean          {res} 36.13129
                        {txt}Largest       Std. dev.     {res} 6.775722
{txt}75%    {res}     37.9          265.6
{txt}90%    {res}     41.1          266.3       {txt}Variance      {res}  45.9104
{txt}95%    {res}     45.1          296.1       {txt}Skewness      {res} 4.895931
{txt}99%    {res}     64.7          515.2       {txt}Kurtosis      {res} 95.77651
{txt}
{com}. 
. capture drop ghp_high
{txt}
{com}. gen ghp_high=.
{txt}(502,389 missing values generated)

{com}. replace ghp_high=1 if n_30750_0_0>=46 & n_30750_0_0~=. 
{txt}(21,315 real changes made)

{com}. replace ghp_high=0 if ghp_high~=1 & n_30750_0_0~=. 
{txt}(445,079 real changes made)

{com}. label var ghp_high "High glycated hemoglobin A1c, >=46 mmol/mol"
{txt}
{com}. 
. 
. tab ghp_high

       {txt}High {c |}
   glycated {c |}
 hemoglobin {c |}
  A1c, >=46 {c |}
   mmol/mol {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    445,079       95.43       95.43
{txt}          1 {c |}{res}     21,315        4.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    466,394      100.00
{txt}
{com}. 
. 
. **PULSE RATE, automated reading, beats/min:
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=102
. 
. 
. su n_102_0_0,det

                {txt}Pulse rate, automated reading
{hline 61}
      Percentiles      Smallest
 1%    {res}       47             30
{txt} 5%    {res}       53             30
{txt}10%    {res}       56             30       {txt}Obs         {res}    467,962
{txt}25%    {res}       62             30       {txt}Sum of wgt. {res}    467,962

{txt}50%    {res}       68                      {txt}Mean          {res} 69.59784
                        {txt}Largest       Std. dev.     {res} 11.66037
{txt}75%    {res}       76            169
{txt}90%    {res}       85            172       {txt}Variance      {res} 135.9642
{txt}95%    {res}       90            174       {txt}Skewness      {res} .6441475
{txt}99%    {res}      102            174       {txt}Kurtosis      {res} 4.065121
{txt}
{com}. 
. capture drop rhr_high
{txt}
{com}. gen rhr_high=.
{txt}(502,389 missing values generated)

{com}. replace rhr_high=1 if n_102_0_0>=90 & n_102_0_0~=.
{txt}(26,500 real changes made)

{com}. replace rhr_high=0 if rhr_high~=1 & n_102_0_0~=.
{txt}(441,462 real changes made)

{com}. label var rhr_high "Resting pulse rate, >=90 beats/min"
{txt}
{com}. 
. tab rhr_high

    {txt}Resting {c |}
pulse rate, {c |}
       >=90 {c |}
  beats/min {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    441,462       94.34       94.34
{txt}          1 {c |}{res}     26,500        5.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    467,962      100.00
{txt}
{com}. 
. **Blood pressure, automated reading:
. 
. **Systolic blood pressure, automated reading, mm Hg, >=140 mm Hg: 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=4080
. 
. su n_4080_0_0,det

         {txt}Systolic blood pressure, automated reading
{hline 61}
      Percentiles      Smallest
 1%    {res}      101             62
{txt} 5%    {res}      110             68
{txt}10%    {res}      116             69       {txt}Obs         {res}    467,949
{txt}25%    {res}      126             69       {txt}Sum of wgt. {res}    467,949

{txt}50%    {res}      138                      {txt}Mean          {res} 139.7411
                        {txt}Largest       Std. dev.     {res} 19.69681
{txt}75%    {res}      152            254
{txt}90%    {res}      166            260       {txt}Variance      {res} 387.9642
{txt}95%    {res}      175            264       {txt}Skewness      {res} .4963807
{txt}99%    {res}      192            268       {txt}Kurtosis      {res} 3.396021
{txt}
{com}. 
. capture drop sbp_high
{txt}
{com}. gen sbp_high=.
{txt}(502,389 missing values generated)

{com}. replace sbp_high=1 if n_4080_0_0>=140 & n_4080_0_0~=.
{txt}(221,082 real changes made)

{com}. replace sbp_high=0 if sbp_high~=1 & n_4080_0_0~=.
{txt}(246,867 real changes made)

{com}. label var sbp_high "Systolic blood pressure >=140 mm Hg"
{txt}
{com}. 
. tab sbp_high

   {txt}Systolic {c |}
      blood {c |}
   pressure {c |}
>=140 mm Hg {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    246,867       52.76       52.76
{txt}          1 {c |}{res}    221,082       47.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    467,949      100.00
{txt}
{com}. 
. 
. **Diastolic blood pressure, automated reading, mm Hg, >=90 mm Hg: 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=4079
. 
. su n_4079_0_0,det

         {txt}Diastolic blood pressure, automated reading
{hline 61}
      Percentiles      Smallest
 1%    {res}       59             32
{txt} 5%    {res}       65             35
{txt}10%    {res}       69             35       {txt}Obs         {res}    467,962
{txt}25%    {res}       75             38       {txt}Sum of wgt. {res}    467,962

{txt}50%    {res}       82                      {txt}Mean          {res}  82.2066
                        {txt}Largest       Std. dev.     {res} 10.70208
{txt}75%    {res}       89            142
{txt}90%    {res}       96            143       {txt}Variance      {res} 114.5346
{txt}95%    {res}      100            148       {txt}Skewness      {res} .2599338
{txt}99%    {res}      109            148       {txt}Kurtosis      {res} 3.243372
{txt}
{com}. 
. 
. capture drop dbp_high
{txt}
{com}. gen dbp_high=.
{txt}(502,389 missing values generated)

{com}. replace dbp_high=1 if n_4079_0_0>=90 & n_4079_0_0~=.
{txt}(112,342 real changes made)

{com}. replace dbp_high=0 if dbp_high~=1 & n_4079_0_0~=.
{txt}(355,620 real changes made)

{com}. label var dbp_high "Diastolic blood pressure >=90 mm Hg"
{txt}
{com}. 
. tab dbp_high

  {txt}Diastolic {c |}
      blood {c |}
   pressure {c |}
 >=90 mm Hg {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    355,620       75.99       75.99
{txt}          1 {c |}{res}    112,342       24.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    467,962      100.00
{txt}
{com}. 
. **allostatic load, total score**
. 
. capture drop allostatic
{txt}
{com}. gen allostatic=.
{txt}(502,389 missing values generated)

{com}. replace allostatic=albumin_low+crp_high+whr_high+tc_high+hdl_low+ghp_high+rhr_high+sbp_high+dbp_high
{txt}(379,080 real changes made)

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. capture drop zcomorbid
{txt}
{com}. egen zcomorbid=std(comorbid)
{txt}(863 missing values generated)

{com}. 
. capture drop zbmi
{txt}
{com}. egen zbmi=std(bmi)
{txt}(3,107 missing values generated)

{com}. 
. capture drop zsrh
{txt}
{com}. egen zsrh=std(srhbr)
{txt}(3,488 missing values generated)

{com}. 
. capture drop zallostatic
{txt}
{com}. egen zallostatic=std(allostatic)
{txt}(123,309 missing values generated)

{com}. 
. capture drop rowmissHEALTH
{txt}
{com}. egen rowmissHEALTH=rowmiss(zcomorbid zbmi zsrh zallostatic)
{txt}
{com}. 
. tab rowmissHEALTH

{txt}rowmissHEAL {c |}
         TH {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    376,162       74.87       74.87
{txt}          1 {c |}{res}    122,980       24.48       99.35
{txt}          2 {c |}{res}      2,342        0.47       99.82
{txt}          3 {c |}{res}        517        0.10       99.92
{txt}          4 {c |}{res}        388        0.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop HEALTH
{txt}
{com}. egen HEALTH=rmean(zcomorbid zbmi zsrh zallostatic) if rowmissHEALTH<=2
{txt}(905 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **************************Diabetes*************************
. capture drop diabetes
{txt}
{com}. gen diabetes = n_2443_0_0
{txt}(933 missing values generated)

{com}. recode diabetes -3 = 0 -1 =0
{txt}(1684 changes made to {bf:diabetes})

{com}. label var diabetes "previously diagnosed with diabetes"
{txt}
{com}. 
. 
. 
. ********************Sleep duration***********************
. 
. capture drop sleep_duration
{txt}
{com}. gen sleep_duration=n_1160_0_0 if n_1160_0_0>0
{txt}(4,216 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. ****************************STEP 8: MERGE FILES TOGETHER FOR LIFE'S ESSENTIAL 8****************************
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB.dta{rm}
saved
{p_end}

{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB.dta{rm}
saved
{p_end}

{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\NUTR_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\NUTR_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\DEMOG_SES_UKB",clear
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLENODIET_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LIFESTYLEDIET_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SS_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\HEALTH_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\NUTR_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 9: GET MEDICATION VARIABLES: STATINS, ANTI-HYPERTENSIVES AND OTHER MEDICATIONS AND MERGE WITH LE8_UKB///////
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_20003_0_* n_20004_0_* n_6153_0_0 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\MEDICATIONS_UKB", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\MEDICATIONS_UKB.dta{rm}
saved
{p_end}

{com}. 
. *Aspirin*
. capture drop aspirin
{txt}
{com}. gen aspirin = 0
{txt}
{com}. forval i=0/47 {c -(}
{txt}  2{com}. replace aspirin = 1 if n_20003_0_`i' == 1140868226 
{txt}  3{com}. {c )-}
{txt}(51,337 real changes made)
(13,388 real changes made)
(1,815 real changes made)
(188 real changes made)
(18 real changes made)
(8 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. label var aspirin "currently taking aspirin"
{txt}
{com}. label define aspirinL 0 "no" 1 "yes"
{txt}
{com}. label values aspirin aspirinL
{txt}
{com}. 
. *Warfarin*
. capture drop warfarin
{txt}
{com}. gen warfarin = 0
{txt}
{com}. forval i=0/47 {c -(}
{txt}  2{com}. replace warfarin = 1 if  n_20003_0_`i' == 1140888266
{txt}  3{com}. {c )-}
{txt}(384 real changes made)
(482 real changes made)
(609 real changes made)
(689 real changes made)
(646 real changes made)
(521 real changes made)
(466 real changes made)
(316 real changes made)
(260 real changes made)
(167 real changes made)
(114 real changes made)
(89 real changes made)
(63 real changes made)
(43 real changes made)
(23 real changes made)
(17 real changes made)
(13 real changes made)
(10 real changes made)
(5 real changes made)
(4 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)

{com}. label var warfarin "currently taking warfarin"
{txt}
{com}. label values warfarin aspirinL
{txt}
{com}. 
. *Digoxin*
. capture drop digoxin
{txt}
{com}. gen digoxin = 0
{txt}
{com}. forval i=0/47 {c -(}
{txt}  2{com}. replace digoxin = 1 if  n_20003_0_`i' == 2038459814
{txt}  3{com}. {c )-}
{txt}(213 real changes made)
(369 real changes made)
(336 real changes made)
(188 real changes made)
(93 real changes made)
(31 real changes made)
(14 real changes made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. label var digoxin "currently taking digoxin"
{txt}
{com}. label values digoxin aspirinL
{txt}
{com}. 
. *Metformin*
. capture drop metformin
{txt}
{com}. gen metformin = 0
{txt}
{com}. forval i=0/47 {c -(}
{txt}  2{com}. replace metformin = 1 if  n_20003_0_`i' == 1140884600
{txt}  3{com}. {c )-}
{txt}(826 real changes made)
(1,833 real changes made)
(2,405 real changes made)
(2,515 real changes made)
(2,096 real changes made)
(1,616 real changes made)
(1,050 real changes made)
(688 real changes made)
(433 real changes made)
(238 real changes made)
(117 real changes made)
(90 real changes made)
(32 real changes made)
(27 real changes made)
(14 real changes made)
(5 real changes made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. label var metformin "currently taking metformin"
{txt}
{com}. label values metformin aspirinL
{txt}
{com}. 
. *Radiotherapy*
. capture drop radiotherapy
{txt}
{com}. gen radiotherapy = 0 
{txt}
{com}. forval i = 0/31 {c -(}
{txt}  2{com}. replace radiotherapy = 1 if n_20004_0_`i' == 1228
{txt}  3{com}. {c )-}
{txt}(218 real changes made)
(105 real changes made)
(79 real changes made)
(36 real changes made)
(19 real changes made)
(16 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. label var radiotherapy "thyroid radioablation therapy"
{txt}
{com}. label define radiotherapyL 0 "no" 1 "yes"
{txt}
{com}. label values radiotherapy radiotherapyL
{txt}
{com}. 
. *Menopause*
. capture drop menopause
{txt}
{com}. gen menopause = 0
{txt}
{com}. forval i = 0/31 {c -(}
{txt}  2{com}. replace menopause = 1 if n_20004_0_`i' == 1665
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. label var menopause "menopause/menopausal symptoms"
{txt}
{com}. label define menopauseL 0 "no" 1 "yes"
{txt}
{com}. label values menopause menopauseL
{txt}
{com}. 
. 
. *Lipid Lowering Drugs*
. capture drop statins
{txt}
{com}. gen statins = .
{txt}(502,389 missing values generated)

{com}. forval i = 0/0 {c -(}
{txt}  2{com}. replace statins = 1 if n_6153_0_`i' == 1
{txt}  3{com}. {c )-}
{txt}(34,607 real changes made)

{com}. replace statins = 0 if statins ==.
{txt}(467,782 real changes made)

{com}. label var statins "currently taking statins"
{txt}
{com}. label values statins aspirinL
{txt}
{com}. 
. *Blood Pressure Treatment*
. *Lipid Lowering Drugs*
. capture drop bptreat
{txt}
{com}. gen bptreat = .
{txt}(502,389 missing values generated)

{com}. forval i = 0/0 {c -(}
{txt}  2{com}. replace bptreat = 1 if n_6153_0_`i' == 2
{txt}  3{com}. {c )-}
{txt}(27,918 real changes made)

{com}. replace bptreat = 0 if bptreat ==.
{txt}(474,471 real changes made)

{com}. label var bptreat "currently on anti-hypertensives"
{txt}
{com}. label values bptreat aspirinL
{txt}
{com}. 
. 
. 
. save,replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\MEDICATIONS_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\MEDICATIONS_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\MEDICATIONS_UKB.dta{rm}
saved
{p_end}

{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB",clear
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\MEDICATIONS_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 10: GENERATE LIFE'S ESSENTIAL 8 INDEX//////
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB", clear
{txt}
{com}. 
. 
. 
. **************************************COMPONENT 1: DIET************************************************
. 
. **HDI_TOTALSCORE
. 
. su HDI_TOTALSCORE

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HDI_TOTALS~E {c |}{res}    500,986     5.06559    1.510801          0         11
{txt}
{com}. histogram HDI_TOTALSCORE
{txt}(bin={res}56{txt}, start={res}0{txt}, width={res}.19642857{txt})
{res}{txt}
{com}. 
. **>=95th percentile: 100
. **75th-94th percentile: 80
. **50th-74th: 50
. **25th-49th: 25
. **1st-24th: 0
. 
. xtile HDI_TOTALSCOREpct=HDI_TOTALSCORE,nq(100)
{txt}
{com}. 
. capture drop LE8_COMP1DIET
{txt}
{com}. gen LE8_COMP1DIET=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP1DIET=100 if HDI_TOTALSCOREpct>=95 & HDI_TOTALSCORE~=.
{txt}(25,763 real changes made)

{com}. replace LE8_COMP1DIET=80 if HDI_TOTALSCOREpct>=75 & HDI_TOTALSCOREpct<95 & HDI_TOTALSCORE~=.
{txt}(63,590 real changes made)

{com}. replace LE8_COMP1DIET=50 if HDI_TOTALSCOREpct>=50 & HDI_TOTALSCOREpct<75 & HDI_TOTALSCORE~=.
{txt}(117,017 real changes made)

{com}. replace LE8_COMP1DIET=25 if HDI_TOTALSCOREpct>=25 & HDI_TOTALSCOREpct<50 & HDI_TOTALSCORE~=.
{txt}(127,305 real changes made)

{com}. replace LE8_COMP1DIET=0 if HDI_TOTALSCOREpct>=1 & HDI_TOTALSCOREpct<25 & HDI_TOTALSCORE~=.
{txt}(167,311 real changes made)

{com}. 
. 
. ************************************COMPONENT 2: PHYSICAL ACTIVITY*************************************
. 
. 
. *Moderate exercise MET-min/week*
. **gen modperday = n_894_0_0 if n_894_0_0 >= 0
. **label var modperday "moderate exercise minutes per day"
. 
. 
. *Vigorous exercise MET-min/week*
. **gen vigperday = n_914_0_0 if n_914_0_0 >= 0
. **label var vigperday "vigorous exercise minutes per day"
. 
. **Minutes per day of moderate or greater activity**
. 
. capture drop modvigperday
{txt}
{com}. egen modvigperday=rowtotal(modperday vigperday)
{txt}
{com}. 
. 
. **100: >=150
. **90: 120-149
. **80: 90-119
. **60: 60-89
. **40: 30-59
. **20: 1-29
. **0: 0
. 
. capture drop LE8_COMP2PA
{txt}
{com}. gen LE8_COMP2PA=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP2PA=100 if modvigperday>=150 & modvigperday~=.
{txt}(67,447 real changes made)

{com}. replace LE8_COMP2PA=90 if modvigperday>=120 & modvigperday<150 & modvigperday~=.
{txt}(40,026 real changes made)

{com}. replace LE8_COMP2PA=80 if modvigperday>=90 & modvigperday<120 & modvigperday~=.
{txt}(40,291 real changes made)

{com}. replace LE8_COMP2PA=60 if modvigperday>=60 & modvigperday<90 & modvigperday~=.
{txt}(83,777 real changes made)

{com}. replace LE8_COMP2PA=40 if modvigperday>=30 & modvigperday<60 & modvigperday~=.
{txt}(89,960 real changes made)

{com}. replace LE8_COMP2PA=20 if modvigperday>=1 & modvigperday<30 & modvigperday~=.
{txt}(69,460 real changes made)

{com}. replace LE8_COMP2PA=0 if modvigperday==0 
{txt}(111,428 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. ************************************COMPONENT 3: NICOTINE EXPOSURE*************************************
. 
. *Combine Current Smoking with Ex-smoking duration for protective effects*
. 
. 
. **gen smokingstatus = 0 if smoking == 2
. **replace smokingstatus = agestop if smokingstatus ==.
. **replace smokingstatus = 4 if smoking == 0
. **label var smokingstatus "complete smoking status"
. **label define statusL 0 "current smoker" 1 "ex-smoker < 5 years" 2 "ex-smoker between 5-10 years" 3 "ex-smoker > 10 years" 4 "never smoker"
. **label values smokingstatus statusL
. **recode smokingstatus .=4
. 
. *Environmental tobacco smoke*
. 
. **replace n_1279_0_0 = . if n_1279_0_0 < 0
. **replace n_1269_0_0  = . if n_1269_0_0 < 0
. **order n_1279_0_0, after(n_1269_0_0)
. **egen ets = rowtotal(n_1269_0_0-n_1279_0_0)
. **gen etsmoke = ets
. **label var etsmoke "environmental tobacco exposures (hours per week)"
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. **100 Never smoker
. ** 75 Former smoker, quit >=5 years
. ** 50 Former smoker, quit 1-<5 years
. **25 Former smoker, quit <1 year, or currently using inhaled NDS
. **0 Current smoker
. 
. capture drop LE8_COMP3NICOTINE
{txt}
{com}. gen LE8_COMP3NICOTINE=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP3NICOTINE=100 if smokingstatus==4
{txt}(409,166 real changes made)

{com}. replace LE8_COMP3NICOTINE=75 if smokingstatus==2 | smokingstatus==3
{txt}(36,929 real changes made)

{com}. replace LE8_COMP3NICOTINE=37.5 if smokingstatus==1 
{txt}(3,332 real changes made)

{com}. replace LE8_COMP3NICOTINE=0 if smokingstatus==0
{txt}(52,962 real changes made)

{com}. replace LE8_COMP3NICOTINE=LE8_COMP3NICOTINE-20 if LE8_COMP3NICOTINE~=0 & etsmoke~=0
{txt}(90,854 real changes made)

{com}. 
. 
. 
. **[Note that 25 and 50 are combined to denote <5 years, into 37.5 ] 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *************************************COMPONENT 4: SLEEP HEALTH*****************************************
. 
. 
. **capture drop sleep_duration
. **gen sleep_duration=n_1160_0_0 if n_1160_0_0>0
. 
. 
. **100: 7-<9
. **90: 9-<10
. **70: 6-<7
. **40: 5-<6 or >=10
. **20: 4-<5
. **0: <4
. 
. 
. capture drop LE8_COMP4SLEEP
{txt}
{com}. gen LE8_COMP4SLEEP=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP4SLEEP=100 if sleep_duration>=7 & sleep_duration<9
{txt}(336,616 real changes made)

{com}. replace LE8_COMP4SLEEP=90 if sleep_duration>=9 & sleep_duration<10
{txt}(29,098 real changes made)

{com}. replace LE8_COMP4SLEEP=70 if sleep_duration>=6 & sleep_duration<7
{txt}(95,632 real changes made)

{com}. replace LE8_COMP4SLEEP=40 if (sleep_duration>=5 & sleep_duration<6) | (sleep_duration>=10 & sleep_duration~=.)
{txt}(31,163 real changes made)

{com}. replace LE8_COMP4SLEEP=20 if sleep_duration>=4 & sleep_duration<5
{txt}(4,608 real changes made)

{com}. replace LE8_COMP4SLEEP=0 if sleep_duration<4
{txt}(1,056 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. **************************************COMPONENT 5: BODY MASS INDEX************************************
. 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=23104
. 
. **capture drop bmi
. **gen bmi=n_21001_0_0 
. **label var bmi "body mass index kg/m^2" 
. 
. **100: <25
. **70: 25-29.9
. **30: 30.0-34.9
. **15: 35.0-39.9
. **0: >=40.0
. 
. 
. capture drop LE8_COMP5BMI
{txt}
{com}. gen LE8_COMP5BMI=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP5BMI=100 if bmi<25 & bmi~=.
{txt}(164,988 real changes made)

{com}. replace LE8_COMP5BMI=70 if bmi>=25 & bmi<30
{txt}(212,071 real changes made)

{com}. replace LE8_COMP5BMI=30 if bmi>=30 & bmi<35
{txt}(87,535 real changes made)

{com}. replace LE8_COMP5BMI=15 if bmi>=35 & bmi<40
{txt}(24,989 real changes made)

{com}. replace LE8_COMP5BMI=0 if bmi>=40 & bmi~=.
{txt}(9,699 real changes made)

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. ***************************************COMPONENT 6: Blood lipids **************************************
. 
. **ELEVATED TC, >=240 mg/dL: divide by 38.67 to get mmol/L: >=6.21 mmol/L
. 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30690,det
. **https://www.omnicalculator.com/health/cholesterol-units
. 
. su n_30690_0_0, det

                         {txt}Cholesterol
{hline 61}
      Percentiles      Smallest
 1%    {res}    3.223           .601
{txt} 5%    {res}    3.888          1.432
{txt}10%    {res}    4.263          1.498       {txt}Obs         {res}    469,481
{txt}25%    {res}    4.906          1.551       {txt}Sum of wgt. {res}    469,481

{txt}50%    {res}     5.65                      {txt}Mean          {res} 5.692449
                        {txt}Largest       Std. dev.     {res} 1.144948
{txt}75%    {res}    6.424          13.53
{txt}90%    {res}    7.165         13.615       {txt}Variance      {res} 1.310906
{txt}95%    {res}     7.64         13.719       {txt}Skewness      {res} .2856572
{txt}99%    {res}    8.606          15.46       {txt}Kurtosis      {res} 3.338082
{txt}
{com}. 
. 
. 
. **LOW HDL-C, <40 mg/dL: divide by 38.67 to get mmol/L: <1.034 mmol/L**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30760
. **https://www.omnicalculator.com/health/cholesterol-units
. 
. su n_30760_0_0, det

                       {txt}HDL cholesterol
{hline 61}
      Percentiles      Smallest
 1%    {res}     .775           .219
{txt} 5%    {res}     .917           .226
{txt}10%    {res}    1.003           .228       {txt}Obs         {res}    429,774
{txt}25%    {res}     1.17           .252       {txt}Sum of wgt. {res}    429,774

{txt}50%    {res}    1.398                      {txt}Mean          {res} 1.448002
                        {txt}Largest       Std. dev.     {res} .3823061
{txt}75%    {res}    1.674          4.107
{txt}90%    {res}     1.96          4.129       {txt}Variance      {res}  .146158
{txt}95%    {res}    2.147          4.186       {txt}Skewness      {res} .7756026
{txt}99%    {res}    2.539          4.401       {txt}Kurtosis      {res} 3.958405
{txt}
{com}. 
. 
. capture drop nonhdlchol
{txt}
{com}. gen nonhdlchol=(n_30690_0_0-n_30760_0_0)
{txt}(72,694 missing values generated)

{com}. 
. 
. *Lipid Lowering Drugs*
. capture drop statins
{txt}
{com}. gen statins = .
{txt}(502,389 missing values generated)

{com}. forval i = 0/0 {c -(}
{txt}  2{com}. replace statins = 1 if n_6153_0_`i' == 1
{txt}  3{com}. {c )-}
{txt}(34,607 real changes made)

{com}. replace statins = 0 if statins ==.
{txt}(467,782 real changes made)

{com}. label var statins "currently taking statins"
{txt}
{com}. label values statins aspirinL
{txt}
{com}. 
. 
. **100: <130 or <3.36
. **60: 130-159 or 3.36-<4.13
. **40: 160-189 or 4.13-<4.91
. **20: 190-219 or 4.91-<5.69
. **0: >=220 or >=5.69
. 
. capture drop LE8_COMP6LIPIDS
{txt}
{com}. gen LE8_COMP6LIPIDS=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP6LIPIDS=100 if nonhdlchol<3.36
{txt}(91,696 real changes made)

{com}. replace LE8_COMP6LIPIDS=60 if nonhdlchol>=3.36 & nonhdlchol<4.13
{txt}(114,998 real changes made)

{com}. replace LE8_COMP6LIPIDS=40 if nonhdlchol>=4.13 & nonhdlchol<4.91
{txt}(112,871 real changes made)

{com}. replace LE8_COMP6LIPIDS=20 if nonhdlchol>=4.91 & nonhdlchol<5.69
{txt}(69,325 real changes made)

{com}. replace LE8_COMP6LIPIDS=0 if nonhdlchol>=5.69 & nonhdlchol~=.
{txt}(40,805 real changes made)

{com}. replace LE8_COMP6LIPIDS=LE8_COMP6LIPIDS-20 if LE8_COMP6LIPIDS~=0 & statins==1
{txt}(28,636 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. ***************************************COMPONENT 7: Blood glucose or HbA1c*************************************
. 
. **Glycated hemoglobin, % change to mmol/mol: (35.3 mmol/mol is 5.4%), cutoff in % is 6.4% --> 46 mmol/mol
. **Use the converter below
. 
. **https://www.hba1cnet.com/hba1c-calculator/
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=30750
. 
. su n_30750_0_0,det

                {txt}Glycated haemoglobin (HbA1c)
{hline 61}
      Percentiles      Smallest
 1%    {res}       26             15
{txt} 5%    {res}     29.1           15.3
{txt}10%    {res}     30.5           15.3       {txt}Obs         {res}    466,394
{txt}25%    {res}     32.8           15.3       {txt}Sum of wgt. {res}    466,394

{txt}50%    {res}     35.2                      {txt}Mean          {res} 36.13129
                        {txt}Largest       Std. dev.     {res} 6.775722
{txt}75%    {res}     37.9          265.6
{txt}90%    {res}     41.1          266.3       {txt}Variance      {res}  45.9104
{txt}95%    {res}     45.1          296.1       {txt}Skewness      {res} 4.895931
{txt}99%    {res}     64.7          515.2       {txt}Kurtosis      {res} 95.77651
{txt}
{com}. 
. 
. 
. *Diabetes*
. **gen diabetes = n_2443_0_0
. **recode diabetes -3 = 0 -1 =0
. **label var diabetes "previously diagnosed with diabetes"
. **label values diabetes aspirinL
. 
. **Points        Level (for HANDLS SE8)
. **100   If dxDiabetes is not "Diabetes" and hbA1c < 5.7
. **60    If dxDiabetes is not "Diabetes" and HbA1c 5.76.4
. **40    HbA1c <7.0 and dxDiabetes = "Diabetes", 
. **OR If dxDiabetes is not "Diabetes"(or dx missing) and HbA1C 6.4-7.0
. **30    HbA1c 7.07.9  (regardless of dx)
. **20    HbA1c 8.08.9  (regardless of dx)
. **10    Hb A1c 9.09.9  (regardless of dx)
. **0     HbA1c 10.0  (regardless of dx)
. 
. 
. capture drop LE8_COMP7GLUC
{txt}
{com}. gen LE8_COMP7GLUC=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP7GLUC=100 if diabetes==0 & n_30750_0_0<39 
{txt}(377,165 real changes made)

{com}. replace LE8_COMP7GLUC=60 if  diabetes==0 & (n_30750_0_0>=39 &  n_30750_0_0<46)
{txt}(58,985 real changes made)

{com}. replace LE8_COMP7GLUC=40 if  (diabetes==1 & (n_30750_0_0<53)) | (diabetes==0 & (n_30750_0_0>=46 & n_30750_0_0<53))
{txt}(18,199 real changes made)

{com}. replace LE8_COMP7GLUC=30 if  (n_30750_0_0>=53 & n_30750_0_0<64)
{txt}(6,627 real changes made)

{com}. replace LE8_COMP7GLUC=20 if  (n_30750_0_0>=64 & n_30750_0_0<75)
{txt}(2,776 real changes made)

{com}. replace LE8_COMP7GLUC=10 if  (n_30750_0_0>=75 & n_30750_0_0<86)
{txt}(1,138 real changes made)

{com}. replace LE8_COMP7GLUC=0 if  (n_30750_0_0>=86) & n_30750_0_0~=.
{txt}(1,051 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. ***************************************COMPONENT 8: Blood pressure************************************
. 
. 
. **Systolic blood pressure, automated reading, mm Hg, >=140 mm Hg: 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=4080
. 
. su n_4080_0_0,det

         {txt}Systolic blood pressure, automated reading
{hline 61}
      Percentiles      Smallest
 1%    {res}      101             62
{txt} 5%    {res}      110             68
{txt}10%    {res}      116             69       {txt}Obs         {res}    467,949
{txt}25%    {res}      126             69       {txt}Sum of wgt. {res}    467,949

{txt}50%    {res}      138                      {txt}Mean          {res} 139.7411
                        {txt}Largest       Std. dev.     {res} 19.69681
{txt}75%    {res}      152            254
{txt}90%    {res}      166            260       {txt}Variance      {res} 387.9642
{txt}95%    {res}      175            264       {txt}Skewness      {res} .4963807
{txt}99%    {res}      192            268       {txt}Kurtosis      {res} 3.396021
{txt}
{com}. 
. 
. **Diastolic blood pressure, automated reading, mm Hg, >=90 mm Hg: 
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=4079
. 
. su n_4079_0_0,det

         {txt}Diastolic blood pressure, automated reading
{hline 61}
      Percentiles      Smallest
 1%    {res}       59             32
{txt} 5%    {res}       65             35
{txt}10%    {res}       69             35       {txt}Obs         {res}    467,962
{txt}25%    {res}       75             38       {txt}Sum of wgt. {res}    467,962

{txt}50%    {res}       82                      {txt}Mean          {res}  82.2066
                        {txt}Largest       Std. dev.     {res} 10.70208
{txt}75%    {res}       89            142
{txt}90%    {res}       96            143       {txt}Variance      {res} 114.5346
{txt}95%    {res}      100            148       {txt}Skewness      {res} .2599338
{txt}99%    {res}      109            148       {txt}Kurtosis      {res} 3.243372
{txt}
{com}. 
. 
. *Blood Pressure Treatment*
. 
. **capture drop bptreat
. **gen bptreat = .
. **forval i = 0/3 {c -(}
. **replace bptreat = 1 if n_6153_0_`i' == 2
. **{c )-}
. **replace bptreat = 0 if bptreat ==.
. **label var bptreat "currently on anti-hypertensives"
. **label values bptreat aspirinL
. 
. 
. **100: <120/<80 (Optimal)
. **75: 120-129/<80 (Elevated)
. **50: 130-139 or 80-89 (Stage | HTN)
. **25: 140-159 or 90-99
. **0: >=160 or >=100
. **Subtact 20 pionts if treated level**
. 
. capture drop LE8_COMP8BP
{txt}
{com}. gen LE8_COMP8BP=.
{txt}(502,389 missing values generated)

{com}. replace LE8_COMP8BP=100 if n_4080_0_0<120 & n_4079_0_0<80
{txt}(63,155 real changes made)

{com}. replace LE8_COMP8BP=75 if (n_4080_0_0>=120 & n_4080_0_0<130) & n_4079_0_0<80
{txt}(53,791 real changes made)

{com}. replace LE8_COMP8BP=50 if (n_4080_0_0>=130 & n_4080_0_0<140) | (n_4079_0_0>=80 & n_4079_0_0<90)
{txt}(212,276 real changes made)

{com}. replace LE8_COMP8BP=25 if (n_4080_0_0>=140 & n_4080_0_0<160) | (n_4079_0_0>=90 & n_4079_0_0<100)
{txt}(189,392 real changes made)

{com}. replace LE8_COMP8BP=0 if (n_4080_0_0>=160 & n_4080_0_0~=.) | (n_4079_0_0>=100 & n_4079_0_0~=.)
{txt}(81,929 real changes made)

{com}. replace LE8_COMP8BP=LE8_COMP8BP-20 if LE8_COMP8BP~=0 & bptreat==1
{txt}(18,286 real changes made)

{com}. 
. 
. 
. *******************************************LE8 TOTAL SCORE**********************************************
. capture drop rowmissLE8TOTAL
{txt}
{com}. egen rowmissLE8TOTAL=rowmiss(LE8_COMP1DIET LE8_COMP2PA LE8_COMP3NICOTINE LE8_COMP4SLEEP LE8_COMP5BMI LE8_COMP6LIPIDS LE8_COMP7GLUC LE8_COMP8BP)
{txt}
{com}. 
. tab rowmissLE8TOTAL

{txt}rowmissLE8T {c |}
       OTAL {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    376,519       74.95       74.95
{txt}          1 {c |}{res}    105,768       21.05       96.00
{txt}          2 {c |}{res}     15,498        3.08       99.08
{txt}          3 {c |}{res}      3,605        0.72       99.80
{txt}          4 {c |}{res}        608        0.12       99.92
{txt}          5 {c |}{res}         49        0.01       99.93
{txt}          6 {c |}{res}        342        0.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop LE8_TOTALSCORE
{txt}
{com}. egen LE8_TOTALSCORE=rmean(LE8_COMP1DIET LE8_COMP2PA LE8_COMP3NICOTINE LE8_COMP4SLEEP LE8_COMP5BMI LE8_COMP6LIPIDS LE8_COMP7GLUC LE8_COMP8BP) if rowmissLE8TOTAL<=4
{txt}(391 missing values generated)

{com}. 
. replace LE8_TOTALSCORE=LE8_TOTALSCORE*8
{txt}(501,998 real changes made)

{com}. 
. 
. *******************************************LE8 LIFESTYLE SCORE*******************************************
. capture drop rowmissLE8LIFESTYLE
{txt}
{com}. egen rowmissLE8LIFESTYLE=rowmiss(LE8_COMP1DIET LE8_COMP2PA LE8_COMP3NICOTINE LE8_COMP4SLEEP)
{txt}
{com}. 
. tab rowmissLE8LIFESTYLE

{txt}rowmissLE8L {c |}
   IFESTYLE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    497,906       99.11       99.11
{txt}          1 {c |}{res}      3,347        0.67       99.77
{txt}          2 {c |}{res}      1,136        0.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop LE8_LIFESTYLE
{txt}
{com}. egen LE8_LIFESTYLE=rmean(LE8_COMP1DIET LE8_COMP2PA LE8_COMP3NICOTINE LE8_COMP4SLEEP) if rowmissLE8LIFESTYLE<=2
{txt}
{com}. 
. 
. replace LE8_LIFESTYLE=LE8_LIFESTYLE*4
{txt}(502,106 real changes made)

{com}. 
. 
. 
. ********************************************LE8 BIOLOGICAL SCORE***********************************************
. capture drop rowmissLE8BIOLOGICAL
{txt}
{com}. egen rowmissLE8BIOLOGICAL=rowmiss(LE8_COMP5BMI LE8_COMP6LIPIDS LE8_COMP7GLUC LE8_COMP8BP)
{txt}
{com}. 
. tab rowmissLE8BIOLOGICAL

{txt}rowmissLE8B {c |}
  IOLOGICAL {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    379,070       75.45       75.45
{txt}          1 {c |}{res}    104,601       20.82       96.27
{txt}          2 {c |}{res}     14,844        2.95       99.23
{txt}          3 {c |}{res}      3,096        0.62       99.85
{txt}          4 {c |}{res}        778        0.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. capture drop LE8_BIOLOGICAL
{txt}
{com}. egen LE8_BIOLOGICAL=rmean(LE8_COMP5BMI LE8_COMP6LIPIDS LE8_COMP7GLUC LE8_COMP8BP) if rowmissLE8BIOLOGICAL<=2
{txt}(3,874 missing values generated)

{com}. 
. replace LE8_BIOLOGICAL=LE8_BIOLOGICAL*4
{txt}(498,399 real changes made)

{com}. 
.  
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. //STEP 11: GENERATE COGNITION VARIABLES//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_20023_0_0 n_399_0_1 n_399_0_2 n_400_0_1 n_400_0_2 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB.dta{rm}
saved
{p_end}

{com}. 
. capture drop n_400_0_1r
{txt}
{com}. capture drop n_400_0_2r
{txt}
{com}. 
. gen n_400_0_1r=n_400_0_1 
{txt}(4,625 missing values generated)

{com}. gen n_400_0_2r=n_400_0_2 
{txt}(4,625 missing values generated)

{com}. 
. destring n_399_0_1 n_399_0_2 n_400_0_1r n_400_0_2r,replace
{txt}n_399_0_1 already numeric; no {res}replace
{txt}n_399_0_2 already numeric; no {res}replace
{txt}n_400_0_1r already numeric; no {res}replace
{txt}n_400_0_2r already numeric; no {res}replace
{txt}
{com}. 
. **Reaction time: mean time to correctly identify matches**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=20023
. 
. capture drop REACTION_TIME
{txt}
{com}. gen REACTION_TIME=.
{txt}(502,389 missing values generated)

{com}. replace REACTION_TIME=ln(n_20023_0_0)
{txt}(496,565 real changes made)

{com}. 
. 
. 
. **Pairs matching: number incorrect**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=399
. capture drop n_399_0_mean
{txt}
{com}. gen n_399_0_mean=(n_399_0_1+n_399_0_2)/2
{txt}(4,625 missing values generated)

{com}. 
. su n_399_0_mean

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_399_0_mean {c |}{res}    497,764     2.34483    1.889851          0         97
{txt}
{com}. 
. 
. capture drop PAIRSMATCHING_INC
{txt}
{com}. gen PAIRSMATCHING_INC=.
{txt}(502,389 missing values generated)

{com}. replace PAIRSMATCHING_INC=ln(n_399_0_mean)
{txt}(464,653 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB.dta{rm}
saved
{p_end}

{com}. 
. **Pairs matching: time to complete**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=400
. 
. capture drop n_400_0_mean
{txt}
{com}. gen n_400_0_mean=(n_400_0_1r+n_400_0_2r)/2
{txt}(4,625 missing values generated)

{com}. 
. 
. capture drop PAIRSMATCHING_TTC
{txt}
{com}. gen PAIRSMATCHING_TTC=.
{txt}(502,389 missing values generated)

{com}. replace PAIRSMATCHING_TTC=ln(n_400_0_mean)
{txt}(485,708 real changes made)

{com}. 
. 
. capture drop rowmissCOGN
{txt}
{com}. egen rowmissCOGN=rowmiss(REACTION_TIME PAIRSMATCHING_INC PAIRSMATCHING_TTC)
{txt}
{com}. 
. tab rowmissCOGN

{txt}rowmissCOGN {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    461,060       91.77       91.77
{txt}          1 {c |}{res}     25,747        5.12       96.90
{txt}          2 {c |}{res}     12,252        2.44       99.34
{txt}          3 {c |}{res}      3,330        0.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    502,389      100.00
{txt}
{com}. 
. ***PCA for cognitive performance**
. 
. pca REACTION_TIME PAIRSMATCHING_INC PAIRSMATCHING_TTC if rowmissCOGN<=1, factors(1)

{txt}Principal components/correlation{col 50}Number of obs    = {res}   461,060
{col 50}{txt}Number of comp.  = {res}         1
{col 50}{txt}Trace            {col 67}=  {res}        3
{col 5}{txt}Rotation: (unrotated = principal){col 50}Rho              = {res}    0.6023

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}   Component {c |}   Eigenvalue   Difference         Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 12:Comp1} {c |}{res}      1.80695      .916352             0.6023       0.6023
{txt}{col 5}{ralign 12:Comp2} {c |}{res}      .890597      .588142             0.2969       0.8992
{txt}{col 5}{ralign 12:Comp3} {c |}{res}      .302455            .             0.1008       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}

Principal components (eigenvectors) 

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 13}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}{c |}{space 1}{ralign 11:Unexplained}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 13}
{space 4}{space 0}{ralign 12:REACTION_T~E}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.3595}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .7665}}}{space 1}
{space 4}{space 0}{ralign 12:PAIRSMATC~NC}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.6464}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .2451}}}{space 1}
{space 4}{space 0}{ralign 12:PAIRSMATC~TC}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.6730}}}{space 1}{c |}{space 1}{center 11:{res:{sf:      .1815}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 13}

{com}. predict POORCOGN
{txt}({bf:score} assumed)

Scoring coefficients 
{col 5}sum of squares(column-loading) = 1

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:REACTION_T~E}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.3595}}}{space 1}
{space 4}{space 0}{ralign 12:PAIRSMATC~NC}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.6464}}}{space 1}
{space 4}{space 0}{ralign 12:PAIRSMATC~TC}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.6730}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}

{com}.  
. save , replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB.dta{rm}
saved
{p_end}

{com}. 
. //STEP 12: GENERATE AD/DEMENTIA AND RELATED TIME VARIABLES//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\SMALLERDATASETUKBfin", clear
{txt}
{com}. 
. keep n_eid n_21022_0_0 n_20009_0_* n_20002_0_* s_41202_0_* n_34_0_0 n_52_0_0 ts_53_0_0 ts_40000_*_0  n_40007_*_0  ts_42018_0_0 ts_42020_0_0 
{txt}
{com}. 
. 
. 
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\ADDEMENTIA_UKB",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\ADDEMENTIA_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. **DEMENTIA AND ALZHEIMER'S DISEASE, INCIDENT CASES AND DATE OF INCIDENCE**
. 
. **https://biobank.ctsu.ox.ac.uk/crystal/search.cgi?wot=0&srch=dementia&sta0=on&sta1=on&sta2=on&sta3=on&str0=on&str3=on&fit0=on&fit10=on&fit20=on&fit30=on&fvt11=on&fvt21=on&fvt22=on&fvt31=on&fvt41=on&fvt51=on&fvt61=on&fvt101=on&yfirst=2000&ylast=2021
. 
. **Main resource: algorithmically defined outcomes: 
. **https://biobank.ctsu.ox.ac.uk/crystal/ukb/docs/alg_outcome_main.pdf**: pages 14-15
. 
. 
. **Field ID      Description     Category
. 
. **130836        Date F00 first reported (dementia in alzheimer's disease)       Mental and behavioural disorders  
. **130838        Date F01 first reported (vascular dementia)     Mental and behavioural disorders  
. **130840        Date F02 first reported (dementia in other diseases classified elsewhere)       Mental and behavioural disorders  
. **130842        Date F03 first reported (unspecified dementia)  Mental and behavioural disorders  
. **42018 Date of all cause dementia report       Dementia outcomes  
. **42024 Date of frontotemporal dementia report  Dementia outcomes  
. **42022 Date of vascular dementia report        Dementia outcomes  
. **42019 Source of all cause dementia report     Dementia outcomes  
. **42025 Source of frontotemporal dementia report        Dementia outcomes  
. **130837        Source of report of F00 (dementia in alzheimer's disease)       Mental and behavioural disorders  
. **130839        Source of report of F01 (vascular dementia)     Mental and behavioural disorders  
. **130841        Source of report of F02 (dementia in other diseases classified elsewhere)       Mental and behavioural disorders  
. **130843        Source of report of F03 (unspecified dementia)  Mental and behavioural disorders  
. **42023 Source of vascular dementia report      Dementia outcomes  
. **20112 Illnesses of adopted father     Family history  
. **20113 Illnesses of adopted mother     Family history  
. **20114 Illnesses of adopted siblings   Family history  
. **20107 Illnesses of father     Family history  
. **20110 Illnesses of mother     Family history  
. **20111 Illnesses of siblings   Family history  
. **40002 Contributory (secondary) causes of death: ICD10 Death register  
. **41270 Diagnoses - ICD10       Summary Diagnoses  
. **41202 Diagnoses - main ICD10  Summary Diagnoses  
. **41204 Diagnoses - secondary ICD10     Summary Diagnoses  
. **41201 External causes - ICD10 Summary Diagnoses  
. **40006 Type of cancer: ICD10   Cancer register  
. **40001 Underlying (primary) cause of death: ICD10      Death register  
. **41271 Diagnoses - ICD9        Summary Diagnoses  
. **41203 Diagnoses - main ICD9   Summary Diagnoses  
. **41205 Diagnoses - secondary ICD9      Summary Diagnoses  
. **40013 Type of cancer: ICD9    Cancer register  
. **20002 Non-cancer illness code, self-reported  Medical conditions  
. **41246 Treatment speciality of consultant (recoded)    Summary Administration  
. 
. 
. **Field ID      Description     Category
. **20009 Interpolated Age of participant when non-cancer illness first diagnosed Medical conditions  
. **40007 Age at death    Death register  
. 
. 
. **Field ID      Description     Category
. **131036        Date G30 first reported (alzheimer's disease)   Nervous system disorders  (**https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=131036)  
. **42020         Date of alzheimer's disease report      Dementia outcomes  (**https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=42020)
. **42021         Source of alzheimer's disease report    Dementia outcomes  
. **130837        Source of report of F00 (dementia in alzheimer's disease)       Mental and behavioural disorders  
. **131037        Source of report of G30 (alzheimer's disease)   Nervous system disorders  
. 
. /////////////////////////////////////////////////////////////////////////////////////////////////
> ***Field 20002: https://biobank.ctsu.ox.ac.uk/crystal/coding.cgi?id=6
. ***Field 20009: https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=20009
. 
. *Years of Birth*
. capture drop birthyear
{txt}
{com}. gen birthyear=n_34_0_0 
{txt}(3 missing values generated)

{com}. 
. *Month of Birth*
. capture drop birthmonth
{txt}
{com}. gen birthmonth=n_52_0_0 
{txt}(3 missing values generated)

{com}. 
. *Date of birth*
. capture drop birthdate
{txt}
{com}. gen birthdate=mdy(birthmonth,14,birthyear)
{txt}(3 missing values generated)

{com}. 
. *Baseline Cohort Start Date*
. capture drop startdate
{txt}
{com}. gen startdate=ts_53_0_0 
{txt}
{com}. format startdate %d
{txt}
{com}. 
. *Baseline age**
. capture drop baselineage
{txt}
{com}. gen baselineage=(startdate-birthdate)/365.25
{txt}(3 missing values generated)

{com}. 
. 
. **Prior dementia**
. forval i = 0/28 {c -(}
{txt}  2{com}. replace n_20009_0_`i' = . if n_20009_0_`i' < 0
{txt}  3{com}. {c )-}
{txt}(15,330 real changes made, 15,330 to missing)
(7,107 real changes made, 7,107 to missing)
(4,261 real changes made, 4,261 to missing)
(2,494 real changes made, 2,494 to missing)
(1,435 real changes made, 1,435 to missing)
(811 real changes made, 811 to missing)
(474 real changes made, 474 to missing)
(236 real changes made, 236 to missing)
(153 real changes made, 153 to missing)
(91 real changes made, 91 to missing)
(36 real changes made, 36 to missing)
(23 real changes made, 23 to missing)
(18 real changes made, 18 to missing)
(14 real changes made, 14 to missing)
(6 real changes made, 6 to missing)
(1 real change made, 1 to missing)
(3 real changes made, 3 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. gen dem = 0
{txt}
{com}. gen agedem = .
{txt}(502,389 missing values generated)

{com}. forval i=0/28 {c -(}
{txt}  2{com}. replace dem = 1 if n_20002_0_`i' == 1263
{txt}  3{com}.         forval k=0/28 {c -(}
{txt}  4{com}.         replace agedem = n_20009_0_`k' if dem == 1 & n_20009_0_`k' < n_20009_0_`k-1'
{txt}  5{com}.         {c )-}
{txt}  6{com}. {c )-}
{txt}(39 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(40 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(26 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(11 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. capture drop dem
{txt}
{com}. capture drop priordem 
{txt}
{com}. gen priordem = 1 if agedem < baselineage 
{txt}(502,389 missing values generated)

{com}. recode priordem .=0 
{txt}(502389 changes made to {bf:priordem})

{com}. label var priordem "individuals with prior history of dementia"
{txt}
{com}. label define priorL 0 "none" 1 "had disease before cohort start date"
{txt}
{com}. label values priordem priorL
{txt}
{com}. 
. **Source: https://bmcmedicine.biomedcentral.com/track/pdf/10.1186/s12916-021-01980-z.pdf
. 
. 
. **Dementia: A81.0, F00, F01, F02, F03, F05, G30, G31.0, G31.1, G31.8, and I67.3
. 
. **AD: (F00, G30)
. 
. **VaD: (F01, I67.3)
. 
. 
. format ts_42018_0_0 %d 
{txt}
{com}. 
. capture drop DEMENTIA_EARLIESTDATE
{txt}
{com}. gen DEMENTIA_EARLIESTDATE= ts_42018_0_0  
{txt}(494,493 missing values generated)

{com}. 
. capture drop dem_diag
{txt}
{com}. gen dem_diag=.
{txt}(502,389 missing values generated)

{com}. replace dem_diag=1 if DEMENTIA_EARLIESTDATE~=.
{txt}(7,896 real changes made)

{com}. replace dem_diag=0 if dem_diag~=1
{txt}(494,493 real changes made)

{com}. 
. 
. 
. ****Incident Alzheimer's Disease***
. 
. 
. format ts_42020_0_0 %d 
{txt}
{com}. 
. capture drop AD_EARLIESTDATE
{txt}
{com}. gen AD_EARLIESTDATE = ts_42020_0_0
{txt}(499,099 missing values generated)

{com}. 
. 
. capture drop ad_diag
{txt}
{com}. gen ad_diag=.
{txt}(502,389 missing values generated)

{com}. replace ad_diag=1 if AD_EARLIESTDATE~=.
{txt}(3,290 real changes made)

{com}. replace ad_diag=0 if ad_diag~=1
{txt}(499,099 real changes made)

{com}. 
. *Years of Birth*
. capture drop birthyear
{txt}
{com}. gen birthyear=n_34_0_0 
{txt}(3 missing values generated)

{com}. 
. *Month of Birth*
. capture drop birthmonth
{txt}
{com}. gen birthmonth=n_52_0_0 
{txt}(3 missing values generated)

{com}. 
. *Date of birth*
. capture drop birthdate
{txt}
{com}. gen birthdate=mdy(birthmonth,14,birthyear)
{txt}(3 missing values generated)

{com}. 
. *Baseline Cohort Start Date*
. capture drop startdate
{txt}
{com}. gen startdate=ts_53_0_0 
{txt}
{com}. format startdate %d
{txt}
{com}. 
. *Baseline age**
. capture drop baselineage
{txt}
{com}. gen baselineage=(startdate-birthdate)/365.25
{txt}(3 missing values generated)

{com}. 
. *Death Date*
. capture drop deathdate
{txt}
{com}. gen deathdate = ts_40000_0_0 
{txt}(464,492 missing values generated)

{com}. replace deathdate =  ts_40000_1_0 if deathdate ==.
{txt}(0 real changes made)

{com}. format deathdate %d
{txt}
{com}. label var deathdate "date of death"
{txt}
{com}. 
. **Died vs. not**
. capture drop died
{txt}
{com}. gen died=.
{txt}(502,389 missing values generated)

{com}. replace died=1 if deathdate~=.
{txt}(37,897 real changes made)

{com}. replace died=0 if deathdate==.
{txt}(464,492 real changes made)

{com}. 
. **Age of death**
. **https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=40007
. 
. capture drop deathage
{txt}
{com}. gen deathage=.
{txt}(502,389 missing values generated)

{com}. replace deathage=n_40007_0_0 if n_40007_0_0~=.
{txt}(37,897 real changes made)

{com}. replace deathage=n_40007_1_0 if n_40007_1_0~=.
{txt}(0 real changes made)

{com}. 
. **https://biobank.ndph.ox.ac.uk/ukb/exinfo.cgi?src=Data_providers_and_dates**
. 
. *Generate exit date:
. capture drop doexit
{txt}
{com}. gen doexit = deathdate if died==1
{txt}(464,492 missing values generated)

{com}. replace doexit = d(31oct2021) if doexit==. & died==0
{txt}(464,492 real changes made)

{com}. format doexit %d
{txt}
{com}. 
. *Generate follow-up time between start and end among those who survived during follow-up without incident outcome*
. capture drop time0_0 timeyrs0_0
{txt}
{com}. gen time0_0 = doexit - startdate if died==0
{txt}(37,897 missing values generated)

{com}. gen timeyrs0_0 = time0_0/365.25
{txt}(37,897 missing values generated)

{com}. label var time0_0 "follow up time in days if no incident outcome and survived, days"
{txt}
{com}. label var timeyrs0_0 "follow up time in years if no incident outcome and survived, years"
{txt}
{com}. 
. *Generate follow-up time between start and end among those who died during follow-up without incident outcome*
. capture drop time1_0 timeyrs1_0
{txt}
{com}. gen time1_0 = doexit - startdate if died==1
{txt}(464,492 missing values generated)

{com}. gen timeyrs1_0 = time1_0 /365.25
{txt}(464,492 missing values generated)

{com}. label var time1_0 "follow up time in days if no incident outcome and died, days"
{txt}
{com}. label var timeyrs1_0 "follow up time in years if no incident outcome and died, years"
{txt}
{com}. 
. 
. ***Generate dementia earliest date for incident cases: **
. 
. **Field IDField title
. **42018Date of all cause dementia report
. **42019Source of all cause dementia report
. **42020Date of alzheimer's disease report
. **42021Source of alzheimer's disease report
. **42022Date of vascular dementia report
. **42023Source of vascular dementia report
. **42024Date of frontotemporal dementia report
. **42025Source of frontotemporal dementia r
. 
. 
. ***Generate Alzheimer's Disease earliest date for incident cases**
. **42020         Date of alzheimer's disease report      Dementia outcomes  (**https://biobank.ctsu.ox.ac.uk/crystal/field.cgi?id=42020)
. 
. 
. 
. ****Generate follow-up time between start and end among those who survived or died during follow-up but with  incident all-cause dementia*
. capture drop time01_1A 
{txt}
{com}. capture drop time01_1Ayears
{txt}
{com}. gen time01_1A = DEMENTIA_EARLIESTDATE - startdate 
{txt}(494,493 missing values generated)

{com}. gen time01_1Ayears = time01_1A/365.25 
{txt}(494,493 missing values generated)

{com}. replace time01_1Ayears=time01_1Ayears if time01_1Ayears>-10
{txt}(0 real changes made)

{com}. label var time01_1A "follow up time in days if Dementia incident outcome and died/survived, days"
{txt}
{com}. label var time01_1Ayears "follow up time in days if Dementia incident outcome and died/survived, years"
{txt}
{com}. 
. 
. ****Generate follow-up time between start and end among those who survived or died during follow-up but with  incident AD*
. capture drop time01_1B 
{txt}
{com}. capture drop time01_1Byears
{txt}
{com}. gen time01_1B = AD_EARLIESTDATE - startdate
{txt}(499,099 missing values generated)

{com}. gen time01_1Byears = time01_1B/365.25 
{txt}(499,099 missing values generated)

{com}. replace time01_1Byears=time01_1Byears if time01_1Byears>-10
{txt}(0 real changes made)

{com}. label var time01_1B "follow up time in days if AD incident outcome and died/survived, days"
{txt}
{com}. label var time01_1Byears "follow up time in years if AD incident outcome and died/survived, years"
{txt}
{com}. 
. 
. **Generate time to all-cause dementia**
. 
. capture drop time_dementia
{txt}
{com}. gen time_dementia=.
{txt}(502,389 missing values generated)

{com}. replace time_dementia=timeyrs1_0  if dem_diag==0 & died==1
{txt}(34,086 real changes made)

{com}. replace time_dementia=time01_1Ayears   if dem_diag==1 
{txt}(7,896 real changes made)

{com}. replace time_dementia=timeyrs0_0   if time_dementia==.
{txt}(460,407 real changes made)

{com}. 
. 
. 
. **Generate time to AD dementia**
. capture drop time_AD
{txt}
{com}. gen time_AD=.
{txt}(502,389 missing values generated)

{com}. replace time_AD=timeyrs1_0  if ad_diag==0 & died==1
{txt}(36,338 real changes made)

{com}. replace time_AD=time01_1Byears   if ad_diag==1 
{txt}(3,290 real changes made)

{com}. replace time_AD=timeyrs0_0   if time_AD==.
{txt}(462,761 real changes made)

{com}. 
. 
. **Generate Age to incident all-cause dementia or death or end of follow-up**
. capture drop Age_dementia
{txt}
{com}. gen Age_dementia=.
{txt}(502,389 missing values generated)

{com}. replace Age_dementia=baselineage+time_dementia 
{txt}(502,386 real changes made)

{com}.  
. 
. **Generate Age to incident AD dementia or death or end of follow-up**
. 
. capture drop Age_AD
{txt}
{com}. gen Age_AD=baselineage+time_AD 
{txt}(3 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\ADDEMENTIA_UKB.dta{rm}
saved
{p_end}

{com}. 
. //STEP 13: MERGE DATASETS TOGETHER//
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\ADDEMENTIA_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\ADDEMENTIA_UKB.dta{rm}
saved
{p_end}

{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB",clear
{txt}
{com}. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\LE8_UKB.dta{rm}
saved
{p_end}

{com}. 
. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\COGN_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. capture drop _merge
{txt}
{com}. sort n_eid
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\ADDEMENTIA_UKB"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\UKB_PAPER3_LE8INFECTDEM", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER3_LE8INFECTDEM\DATA\UKB_PAPER3_LE8INFECTDEM.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}